[Killed] LogicalOperator
src/vtt/party-pack.ts:704:9
     context.addIssue({ code: 'custom', message: 'This typed feature is automatic and cannot spend a resource.' });
   }
   if (effect.kind === 'persistent_area') {
-    if (effect.origin === 'self' && effect.movableFeet !== null) {
+    if (effect.origin === 'self' || effect.movableFeet !== null) {
       context.addIssue({ code: 'custom', message: 'A self-anchored area cannot also move independently.' });
     }
killedBy: external party-pack boundary loads the v2 persistent-area effect vocabulary and refuses malformed hook payloads
statusReason: expected 'refused' to be 'loaded' // Object.is equality

[Killed] EqualityOperator
src/vtt/party-pack.ts:704:37
     context.addIssue({ code: 'custom', message: 'This typed feature is automatic and cannot spend a resource.' });
   }
   if (effect.kind === 'persistent_area') {
-    if (effect.origin === 'self' && effect.movableFeet !== null) {
+    if (effect.origin === 'self' && effect.movableFeet === null) {
       context.addIssue({ code: 'custom', message: 'A self-anchored area cannot also move independently.' });
     }
killedBy: external party-pack boundary loads the v2 persistent-area effect vocabulary and refuses malformed hook payloads
statusReason: expected 'refused' to be 'loaded' // Object.is equality

[NoCoverage] StringLiteral
src/vtt/party-pack.ts:705:51
   }
   if (effect.kind === 'persistent_area') {
     if (effect.origin === 'self' && effect.movableFeet !== null) {
-      context.addIssue({ code: 'custom', message: 'A self-anchored area cannot also move independently.' });
+      context.addIssue({ code: 'custom', message: "" });
     }
     for (const hook of effect.hooks) {

[Survived] BlockStatement
src/vtt/party-pack.ts:707:38
     if (effect.origin === 'self' && effect.movableFeet !== null) {
       context.addIssue({ code: 'custom', message: 'A self-anchored area cannot also move independently.' });
     }
-    for (const hook of effect.hooks) {
-      if (hook.effect.kind === 'automatic' && hook.effect.payload.kind !== 'damage' && hook.effect.payload.lifetime.kind === 'save_ends') {
-        context.addIssue({ code: 'custom', message: 'A save-ends area payload requires a save gate.' });
-      }
-      if (hook.effect.kind === 'save_gated' && hook.effect.onSuccess === 'half' && hook.effect.payload.kind !== 'damage') {
-        context.addIssue({ code: 'custom', message: 'Only area damage can resolve to half on a successful save.' });
-      }
-    }
+    for (const hook of effect.hooks) {}
   }
 });

[Killed] ConditionalExpression
src/vtt/party-pack.ts:708:11
       context.addIssue({ code: 'custom', message: 'A self-anchored area cannot also move independently.' });
     }
     for (const hook of effect.hooks) {
-      if (hook.effect.kind === 'automatic' && hook.effect.payload.kind !== 'damage' && hook.effect.payload.lifetime.kind === 'save_ends') {
+      if (true) {
         context.addIssue({ code: 'custom', message: 'A save-ends area payload requires a save gate.' });
       }
killedBy: external party-pack boundary loads the v2 persistent-area effect vocabulary and refuses malformed hook payloads
statusReason: expected 'refused' to be 'loaded' // Object.is equality

[Killed] EqualityOperator
src/vtt/party-pack.ts:708:88
       context.addIssue({ code: 'custom', message: 'A self-anchored area cannot also move independently.' });
     }
     for (const hook of effect.hooks) {
-      if (hook.effect.kind === 'automatic' && hook.effect.payload.kind !== 'damage' && hook.effect.payload.lifetime.kind === 'save_ends') {
+      if (hook.effect.kind === 'automatic' && hook.effect.payload.kind !== 'damage' && hook.effect.payload.lifetime.kind !== 'save_ends') {
         context.addIssue({ code: 'custom', message: 'A save-ends area payload requires a save gate.' });
       }
killedBy: external party-pack boundary loads the v2 persistent-area effect vocabulary and refuses malformed hook payloads
statusReason: expected 'refused' to be 'loaded' // Object.is equality

[NoCoverage] StringLiteral
src/vtt/party-pack.ts:709:53
     }
     for (const hook of effect.hooks) {
       if (hook.effect.kind === 'automatic' && hook.effect.payload.kind !== 'damage' && hook.effect.payload.lifetime.kind === 'save_ends') {
-        context.addIssue({ code: 'custom', message: 'A save-ends area payload requires a save gate.' });
+        context.addIssue({ code: 'custom', message: "" });
       }
       if (hook.effect.kind === 'save_gated' && hook.effect.onSuccess === 'half' && hook.effect.payload.kind !== 'damage') {

[Killed] LogicalOperator
src/vtt/party-pack.ts:711:11
       if (hook.effect.kind === 'automatic' && hook.effect.payload.kind !== 'damage' && hook.effect.payload.lifetime.kind === 'save_ends') {
         context.addIssue({ code: 'custom', message: 'A save-ends area payload requires a save gate.' });
       }
-      if (hook.effect.kind === 'save_gated' && hook.effect.onSuccess === 'half' && hook.effect.payload.kind !== 'damage') {
+      if (hook.effect.kind === 'save_gated' && hook.effect.onSuccess === 'half' || hook.effect.payload.kind !== 'damage') {
         context.addIssue({ code: 'custom', message: 'Only area damage can resolve to half on a successful save.' });
       }
killedBy: external party-pack boundary loads the v2 persistent-area effect vocabulary and refuses malformed hook payloads
statusReason: expected 'refused' to be 'loaded' // Object.is equality

[Killed] ConditionalExpression
src/vtt/party-pack.ts:711:11
       if (hook.effect.kind === 'automatic' && hook.effect.payload.kind !== 'damage' && hook.effect.payload.lifetime.kind === 'save_ends') {
         context.addIssue({ code: 'custom', message: 'A save-ends area payload requires a save gate.' });
       }
-      if (hook.effect.kind === 'save_gated' && hook.effect.onSuccess === 'half' && hook.effect.payload.kind !== 'damage') {
+      if (true) {
         context.addIssue({ code: 'custom', message: 'Only area damage can resolve to half on a successful save.' });
       }
killedBy: external party-pack boundary loads the v2 persistent-area effect vocabulary and refuses malformed hook payloads
statusReason: expected 'refused' to be 'loaded' // Object.is equality

[Survived] ObjectLiteral
src/vtt/party-pack.ts:720:43
 
 export const externalPartyPackFeatureEffectSchema = featureEffectSchema;
 
-const passiveSkillSchema = z.strictObject({
-  skillId: z.enum(skills),
-  bonus: modifierSchema,
-});
+const passiveSkillSchema = z.strictObject({});
 
 const passiveDamageResponseSchema = z.strictObject({

[Survived] MethodExpression
src/vtt/party-pack.ts:738:17
   armorClassBonus: modifierSchema.optional(),
   initiativeBonus: modifierSchema.optional(),
   savingThrowBonuses: z.strictObject(optionalSaveModifierShape).optional(),
-  skillBonuses: z.array(passiveSkillSchema).max(skills.length).optional(),
+  skillBonuses: z.array(passiveSkillSchema).min(skills.length).optional(),
   speedAdjustmentFeet: modifierSchema.optional(),
   damageResponses: z.array(passiveDamageResponseSchema).max(damageTypes.length).optional(),

[Killed] MethodExpression
src/vtt/party-pack.ts:740:20
   savingThrowBonuses: z.strictObject(optionalSaveModifierShape).optional(),
   skillBonuses: z.array(passiveSkillSchema).max(skills.length).optional(),
   speedAdjustmentFeet: modifierSchema.optional(),
-  damageResponses: z.array(passiveDamageResponseSchema).max(damageTypes.length).optional(),
+  damageResponses: z.array(passiveDamageResponseSchema).min(damageTypes.length).optional(),
   conditionImmunities: z.array(z.enum(conditionNames)).max(conditionNames.length).optional(),
 });
killedBy: external party-pack boundary attack damage-type choice changes the target resistance interaction
statusReason: expected 'refused' to be 'loaded' // Object.is equality

[Survived] MethodExpression
src/vtt/party-pack.ts:741:24
   skillBonuses: z.array(passiveSkillSchema).max(skills.length).optional(),
   speedAdjustmentFeet: modifierSchema.optional(),
   damageResponses: z.array(passiveDamageResponseSchema).max(damageTypes.length).optional(),
-  conditionImmunities: z.array(z.enum(conditionNames)).max(conditionNames.length).optional(),
+  conditionImmunities: z.array(z.enum(conditionNames)).min(conditionNames.length).optional(),
 });
 

[Killed] ConditionalExpression
src/vtt/party-pack.ts:745:42
 });
 
 const manifestSpellIdSchema = z.string().refine(
-  (id) => SPELL_MANIFEST.some((spell) => spell.id === id),
+  (id) => SPELL_MANIFEST.some((spell) => false),
   'Spell selection must use a manifest spell id.',
 );
killedBy: Vane Warren loader, chaining, seats, and end-session export bounds_mismatch_reintroduced: reaches DM controls for all three authored fights with their matching art package; Vane Warren loader, chaining, seats, and end-session export carries controller assignments across a fight boundary and accepts the new roster member assignment; Vane Warren loader, chaining, seats, and end-session export all-algorithm chain concludes Iron Voice and assigns its conditional successor roster
statusReason: [
  {
    "code": "custom",
    "path": [
      "spellcasting",
      0,
      "preparedSpellIds",
      0

[Killed] ArrowFunction
src/vtt/party-pack.ts:745:31
 });
 
 const manifestSpellIdSchema = z.string().refine(
-  (id) => SPELL_MANIFEST.some((spell) => spell.id === id),
+  (id) => SPELL_MANIFEST.some(() => undefined),
   'Spell selection must use a manifest spell id.',
 );
killedBy: external party-pack boundary loads executable party-pack v2 world operations and refuses malformed nested specs
statusReason: [
  {
    "code": "custom",
    "path": [
      "members",
      0,
      "spellcasting",
      "preparedSpellIds",

[Survived] StringLiteral
src/vtt/party-pack.ts:746:3
 
 const manifestSpellIdSchema = z.string().refine(
   (id) => SPELL_MANIFEST.some((spell) => spell.id === id),
-  'Spell selection must use a manifest spell id.',
+  "",
 );
 

[Killed] MethodExpression
src/vtt/party-pack.ts:770:15
 
 const v1MemberCoreSchema = z.strictObject({
   ...memberBaseShape,
-  spellSlots: z.array(spellSlotSchema).max(9),
+  spellSlots: z.array(spellSlotSchema).min(9),
 });
 
killedBy: external party-pack boundary v1_rejected keeps unchanged v1 packs inside the loader version window
statusReason: expected 'refused' to be 'loaded' // Object.is equality

[Killed] MethodExpression
src/vtt/party-pack.ts:777:20
   ...memberBaseShape,
   spellSlots: z.array(spellSlotSchema).max(9),
   ...memberSharedShape,
-  spellSelections: z.array(manifestSpellIdSchema).max(SPELL_MANIFEST.length),
+  spellSelections: z.array(manifestSpellIdSchema).min(SPELL_MANIFEST.length),
 });
 
killedBy: external party-pack boundary v1_rejected keeps unchanged v1 packs inside the loader version window
statusReason: [
  {
    "origin": "array",
    "code": "too_small",
    "minimum": 188,
    "inclusive": true,
    "path": [
      "members",

[Killed] MethodExpression
src/vtt/party-pack.ts:794:15
 
 const legacySpellcastingSchema = z.strictObject({
   ...spellcastingSourceShape,
-  spellSlots: z.array(v2SpellSlotSchema).max(9),
+  spellSlots: z.array(v2SpellSlotSchema).min(9),
 });
 
killedBy: external party-pack boundary loads executable party-pack v2 world operations and refuses malformed nested specs
statusReason: [
  {
    "origin": "array",
    "code": "too_small",
    "minimum": 9,
    "inclusive": true,
    "path": [
      "members",

[Killed] MethodExpression
src/vtt/party-pack.ts:811:15
 
 const legacySpellcastingInputSchema = z.strictObject({
   ...spellcastingSourceInputShape,
-  spellSlots: z.array(v2SpellSlotSchema).max(9),
+  spellSlots: z.array(v2SpellSlotSchema).min(9),
 });
 
killedBy: external party-pack boundary loads executable party-pack v2 world operations and refuses malformed nested specs
statusReason: expected 'refused' to be 'loaded' // Object.is equality

[Killed] MethodExpression
src/vtt/party-pack.ts:817:12
 const v2MemberCoreSchema = z.strictObject({
   ...memberBaseShape,
   sizeCategory: z.enum(creatureSizes),
-  hitDice: z.array(hitDicePoolSchema).min(1).max(12).optional(),
+  hitDice: z.array(hitDicePoolSchema).min(1).min(12).optional(),
 });
 
killedBy: D365 bundled dungeon acceptance authors the representative level-5 party through the production RPC surface
statusReason: party: partyPack — gaps_not_allowed

[Survived] MethodExpression
src/vtt/party-pack.ts:817:12
 const v2MemberCoreSchema = z.strictObject({
   ...memberBaseShape,
   sizeCategory: z.enum(creatureSizes),
-  hitDice: z.array(hitDicePoolSchema).min(1).max(12).optional(),
+  hitDice: z.array(hitDicePoolSchema).max(1).max(12).optional(),
 });
 

[Killed] MethodExpression
src/vtt/party-pack.ts:827:5
   ...memberSharedShape,
   spellcasting: z.union([
     legacySpellcastingSchema,
-    z.array(spellcastingSourceSchema).min(1).max(4),
+    z.array(spellcastingSourceSchema).max(1).max(4),
   ]).optional(),
   sharedSpellSlots: z.array(v2SpellSlotSchema).max(9).optional(),
killedBy: external party-pack boundary wrong_source_dc uses each prepared spell source and per_source_slots share one member pool
statusReason: [
  {
    "origin": "array",
    "code": "too_big",
    "maximum": 1,
    "inclusive": true,
    "path": [
      "spellcasting"

[Killed] MethodExpression
src/vtt/party-pack.ts:827:5
   ...memberSharedShape,
   spellcasting: z.union([
     legacySpellcastingSchema,
-    z.array(spellcastingSourceSchema).min(1).max(4),
+    z.array(spellcastingSourceSchema).min(1).min(4),
   ]).optional(),
   sharedSpellSlots: z.array(v2SpellSlotSchema).max(9).optional(),
killedBy: Vane Warren loader, chaining, seats, and end-session export bounds_mismatch_reintroduced: reaches DM controls for all three authored fights with their matching art package; Vane Warren loader, chaining, seats, and end-session export carries controller assignments across a fight boundary and accepts the new roster member assignment; Vane Warren loader, chaining, seats, and end-session export all-algorithm chain concludes Iron Voice and assigns its conditional successor roster
statusReason: [
  {
    "origin": "array",
    "code": "too_small",
    "minimum": 4,
    "inclusive": true,
    "path": [
      "spellcasting"

[Killed] MethodExpression
src/vtt/party-pack.ts:829:21
     legacySpellcastingSchema,
     z.array(spellcastingSourceSchema).min(1).max(4),
   ]).optional(),
-  sharedSpellSlots: z.array(v2SpellSlotSchema).max(9).optional(),
+  sharedSpellSlots: z.array(v2SpellSlotSchema).min(9).optional(),
   pactSpellSlots: z.array(pactSpellSlotSchema).max(9).optional(),
   effects: z.array(externalPartyPackFeatureEffectSchema).max(100).optional(),
killedBy: Vane Warren loader, chaining, seats, and end-session export bounds_mismatch_reintroduced: reaches DM controls for all three authored fights with their matching art package; Vane Warren loader, chaining, seats, and end-session export carries controller assignments across a fight boundary and accepts the new roster member assignment; Vane Warren loader, chaining, seats, and end-session export all-algorithm chain concludes Iron Voice and assigns its conditional successor roster
statusReason: [
  {
    "origin": "array",
    "code": "too_small",
    "minimum": 9,
    "inclusive": true,
    "path": [
      "sharedSpellSlots"

[Killed] MethodExpression
src/vtt/party-pack.ts:830:19
     z.array(spellcastingSourceSchema).min(1).max(4),
   ]).optional(),
   sharedSpellSlots: z.array(v2SpellSlotSchema).max(9).optional(),
-  pactSpellSlots: z.array(pactSpellSlotSchema).max(9).optional(),
+  pactSpellSlots: z.array(pactSpellSlotSchema).min(9).optional(),
   effects: z.array(externalPartyPackFeatureEffectSchema).max(100).optional(),
   resources: z.array(externalPartyPackResourceSchema).max(100).optional(),
killedBy: Vane Warren loader, chaining, seats, and end-session export bounds_mismatch_reintroduced: reaches DM controls for all three authored fights with their matching art package; Vane Warren loader, chaining, seats, and end-session export carries controller assignments across a fight boundary and accepts the new roster member assignment; Vane Warren loader, chaining, seats, and end-session export all-algorithm chain concludes Iron Voice and assigns its conditional successor roster
statusReason: [
  {
    "origin": "array",
    "code": "too_small",
    "minimum": 9,
    "inclusive": true,
    "path": [
      "pactSpellSlots"

[Killed] MethodExpression
src/vtt/party-pack.ts:831:12
   ]).optional(),
   sharedSpellSlots: z.array(v2SpellSlotSchema).max(9).optional(),
   pactSpellSlots: z.array(pactSpellSlotSchema).max(9).optional(),
-  effects: z.array(externalPartyPackFeatureEffectSchema).max(100).optional(),
+  effects: z.array(externalPartyPackFeatureEffectSchema).min(100).optional(),
   resources: z.array(externalPartyPackResourceSchema).max(100).optional(),
   passives: passivesSchema.optional(),
killedBy: external party-pack boundary declares executable damage operations and armed weapon-hit riders in party-pack v2
statusReason: [
  {
    "origin": "array",
    "code": "too_small",
    "minimum": 100,
    "inclusive": true,
    "path": [
      "effects"

[Killed] MethodExpression
src/vtt/party-pack.ts:832:14
   sharedSpellSlots: z.array(v2SpellSlotSchema).max(9).optional(),
   pactSpellSlots: z.array(pactSpellSlotSchema).max(9).optional(),
   effects: z.array(externalPartyPackFeatureEffectSchema).max(100).optional(),
-  resources: z.array(externalPartyPackResourceSchema).max(100).optional(),
+  resources: z.array(externalPartyPackResourceSchema).min(100).optional(),
   passives: passivesSchema.optional(),
   worldOperations: z.array(externalWorldOperationSchema).max(100).optional(),
killedBy: external party-pack boundary declares executable damage operations and armed weapon-hit riders in party-pack v2
statusReason: [
  {
    "origin": "array",
    "code": "too_small",
    "minimum": 100,
    "inclusive": true,
    "path": [
      "resources"

[Killed] MethodExpression
src/vtt/party-pack.ts:834:20
   effects: z.array(externalPartyPackFeatureEffectSchema).max(100).optional(),
   resources: z.array(externalPartyPackResourceSchema).max(100).optional(),
   passives: passivesSchema.optional(),
-  worldOperations: z.array(externalWorldOperationSchema).max(100).optional(),
+  worldOperations: z.array(externalWorldOperationSchema).min(100).optional(),
 }).superRefine((member, context) => {
   if (Array.isArray(member.spellcasting) && member.sharedSpellSlots === undefined) {
killedBy: external party-pack boundary loads executable party-pack v2 world operations and refuses malformed nested specs
statusReason: [
  {
    "origin": "array",
    "code": "too_small",
    "minimum": 100,
    "inclusive": true,
    "path": [
      "worldOperations"

[Survived] BlockStatement
src/vtt/party-pack.ts:835:37
   resources: z.array(externalPartyPackResourceSchema).max(100).optional(),
   passives: passivesSchema.optional(),
   worldOperations: z.array(externalWorldOperationSchema).max(100).optional(),
-}).superRefine((member, context) => {
-  if (Array.isArray(member.spellcasting) && member.sharedSpellSlots === undefined) {
-    context.addIssue({
-      code: 'custom',
-      path: ['sharedSpellSlots'],
-      message: 'Array-form spellcasting sources require member-level sharedSpellSlots.',
-    });
-  }
-});
+}).superRefine((member, context) => {});
 
 const externalPartyPackV1Schema = z.strictObject({

[Killed] EqualityOperator
src/vtt/party-pack.ts:836:45
   passives: passivesSchema.optional(),
   worldOperations: z.array(externalWorldOperationSchema).max(100).optional(),
 }).superRefine((member, context) => {
-  if (Array.isArray(member.spellcasting) && member.sharedSpellSlots === undefined) {
+  if (Array.isArray(member.spellcasting) && member.sharedSpellSlots !== undefined) {
     context.addIssue({
       code: 'custom',
killedBy: Vane Warren loader, chaining, seats, and end-session export bounds_mismatch_reintroduced: reaches DM controls for all three authored fights with their matching art package; Vane Warren loader, chaining, seats, and end-session export carries controller assignments across a fight boundary and accepts the new roster member assignment; Vane Warren loader, chaining, seats, and end-session export all-algorithm chain concludes Iron Voice and assigns its conditional successor roster
statusReason: [
  {
    "code": "custom",
    "path": [
      "sharedSpellSlots"
    ],
    "message": "Array-form spellcasting sources require member-level sharedSpellSlots."
  }

[Killed] ConditionalExpression
src/vtt/party-pack.ts:836:45
   passives: passivesSchema.optional(),
   worldOperations: z.array(externalWorldOperationSchema).max(100).optional(),
 }).superRefine((member, context) => {
-  if (Array.isArray(member.spellcasting) && member.sharedSpellSlots === undefined) {
+  if (Array.isArray(member.spellcasting) && true) {
     context.addIssue({
       code: 'custom',
killedBy: Vane Warren loader, chaining, seats, and end-session export bounds_mismatch_reintroduced: reaches DM controls for all three authored fights with their matching art package; Vane Warren loader, chaining, seats, and end-session export carries controller assignments across a fight boundary and accepts the new roster member assignment; Vane Warren loader, chaining, seats, and end-session export all-algorithm chain concludes Iron Voice and assigns its conditional successor roster
statusReason: [
  {
    "code": "custom",
    "path": [
      "sharedSpellSlots"
    ],
    "message": "Array-form spellcasting sources require member-level sharedSpellSlots."
  }

[NoCoverage] StringLiteral
src/vtt/party-pack.ts:839:14
   if (Array.isArray(member.spellcasting) && member.sharedSpellSlots === undefined) {
     context.addIssue({
       code: 'custom',
-      path: ['sharedSpellSlots'],
+      path: [""],
       message: 'Array-form spellcasting sources require member-level sharedSpellSlots.',
     });

[Killed] MethodExpression
src/vtt/party-pack.ts:849:12
   schemaVersion: z.literal(EXTERNAL_PARTY_PACK_MINIMUM_SCHEMA_VERSION),
   partyId: partyIdSchema,
   allowPartial: z.boolean(),
-  members: z.array(v1MemberSchema).min(3).max(5),
+  members: z.array(v1MemberSchema).min(3).min(5),
 });
 
killedBy: external party-pack boundary v1_rejected keeps unchanged v1 packs inside the loader version window
statusReason: [
  {
    "origin": "array",
    "code": "too_small",
    "minimum": 5,
    "inclusive": true,
    "path": [
      "members"

[Survived] MethodExpression
src/vtt/party-pack.ts:849:12
   schemaVersion: z.literal(EXTERNAL_PARTY_PACK_MINIMUM_SCHEMA_VERSION),
   partyId: partyIdSchema,
   allowPartial: z.boolean(),
-  members: z.array(v1MemberSchema).min(3).max(5),
+  members: z.array(v1MemberSchema).max(3).max(5),
 });
 

[Killed] MethodExpression
src/vtt/party-pack.ts:856:12
   schemaVersion: z.literal(EXTERNAL_PARTY_PACK_SCHEMA_VERSION),
   partyId: partyIdSchema,
   allowPartial: z.boolean(),
-  members: z.array(v2MemberSchema).min(3).max(5),
+  members: z.array(v2MemberSchema).min(3).min(5),
 });
 
killedBy: external party-pack boundary loads executable party-pack v2 world operations and refuses malformed nested specs
statusReason: [
  {
    "origin": "array",
    "code": "too_small",
    "minimum": 5,
    "inclusive": true,
    "path": [
      "members"

[Killed] MethodExpression
src/vtt/party-pack.ts:856:12
   schemaVersion: z.literal(EXTERNAL_PARTY_PACK_SCHEMA_VERSION),
   partyId: partyIdSchema,
   allowPartial: z.boolean(),
-  members: z.array(v2MemberSchema).min(3).max(5),
+  members: z.array(v2MemberSchema).max(3).max(5),
 });
 
killedBy: external party-pack boundary loads generated valid 3-5 member packs into branded combat profiles
statusReason: [
  {
    "origin": "array",
    "code": "too_big",
    "maximum": 3,
    "inclusive": true,
    "path": [
      "members"

[Killed] MethodExpression
src/vtt/party-pack.ts:865:13
 ]);
 
 export const externalPackPartySourceSchema = z.strictObject({
-  packFile: z.string().min(1).max(4_096).refine(
+  packFile: z.string().max(1).max(4_096).refine(
     (value) => value.trim() === value,
     'External party-pack paths must be trimmed.',
killedBy: increment 9 generated and approved encounter fixtures OWN-EXTERNAL-PACK-BYPASSES-LOADER carries the file seam and requires the loader path
statusReason: expected [Function] to throw error including 'External party pack /tmp/generic-part…' but got '[\n  {\n    "origin": "string",\n    …'

[Killed] MethodExpression
src/vtt/party-pack.ts:865:13
 ]);
 
 export const externalPackPartySourceSchema = z.strictObject({
-  packFile: z.string().min(1).max(4_096).refine(
+  packFile: z.string().min(1).min(4_096).refine(
     (value) => value.trim() === value,
     'External party-pack paths must be trimmed.',
killedBy: increment 9 generated and approved encounter fixtures OWN-EXTERNAL-PACK-BYPASSES-LOADER carries the file seam and requires the loader path
statusReason: expected [Function] to throw error including 'External party pack /tmp/generic-part…' but got '[\n  {\n    "origin": "string",\n    …'

[Killed] ArrowFunction
src/vtt/party-pack.ts:866:5
 
 export const externalPackPartySourceSchema = z.strictObject({
   packFile: z.string().min(1).max(4_096).refine(
-    (value) => value.trim() === value,
+    () => undefined,
     'External party-pack paths must be trimmed.',
   ),
killedBy: increment 9 generated and approved encounter fixtures OWN-EXTERNAL-PACK-BYPASSES-LOADER carries the file seam and requires the loader path
statusReason: expected [Function] to throw error including 'External party pack /tmp/generic-part…' but got '[\n  {\n    "code": "custom",\n    "p…'

[Killed] ConditionalExpression
src/vtt/party-pack.ts:866:16
 
 export const externalPackPartySourceSchema = z.strictObject({
   packFile: z.string().min(1).max(4_096).refine(
-    (value) => value.trim() === value,
+    (value) => false,
     'External party-pack paths must be trimmed.',
   ),
killedBy: increment 9 generated and approved encounter fixtures OWN-EXTERNAL-PACK-BYPASSES-LOADER carries the file seam and requires the loader path
statusReason: expected [Function] to throw error including 'External party pack /tmp/generic-part…' but got '[\n  {\n    "code": "custom",\n    "p…'

[Survived] StringLiteral
src/vtt/party-pack.ts:867:5
 export const externalPackPartySourceSchema = z.strictObject({
   packFile: z.string().min(1).max(4_096).refine(
     (value) => value.trim() === value,
-    'External party-pack paths must be trimmed.',
+    "",
   ),
 });

[Killed] ArrayDeclaration
src/vtt/party-pack.ts:1033:34
   'attacks',
   'startingConditions',
 ] as const;
-const V1_MEMBER_FIELDS = new Set([
-  ...SHARED_MEMBER_FIELDS,
-  'spellSlots',
-  'spellSelections',
-]);
+const V1_MEMBER_FIELDS = new Set([]);
 const V2_MEMBER_FIELDS = new Set([
   ...SHARED_MEMBER_FIELDS,
killedBy: external party-pack boundary v1_rejected keeps unchanged v1 packs inside the loader version window
statusReason: expected 'refused' to be 'loaded' // Object.is equality

[Killed] StringLiteral
src/vtt/party-pack.ts:1040:3
 ]);
 const V2_MEMBER_FIELDS = new Set([
   ...SHARED_MEMBER_FIELDS,
-  'sizeCategory',
+  "",
   'hitDice',
   'spellcasting',
killedBy: external party-pack boundary loads executable party-pack v2 world operations and refuses malformed nested specs
statusReason: expected 'refused' to be 'loaded' // Object.is equality

[Killed] StringLiteral
src/vtt/party-pack.ts:1043:3
   'sizeCategory',
   'hitDice',
   'spellcasting',
-  'sharedSpellSlots',
+  "",
   'pactSpellSlots',
   'effects',
killedBy: D365 bundled dungeon acceptance authors the representative level-5 party through the production RPC surface
statusReason: party: partyPack — gaps_not_allowed

[Killed] StringLiteral
src/vtt/party-pack.ts:1044:3
   'hitDice',
   'spellcasting',
   'sharedSpellSlots',
-  'pactSpellSlots',
+  "",
   'effects',
   'resources',
killedBy: D365 bundled dungeon acceptance authors the representative level-5 party through the production RPC surface
statusReason: party: partyPack — gaps_not_allowed

[Killed] StringLiteral
src/vtt/party-pack.ts:1045:3
   'spellcasting',
   'sharedSpellSlots',
   'pactSpellSlots',
-  'effects',
+  "",
   'resources',
   'passives',
killedBy: external party-pack boundary declares executable damage operations and armed weapon-hit riders in party-pack v2
statusReason: expected 'refused' to be 'loaded' // Object.is equality

[Killed] StringLiteral
src/vtt/party-pack.ts:1047:3
   'pactSpellSlots',
   'effects',
   'resources',
-  'passives',
+  "",
   'worldOperations',
 ]);
killedBy: external party-pack boundary passive_off_by_one applies AC and save passives exactly at their success boundaries
statusReason: expected 'refused' to be 'loaded' // Object.is equality

[Killed] ArrayDeclaration
src/vtt/party-pack.ts:1050:30
   'passives',
   'worldOperations',
 ]);
-const CLASS_FIELDS = new Set(['classId', 'level']);
+const CLASS_FIELDS = new Set([]);
 const ABILITY_FIELDS = new Set<string>(abilities);
 const SPELL_SLOT_FIELDS = new Set(['level', 'maximum']);
killedBy: external party-pack boundary loads executable party-pack v2 world operations and refuses malformed nested specs
statusReason: expected 'refused' to be 'loaded' // Object.is equality

[Killed] StringLiteral
src/vtt/party-pack.ts:1052:36
 ]);
 const CLASS_FIELDS = new Set(['classId', 'level']);
 const ABILITY_FIELDS = new Set<string>(abilities);
-const SPELL_SLOT_FIELDS = new Set(['level', 'maximum']);
+const SPELL_SLOT_FIELDS = new Set(["", 'maximum']);
 const V2_SPELL_SLOT_FIELDS = new Set(['level', 'count', 'recharge']);
 const HIT_DICE_FIELDS = new Set(['sides', 'maximum']);
killedBy: external party-pack boundary v1_rejected keeps unchanged v1 packs inside the loader version window
statusReason: expected 'refused' to be 'loaded' // Object.is equality
