[Killed] ConditionalExpression
src/combat/controllers.ts:174:63
   id: CombatantId,
 ) {
   const target = request.visibleState.combatants.find((candidate) => candidate.id === id);
-  return target !== undefined && target.kind !== actorKind && target.life !== 'dead'
+  return target !== undefined && target.kind !== actorKind && true
     ? target
     : null;
killedBy: controller mutation contract: player-character ranking does not prioritize dead hostile attacks or dead ally healing
statusReason: expected { type: 'opportunity_attack', …(9) } to be { type: 'attack', …(9) } // Object.is equality

[Killed] ConditionalExpression
src/combat/controllers.ts:397:7
   }
   if (command.type === 'dash') return [5, 0, 0, commandKey(command)];
   if (command.type === 'decline_reaction') return [6, 0, 0, commandKey(command)];
-  if (command.type === 'end_turn') return [9, 0, 0, commandKey(command)];
+  if (true) return [9, 0, 0, commandKey(command)];
   return [8, 0, 0, commandKey(command)];
 }
killedBy: controller mutation contract: player-character ranking keeps an adjacent ranged actor in place and ranks decline/end/fallback distinctly
statusReason: expected { type: 'end_turn', …(1) } to deeply equal { type: 'hide', …(1) }

[Killed] ConditionalExpression
src/combat/controllers.ts:440:7
     return [2, nearest, 0, commandKey(command)];
   }
   if (command.type === 'decline_reaction') return [3, 0, 0, commandKey(command)];
-  if (command.type === 'end_turn') return [5, 0, 0, commandKey(command)];
+  if (true) return [5, 0, 0, commandKey(command)];
   return [4, 0, 0, commandKey(command)];
 }
killedBy: controller mutation contract: monster ranking ranks decline, fallback, and end-turn in their exact order
statusReason: expected { type: 'end_turn', …(1) } to deeply equal { type: 'hide', …(1) }

[Killed] EqualityOperator
src/combat/controllers.ts:524:52
               score: 1_000 - target.hitPoints,
             });
           } else if (command.type === 'force_save') {
-            const target = enemies.find((enemy) => enemy.id === command.target);
+            const target = enemies.find((enemy) => enemy.id !== command.target);
             if (target === undefined) continue;
             candidates.push({
killedBy: controller mutation contract: turn-program enumeration retains a legal force-save program only for its exact hostile target
statusReason: expected [ …(2) ] to deeply equal [ …(2) ]

[Killed] ConditionalExpression
src/combat/controllers.ts:524:52
               score: 1_000 - target.hitPoints,
             });
           } else if (command.type === 'force_save') {
-            const target = enemies.find((enemy) => enemy.id === command.target);
+            const target = enemies.find((enemy) => true);
             if (target === undefined) continue;
             candidates.push({
killedBy: controller mutation contract: turn-program enumeration retains a legal force-save program only for its exact hostile target
statusReason: expected [ …(2) ] to deeply equal [ …(2) ]
