[Killed] ConditionalExpression
src/vtt/party-pack.ts:3264:15
           return false;
         });
         const resourceSpellUses = (source.resourceSpellUses ?? []).filter((use, useIndex, uses) => {
-          if (!sourceSpellIds.includes(use.spellId)) {
+          if (true) {
             if (!SPELL_MANIFEST.some((spell) => spell.id === use.spellId)) unknownSpellId = true;
             gaps.push(issueGap(
killedBy: external party-pack boundary rider_never_fires makes an on_hit typed rider change the synthetic encounter outcome
statusReason: expected 'refused' to be 'loaded' // Object.is equality

[Killed] BooleanLiteral
src/vtt/party-pack.ts:3264:15
           return false;
         });
         const resourceSpellUses = (source.resourceSpellUses ?? []).filter((use, useIndex, uses) => {
-          if (!sourceSpellIds.includes(use.spellId)) {
+          if (sourceSpellIds.includes(use.spellId)) {
             if (!SPELL_MANIFEST.some((spell) => spell.id === use.spellId)) unknownSpellId = true;
             gaps.push(issueGap(
killedBy: external party-pack boundary rider_never_fires makes an on_hit typed rider change the synthetic encounter outcome
statusReason: expected 'refused' to be 'loaded' // Object.is equality

[NoCoverage] BooleanLiteral
src/vtt/party-pack.ts:3265:93
         });
         const resourceSpellUses = (source.resourceSpellUses ?? []).filter((use, useIndex, uses) => {
           if (!sourceSpellIds.includes(use.spellId)) {
-            if (!SPELL_MANIFEST.some((spell) => spell.id === use.spellId)) unknownSpellId = true;
+            if (!SPELL_MANIFEST.some((spell) => spell.id === use.spellId)) unknownSpellId = false;
             gaps.push(issueGap(
               entry,

[NoCoverage] ConditionalExpression
src/vtt/party-pack.ts:3265:49
         });
         const resourceSpellUses = (source.resourceSpellUses ?? []).filter((use, useIndex, uses) => {
           if (!sourceSpellIds.includes(use.spellId)) {
-            if (!SPELL_MANIFEST.some((spell) => spell.id === use.spellId)) unknownSpellId = true;
+            if (!SPELL_MANIFEST.some((spell) => false)) unknownSpellId = true;
             gaps.push(issueGap(
               entry,

[Killed] ArrowFunction
src/vtt/party-pack.ts:3273:40
             ));
             return false;
           }
-          const first = uses.findIndex((candidate) =>
-            candidate.spellId === use.spellId && candidate.resourcePoolId === use.resourcePoolId);
+          const first = uses.findIndex(() => undefined);
           if (first === useIndex) return true;
           gaps.push(issueGap(
killedBy: external party-pack boundary rider_never_fires makes an on_hit typed rider change the synthetic encounter outcome
statusReason: expected 'refused' to be 'loaded' // Object.is equality

[Killed] EqualityOperator
src/vtt/party-pack.ts:3274:50
             return false;
           }
           const first = uses.findIndex((candidate) =>
-            candidate.spellId === use.spellId && candidate.resourcePoolId === use.resourcePoolId);
+            candidate.spellId === use.spellId && candidate.resourcePoolId !== use.resourcePoolId);
           if (first === useIndex) return true;
           gaps.push(issueGap(
killedBy: external party-pack boundary rider_never_fires makes an on_hit typed rider change the synthetic encounter outcome
statusReason: expected 'refused' to be 'loaded' // Object.is equality

[Killed] EqualityOperator
src/vtt/party-pack.ts:3274:13
             return false;
           }
           const first = uses.findIndex((candidate) =>
-            candidate.spellId === use.spellId && candidate.resourcePoolId === use.resourcePoolId);
+            candidate.spellId !== use.spellId && candidate.resourcePoolId === use.resourcePoolId);
           if (first === useIndex) return true;
           gaps.push(issueGap(
killedBy: external party-pack boundary rider_never_fires makes an on_hit typed rider change the synthetic encounter outcome
statusReason: expected 'refused' to be 'loaded' // Object.is equality

[Killed] BooleanLiteral
src/vtt/party-pack.ts:3275:42
           }
           const first = uses.findIndex((candidate) =>
             candidate.spellId === use.spellId && candidate.resourcePoolId === use.resourcePoolId);
-          if (first === useIndex) return true;
+          if (first === useIndex) return false;
           gaps.push(issueGap(
             entry,
killedBy: external party-pack boundary named resource pools can fuel spellcasting without changing existing slot pools
statusReason: Spell magic-missile is not declared for loaded resource pool resource:precise-strikes.

[Killed] ConditionalExpression
src/vtt/party-pack.ts:3275:15
           }
           const first = uses.findIndex((candidate) =>
             candidate.spellId === use.spellId && candidate.resourcePoolId === use.resourcePoolId);
-          if (first === useIndex) return true;
+          if (false) return true;
           gaps.push(issueGap(
             entry,
killedBy: external party-pack boundary rider_never_fires makes an on_hit typed rider change the synthetic encounter outcome
statusReason: expected 'refused' to be 'loaded' // Object.is equality

[NoCoverage] ArrayDeclaration
src/vtt/party-pack.ts:3278:13
           if (first === useIndex) return true;
           gaps.push(issueGap(
             entry,
-            [...sourcePrefix, 'resourceSpellUses', useIndex],
+            [],
             'value_not_in_engine_vocabulary',
           ));

[NoCoverage] StringLiteral
src/vtt/party-pack.ts:3278:31
           if (first === useIndex) return true;
           gaps.push(issueGap(
             entry,
-            [...sourcePrefix, 'resourceSpellUses', useIndex],
+            [...sourcePrefix, "", useIndex],
             'value_not_in_engine_vocabulary',
           ));

[Survived] ConditionalExpression
src/vtt/party-pack.ts:3287:15
           ...source,
           preparedSpellIds,
           knownSpellIds,
-          ...(source.grants === undefined ? {} : { grants }),
+          ...(false ? {} : { grants }),
           ...(source.resourceSpellUses === undefined ? {} : { resourceSpellUses }),
         };

[Survived] ConditionalExpression
src/vtt/party-pack.ts:3287:15
           ...source,
           preparedSpellIds,
           knownSpellIds,
-          ...(source.grants === undefined ? {} : { grants }),
+          ...(true ? {} : { grants }),
           ...(source.resourceSpellUses === undefined ? {} : { resourceSpellUses }),
         };

[Survived] EqualityOperator
src/vtt/party-pack.ts:3288:15
           preparedSpellIds,
           knownSpellIds,
           ...(source.grants === undefined ? {} : { grants }),
-          ...(source.resourceSpellUses === undefined ? {} : { resourceSpellUses }),
+          ...(source.resourceSpellUses !== undefined ? {} : { resourceSpellUses }),
         };
         normalizedSources.push(normalized);

[Survived] ConditionalExpression
src/vtt/party-pack.ts:3288:15
           preparedSpellIds,
           knownSpellIds,
           ...(source.grants === undefined ? {} : { grants }),
-          ...(source.resourceSpellUses === undefined ? {} : { resourceSpellUses }),
+          ...(true ? {} : { resourceSpellUses }),
         };
         normalizedSources.push(normalized);

[Killed] ArithmeticOperator
src/vtt/party-pack.ts:3295:44
           ability: source.ability,
           spellSaveDc: source.spellSaveDc,
           spellAttackBonus: source.spellAttackBonus,
-          spellcastingModifier: Math.floor((core.data.abilities[source.ability] - 10) / 2),
+          spellcastingModifier: Math.floor((core.data.abilities[source.ability] - 10) * 2),
           casterLevel: totalLevel,
           preparedSpells: preparedSpellIds.flatMap((id) =>
killedBy: D382 survival package between-fight Cure Wounds spends the cheapest sufficient slot and preserves Bless plus Spirit Guardians reserves
statusReason: expected undefined to deeply equal { …(4) }

[Killed] ArithmeticOperator
src/vtt/party-pack.ts:3295:45
           ability: source.ability,
           spellSaveDc: source.spellSaveDc,
           spellAttackBonus: source.spellAttackBonus,
-          spellcastingModifier: Math.floor((core.data.abilities[source.ability] - 10) / 2),
+          spellcastingModifier: Math.floor((core.data.abilities[source.ability] + 10) / 2),
           casterLevel: totalLevel,
           preparedSpells: preparedSpellIds.flatMap((id) =>
killedBy: D382 survival package between-fight Cure Wounds spends the cheapest sufficient slot and preserves Bless plus Spirit Guardians reserves
statusReason: expected undefined to deeply equal { …(4) }

[Killed] ConditionalExpression
src/vtt/party-pack.ts:3298:38
           spellcastingModifier: Math.floor((core.data.abilities[source.ability] - 10) / 2),
           casterLevel: totalLevel,
           preparedSpells: preparedSpellIds.flatMap((id) =>
-            spells.filter((spell) => spell.id === id)),
+            spells.filter((spell) => false)),
           knownSpells: knownSpellIds.flatMap((id) =>
             spells.filter((spell) => spell.id === id)),
killedBy: D382 survival package between-fight Cure Wounds spends the cheapest sufficient slot and preserves Bless plus Spirit Guardians reserves
statusReason: expected undefined to deeply equal { …(4) }

[Killed] ConditionalExpression
src/vtt/party-pack.ts:3298:38
           spellcastingModifier: Math.floor((core.data.abilities[source.ability] - 10) / 2),
           casterLevel: totalLevel,
           preparedSpells: preparedSpellIds.flatMap((id) =>
-            spells.filter((spell) => spell.id === id)),
+            spells.filter((spell) => true)),
           knownSpells: knownSpellIds.flatMap((id) =>
             spells.filter((spell) => spell.id === id)),
killedBy: D365 bundled dungeon acceptance authors the representative level-5 party through the production RPC surface
statusReason: expected [ 'Counterspell', …(116) ] to deeply equal [ 'Counterspell', 'Fireball', …(7) ]

[Killed] MethodExpression
src/vtt/party-pack.ts:3300:13
           preparedSpells: preparedSpellIds.flatMap((id) =>
             spells.filter((spell) => spell.id === id)),
           knownSpells: knownSpellIds.flatMap((id) =>
-            spells.filter((spell) => spell.id === id)),
+            spells),
           grants: grants.flatMap((grant) => {
             const spell = spells.find((candidate) => candidate.id === grant.spellId);
killedBy: D365 bundled dungeon acceptance authors the representative level-5 party through the production RPC surface
statusReason: expected [ 'Counterspell', …(51) ] to deeply equal [ 'Fire Bolt', 'Mage Hand', …(2) ]

[Killed] ConditionalExpression
src/vtt/party-pack.ts:3300:38
           preparedSpells: preparedSpellIds.flatMap((id) =>
             spells.filter((spell) => spell.id === id)),
           knownSpells: knownSpellIds.flatMap((id) =>
-            spells.filter((spell) => spell.id === id)),
+            spells.filter((spell) => false)),
           grants: grants.flatMap((grant) => {
             const spell = spells.find((candidate) => candidate.id === grant.spellId);
killedBy: D365 bundled dungeon acceptance authors the representative level-5 party through the production RPC surface
statusReason: expected [] to deeply equal [ 'Fire Bolt', 'Mage Hand', …(2) ]

[Killed] EqualityOperator
src/vtt/party-pack.ts:3302:54
           knownSpells: knownSpellIds.flatMap((id) =>
             spells.filter((spell) => spell.id === id)),
           grants: grants.flatMap((grant) => {
-            const spell = spells.find((candidate) => candidate.id === grant.spellId);
+            const spell = spells.find((candidate) => candidate.id !== grant.spellId);
             if (spell === undefined) return [];
             const sourceModifier = Math.floor((core.data.abilities[source.ability] - 10) / 2);
killedBy: external party-pack boundary grant_uses_source_ability casts an outside-list prepared grant with its explicit ability and DC
statusReason: expected [ { spell: { …(6) }, …(4) } ] to match object [ { …(5) } ]
(5 matching properties omitted from actual)

[Killed] ConditionalExpression
src/vtt/party-pack.ts:3302:54
           knownSpells: knownSpellIds.flatMap((id) =>
             spells.filter((spell) => spell.id === id)),
           grants: grants.flatMap((grant) => {
-            const spell = spells.find((candidate) => candidate.id === grant.spellId);
+            const spell = spells.find((candidate) => false);
             if (spell === undefined) return [];
             const sourceModifier = Math.floor((core.data.abilities[source.ability] - 10) / 2);
killedBy: external party-pack boundary grant_uses_source_ability casts an outside-list prepared grant with its explicit ability and DC
statusReason: expected [] to match object [ { …(5) } ]

[Killed] ArithmeticOperator
src/vtt/party-pack.ts:3304:48
           grants: grants.flatMap((grant) => {
             const spell = spells.find((candidate) => candidate.id === grant.spellId);
             if (spell === undefined) return [];
-            const sourceModifier = Math.floor((core.data.abilities[source.ability] - 10) / 2);
+            const sourceModifier = Math.floor((core.data.abilities[source.ability] + 10) / 2);
             const grantModifier = Math.floor((core.data.abilities[grant.ability] - 10) / 2);
             const modifierDelta = grantModifier - sourceModifier;
killedBy: external party-pack boundary grant_uses_source_ability casts an outside-list prepared grant with its explicit ability and DC
statusReason: expected [ { spell: { …(6) }, …(4) } ] to match object [ { …(5) } ]

[Killed] ArithmeticOperator
src/vtt/party-pack.ts:3304:47
           grants: grants.flatMap((grant) => {
             const spell = spells.find((candidate) => candidate.id === grant.spellId);
             if (spell === undefined) return [];
-            const sourceModifier = Math.floor((core.data.abilities[source.ability] - 10) / 2);
+            const sourceModifier = Math.floor((core.data.abilities[source.ability] - 10) * 2);
             const grantModifier = Math.floor((core.data.abilities[grant.ability] - 10) / 2);
             const modifierDelta = grantModifier - sourceModifier;
killedBy: external party-pack boundary grant_uses_source_ability casts an outside-list prepared grant with its explicit ability and DC
statusReason: expected [ { spell: { …(6) }, …(4) } ] to match object [ { …(5) } ]

[Killed] ArithmeticOperator
src/vtt/party-pack.ts:3305:47
             const spell = spells.find((candidate) => candidate.id === grant.spellId);
             if (spell === undefined) return [];
             const sourceModifier = Math.floor((core.data.abilities[source.ability] - 10) / 2);
-            const grantModifier = Math.floor((core.data.abilities[grant.ability] - 10) / 2);
+            const grantModifier = Math.floor((core.data.abilities[grant.ability] + 10) / 2);
             const modifierDelta = grantModifier - sourceModifier;
             return [{
killedBy: external party-pack boundary grant_uses_source_ability casts an outside-list prepared grant with its explicit ability and DC
statusReason: expected [ { spell: { …(6) }, …(4) } ] to match object [ { …(5) } ]

[Killed] ArithmeticOperator
src/vtt/party-pack.ts:3305:46
             const spell = spells.find((candidate) => candidate.id === grant.spellId);
             if (spell === undefined) return [];
             const sourceModifier = Math.floor((core.data.abilities[source.ability] - 10) / 2);
-            const grantModifier = Math.floor((core.data.abilities[grant.ability] - 10) / 2);
+            const grantModifier = Math.floor((core.data.abilities[grant.ability] - 10) * 2);
             const modifierDelta = grantModifier - sourceModifier;
             return [{
killedBy: external party-pack boundary grant_uses_source_ability casts an outside-list prepared grant with its explicit ability and DC
statusReason: expected [ { spell: { …(6) }, …(4) } ] to match object [ { …(5) } ]

[Killed] ArithmeticOperator
src/vtt/party-pack.ts:3306:35
             if (spell === undefined) return [];
             const sourceModifier = Math.floor((core.data.abilities[source.ability] - 10) / 2);
             const grantModifier = Math.floor((core.data.abilities[grant.ability] - 10) / 2);
-            const modifierDelta = grantModifier - sourceModifier;
+            const modifierDelta = grantModifier + sourceModifier;
             return [{
               spell,
killedBy: external party-pack boundary grant_uses_source_ability casts an outside-list prepared grant with its explicit ability and DC
statusReason: expected [ { spell: { …(6) }, …(4) } ] to match object [ { …(5) } ]

[Killed] ArithmeticOperator
src/vtt/party-pack.ts:3310:28
             return [{
               spell,
               ability: grant.ability,
-              spellSaveDc: source.spellSaveDc + modifierDelta,
+              spellSaveDc: source.spellSaveDc - modifierDelta,
               spellAttackBonus: source.spellAttackBonus + modifierDelta,
               spellcastingModifier: grantModifier,
killedBy: external party-pack boundary grant_uses_source_ability casts an outside-list prepared grant with its explicit ability and DC
statusReason: expected [ { spell: { …(6) }, …(4) } ] to match object [ { …(5) } ]

[Killed] ArithmeticOperator
src/vtt/party-pack.ts:3311:33
               spell,
               ability: grant.ability,
               spellSaveDc: source.spellSaveDc + modifierDelta,
-              spellAttackBonus: source.spellAttackBonus + modifierDelta,
+              spellAttackBonus: source.spellAttackBonus - modifierDelta,
               spellcastingModifier: grantModifier,
             }];
killedBy: external party-pack boundary grant_uses_source_ability casts an outside-list prepared grant with its explicit ability and DC
statusReason: expected [ { spell: { …(6) }, …(4) } ] to match object [ { …(5) } ]

[NoCoverage] ArrayDeclaration
src/vtt/party-pack.ts:3324:110
       parsedSpellcasting = normalizedSources;
     }
 
-    const conditionsInput = Array.isArray(memberInput.startingConditions) ? memberInput.startingConditions : [];
+    const conditionsInput = Array.isArray(memberInput.startingConditions) ? memberInput.startingConditions : ["Stryker was here"];
     if (!Array.isArray(memberInput.startingConditions)) gaps.push(issueGap(entry, ['members', index, 'startingConditions']));
     if (conditionsInput.length > 100) {

[Killed] ConditionalExpression
src/vtt/party-pack.ts:3325:9
     }
 
     const conditionsInput = Array.isArray(memberInput.startingConditions) ? memberInput.startingConditions : [];
-    if (!Array.isArray(memberInput.startingConditions)) gaps.push(issueGap(entry, ['members', index, 'startingConditions']));
+    if (true) gaps.push(issueGap(entry, ['members', index, 'startingConditions']));
     if (conditionsInput.length > 100) {
       gaps.push(issueGap(entry, ['members', index, 'startingConditions'], 'value_not_in_engine_vocabulary'));
killedBy: D365 bundled dungeon acceptance authors the representative level-5 party through the production RPC surface
statusReason: party: partyPack — gaps_not_allowed

[Killed] BooleanLiteral
src/vtt/party-pack.ts:3325:9
     }
 
     const conditionsInput = Array.isArray(memberInput.startingConditions) ? memberInput.startingConditions : [];
-    if (!Array.isArray(memberInput.startingConditions)) gaps.push(issueGap(entry, ['members', index, 'startingConditions']));
+    if (Array.isArray(memberInput.startingConditions)) gaps.push(issueGap(entry, ['members', index, 'startingConditions']));
     if (conditionsInput.length > 100) {
       gaps.push(issueGap(entry, ['members', index, 'startingConditions'], 'value_not_in_engine_vocabulary'));
killedBy: D365 bundled dungeon acceptance authors the representative level-5 party through the production RPC surface
statusReason: party: partyPack — gaps_not_allowed

[Killed] EqualityOperator
src/vtt/party-pack.ts:3326:9
 
     const conditionsInput = Array.isArray(memberInput.startingConditions) ? memberInput.startingConditions : [];
     if (!Array.isArray(memberInput.startingConditions)) gaps.push(issueGap(entry, ['members', index, 'startingConditions']));
-    if (conditionsInput.length > 100) {
+    if (conditionsInput.length <= 100) {
       gaps.push(issueGap(entry, ['members', index, 'startingConditions'], 'value_not_in_engine_vocabulary'));
     }
killedBy: D365 bundled dungeon acceptance authors the representative level-5 party through the production RPC surface
statusReason: party: partyPack — gaps_not_allowed

[Killed] ConditionalExpression
src/vtt/party-pack.ts:3326:9
 
     const conditionsInput = Array.isArray(memberInput.startingConditions) ? memberInput.startingConditions : [];
     if (!Array.isArray(memberInput.startingConditions)) gaps.push(issueGap(entry, ['members', index, 'startingConditions']));
-    if (conditionsInput.length > 100) {
+    if (true) {
       gaps.push(issueGap(entry, ['members', index, 'startingConditions'], 'value_not_in_engine_vocabulary'));
     }
killedBy: D365 bundled dungeon acceptance authors the representative level-5 party through the production RPC surface
statusReason: party: partyPack — gaps_not_allowed

[NoCoverage] StringLiteral
src/vtt/party-pack.ts:3327:34
     const conditionsInput = Array.isArray(memberInput.startingConditions) ? memberInput.startingConditions : [];
     if (!Array.isArray(memberInput.startingConditions)) gaps.push(issueGap(entry, ['members', index, 'startingConditions']));
     if (conditionsInput.length > 100) {
-      gaps.push(issueGap(entry, ['members', index, 'startingConditions'], 'value_not_in_engine_vocabulary'));
+      gaps.push(issueGap(entry, ["", index, 'startingConditions'], 'value_not_in_engine_vocabulary'));
     }
     const startingConditions: ExternalPartyPackMember['startingConditions'][number][] = [];

[NoCoverage] StringLiteral
src/vtt/party-pack.ts:3327:52
     const conditionsInput = Array.isArray(memberInput.startingConditions) ? memberInput.startingConditions : [];
     if (!Array.isArray(memberInput.startingConditions)) gaps.push(issueGap(entry, ['members', index, 'startingConditions']));
     if (conditionsInput.length > 100) {
-      gaps.push(issueGap(entry, ['members', index, 'startingConditions'], 'value_not_in_engine_vocabulary'));
+      gaps.push(issueGap(entry, ['members', index, ""], 'value_not_in_engine_vocabulary'));
     }
     const startingConditions: ExternalPartyPackMember['startingConditions'][number][] = [];

[Survived] MethodExpression
src/vtt/party-pack.ts:3330:52
       gaps.push(issueGap(entry, ['members', index, 'startingConditions'], 'value_not_in_engine_vocabulary'));
     }
     const startingConditions: ExternalPartyPackMember['startingConditions'][number][] = [];
-    for (const [conditionIndex, conditionValue] of conditionsInput.slice(0, 100).entries()) {
+    for (const [conditionIndex, conditionValue] of conditionsInput.entries()) {
       const parsed = startingConditionSchema.safeParse(sanitizedRecord(
         conditionValue,

[NoCoverage] StringLiteral
src/vtt/party-pack.ts:3335:28
         conditionValue,
         CONDITION_FIELDS,
         entry,
-        ['members', index, 'startingConditions', conditionIndex],
+        ['members', index, "", conditionIndex],
         gaps,
       ));

[NoCoverage] ArrayDeclaration
src/vtt/party-pack.ts:3335:9
         conditionValue,
         CONDITION_FIELDS,
         entry,
-        ['members', index, 'startingConditions', conditionIndex],
+        [],
         gaps,
       ));

[NoCoverage] BlockStatement
src/vtt/party-pack.ts:3338:27
         ['members', index, 'startingConditions', conditionIndex],
         gaps,
       ));
-      if (parsed.success) {
-        if (startingConditions.some((condition) => condition.effectId === parsed.data.effectId)) {
-          gaps.push(issueGap(
-            entry,
-            ['members', index, 'startingConditions', conditionIndex, 'effectId'],
-            'value_not_in_engine_vocabulary',
-          ));
-        } else {
-          startingConditions.push(parsed.data);
-        }
-      }
+      if (parsed.success) {}
       else gaps.push(...parsed.error.issues.map((issue) => issueGap(
         entry,

[NoCoverage] ConditionalExpression
src/vtt/party-pack.ts:3339:13
         gaps,
       ));
       if (parsed.success) {
-        if (startingConditions.some((condition) => condition.effectId === parsed.data.effectId)) {
+        if (false) {
           gaps.push(issueGap(
             entry,

[NoCoverage] EqualityOperator
src/vtt/party-pack.ts:3339:52
         gaps,
       ));
       if (parsed.success) {
-        if (startingConditions.some((condition) => condition.effectId === parsed.data.effectId)) {
+        if (startingConditions.some((condition) => condition.effectId !== parsed.data.effectId)) {
           gaps.push(issueGap(
             entry,

[NoCoverage] BlockStatement
src/vtt/party-pack.ts:3345:16
             ['members', index, 'startingConditions', conditionIndex, 'effectId'],
             'value_not_in_engine_vocabulary',
           ));
-        } else {
-          startingConditions.push(parsed.data);
-        }
+        } else {}
       }
       else gaps.push(...parsed.error.issues.map((issue) => issueGap(

[NoCoverage] ConditionalExpression
src/vtt/party-pack.ts:3352:9
       else gaps.push(...parsed.error.issues.map((issue) => issueGap(
         entry,
         ['members', index, 'startingConditions', conditionIndex, ...issue.path],
-        issue.code === 'unrecognized_keys'
+        true
           ? 'field_not_in_engine_vocabulary'
           : 'value_not_in_engine_vocabulary',

[NoCoverage] EqualityOperator
src/vtt/party-pack.ts:3352:9
       else gaps.push(...parsed.error.issues.map((issue) => issueGap(
         entry,
         ['members', index, 'startingConditions', conditionIndex, ...issue.path],
-        issue.code === 'unrecognized_keys'
+        issue.code !== 'unrecognized_keys'
           ? 'field_not_in_engine_vocabulary'
           : 'value_not_in_engine_vocabulary',

[Killed] EqualityOperator
src/vtt/party-pack.ts:3362:9
     const resources: ExternalPartyPackResource[] = [];
     let passives: z.infer<typeof passivesSchema> | undefined;
     const worldOperations: ExternalWorldOperation[] = [];
-    if (header.data.schemaVersion === 2) {
+    if (header.data.schemaVersion !== 2) {
       const worldOperationsInput = Object.hasOwn(memberInput, 'worldOperations')
         ? memberInput.worldOperations
killedBy: external party-pack boundary loads executable party-pack v2 world operations and refuses malformed nested specs
statusReason: The party member does not declare world:raise-wall.

[Survived] ConditionalExpression
src/vtt/party-pack.ts:3362:9
     const resources: ExternalPartyPackResource[] = [];
     let passives: z.infer<typeof passivesSchema> | undefined;
     const worldOperations: ExternalWorldOperation[] = [];
-    if (header.data.schemaVersion === 2) {
+    if (true) {
       const worldOperationsInput = Object.hasOwn(memberInput, 'worldOperations')
         ? memberInput.worldOperations

[NoCoverage] BlockStatement
src/vtt/party-pack.ts:3366:49
       const worldOperationsInput = Object.hasOwn(memberInput, 'worldOperations')
         ? memberInput.worldOperations
         : [];
-      if (!Array.isArray(worldOperationsInput)) {
-        gaps.push(issueGap(entry, ['members', index, 'worldOperations']));
-      } else if (worldOperationsInput.length > 100) {
+      if (!Array.isArray(worldOperationsInput)) {} else if (worldOperationsInput.length > 100) {
         gaps.push(issueGap(entry, ['members', index, 'worldOperations'], 'value_not_in_engine_vocabulary'));
       } else {

[NoCoverage] StringLiteral
src/vtt/party-pack.ts:3367:54
         ? memberInput.worldOperations
         : [];
       if (!Array.isArray(worldOperationsInput)) {
-        gaps.push(issueGap(entry, ['members', index, 'worldOperations']));
+        gaps.push(issueGap(entry, ['members', index, ""]));
       } else if (worldOperationsInput.length > 100) {
         gaps.push(issueGap(entry, ['members', index, 'worldOperations'], 'value_not_in_engine_vocabulary'));

[NoCoverage] ArrayDeclaration
src/vtt/party-pack.ts:3367:35
         ? memberInput.worldOperations
         : [];
       if (!Array.isArray(worldOperationsInput)) {
-        gaps.push(issueGap(entry, ['members', index, 'worldOperations']));
+        gaps.push(issueGap(entry, []));
       } else if (worldOperationsInput.length > 100) {
         gaps.push(issueGap(entry, ['members', index, 'worldOperations'], 'value_not_in_engine_vocabulary'));

[Killed] EqualityOperator
src/vtt/party-pack.ts:3368:18
         : [];
       if (!Array.isArray(worldOperationsInput)) {
         gaps.push(issueGap(entry, ['members', index, 'worldOperations']));
-      } else if (worldOperationsInput.length > 100) {
+      } else if (worldOperationsInput.length <= 100) {
         gaps.push(issueGap(entry, ['members', index, 'worldOperations'], 'value_not_in_engine_vocabulary'));
       } else {
killedBy: external party-pack boundary loads executable party-pack v2 world operations and refuses malformed nested specs
statusReason: expected 'refused' to be 'loaded' // Object.is equality

[NoCoverage] BlockStatement
src/vtt/party-pack.ts:3368:53
         : [];
       if (!Array.isArray(worldOperationsInput)) {
         gaps.push(issueGap(entry, ['members', index, 'worldOperations']));
-      } else if (worldOperationsInput.length > 100) {
-        gaps.push(issueGap(entry, ['members', index, 'worldOperations'], 'value_not_in_engine_vocabulary'));
-      } else {
+      } else if (worldOperationsInput.length > 100) {} else {
         for (const [operationIndex, operationValue] of worldOperationsInput.entries()) {
           const parsed = externalWorldOperationSchema.safeParse(operationValue);
