[Killed] ConditionalExpression
src/vtt/vane-warren.ts:261:104
 ): VaneWarrenWorldObject {
   const durability = objectClass === 'brazier'
     ? { kind: 'indestructible' as const }
-    : { kind: 'hit_points' as const, hitPoints: objectClass === 'war_drum' ? 12 : 8, maximumHitPoints: objectClass === 'war_drum' ? 12 : 8 };
+    : { kind: 'hit_points' as const, hitPoints: objectClass === 'war_drum' ? 12 : 8, maximumHitPoints: true ? 12 : 8 };
   const cover = objectClass === 'war_drum' ? 'three_quarters' as const : 'half' as const;
   return {
killedBy: D377.5 The Vane Warren flagship bundle pins the complete authored object, environment, and seeded-area contracts
statusReason: expected { …(10) } to match object { name: 'Pitch-Oil Cask', …(8) }
(1 matching property omitted from actual)

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:275:11
       armorClass: armorClass(objectClass === 'oil_cask' ? 10 : 12),
       damageResponses: [],
       blocking: { movement: false, lineOfSight: false, cover },
-      ...(objectClass === 'war_drum'
+      ...(true
         ? {
             classActions: [{
killedBy: D377.5 The Vane Warren flagship bundle pins the complete authored object, environment, and seeded-area contracts
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/vtt/vane-warren.ts:340:7
 }
 
 function areaHooks(material: PersistentAreaMaterial): PersistentArea['hooks'] {
-  if (material.id === 'webs') {
+  if (material.id !== 'webs') {
     return (['on_enter', 'on_start_of_turn_inside'] as const).map((hook) => ({
       hook,
killedBy: D377.5 The Vane Warren flagship bundle pins the complete authored object, environment, and seeded-area contracts
statusReason: expected [ { id: 'area:1', …(10) }, …(1) ] to deeply equal [ { id: 'area:1', …(10) }, …(1) ]

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:387:39
     sequence,
     owner,
     origin: { kind: 'fixed', point: feetPoint(point.column * 5, point.row * 5) },
-    shape: { kind: 'cube', size: feet(material.id === 'webs' ? 20 : 10) },
+    shape: { kind: 'cube', size: feet(true ? 20 : 10) },
     duration: { kind: 'rounds', remaining: material.id === 'webs' ? 600 : 10 },
     targetFilter: { kind: 'all' },
killedBy: D377.5 The Vane Warren flagship bundle pins the complete authored object, environment, and seeded-area contracts
statusReason: expected [ { id: 'area:1', …(10) }, …(1) ] to deeply equal [ { id: 'area:1', …(10) }, …(1) ]

[Killed] EqualityOperator
src/vtt/vane-warren.ts:485:54
     ...(scenarioConfig?.startingReinforcements ?? []),
   ];
   const standingProfiles = startingRoster.map((entry) => profileFor(fightId, entry));
-  const leaderEntry = fight.standing.find((entry) => entry.id === fight.leaderRosterId);
+  const leaderEntry = fight.standing.find((entry) => entry.id !== fight.leaderRosterId);
   if (leaderEntry === undefined) throw new Error(`${fight.name} has no leader profile.`);
   const leader = profileFor(fightId, leaderEntry);
killedBy: D382 survival package pins the fixed 30-seed final-encounter survival fraction at or above two thirds
statusReason: The Iron Voice has no leader profile.

[Killed] ArrowFunction
src/vtt/vane-warren.ts:485:43
     ...(scenarioConfig?.startingReinforcements ?? []),
   ];
   const standingProfiles = startingRoster.map((entry) => profileFor(fightId, entry));
-  const leaderEntry = fight.standing.find((entry) => entry.id === fight.leaderRosterId);
+  const leaderEntry = fight.standing.find(() => undefined);
   if (leaderEntry === undefined) throw new Error(`${fight.name} has no leader profile.`);
   const leader = profileFor(fightId, leaderEntry);
killedBy: D382 survival package pins the fixed 30-seed final-encounter survival fraction at or above two thirds
statusReason: The Cinder Rite has no leader profile.

[Killed] ArrayDeclaration
src/vtt/vane-warren.ts:517:19
         };
       }),
     ],
-    blockedCells: [{ column: 4, row: 1 }, { column: 4, row: 8 }],
+    blockedCells: [],
     worldObjects: objects.map((entry) => entry.object),
     environment: environment(fightId, leader.id),
killedBy: D382 survival package pins the fixed 30-seed final-encounter survival fraction at or above two thirds
statusReason: expected { successes: 30, total: 30 } to deeply equal { successes: 29, total: 30 }

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:535:55
   });
   const alarmCaller = combatantId(`combatant:vane-warren:${fightId}:cinder-guard-b`);
   const alarmObjectId = worldObjectId(`world-object:vane-warren:${fightId}:war_drum`);
-  const configuredEvents: readonly EncounterEvent[] = scenarioConfig === null
+  const configuredEvents: readonly EncounterEvent[] = false
     ? []
     : [
killedBy: D382 survival package pins the fixed 30-seed final-encounter survival fraction at or above two thirds
statusReason: expected { successes: 30, total: 30 } to deeply equal { successes: 29, total: 30 }

[Killed] ArrayDeclaration
src/vtt/vane-warren.ts:561:22
     ...encounter,
     eventLog: configuredEvents,
     nextEventSequence: configuredEvents.length + 1,
-    persistentAreas: [grease, web],
+    persistentAreas: [],
     nextPersistentAreaSequence: 3,
   };
killedBy: D382 survival package pins the fixed 30-seed final-encounter survival fraction at or above two thirds
statusReason: expected { successes: 30, total: 30 } to deeply equal { successes: 29, total: 30 }

[Killed] ArrayDeclaration
src/vtt/vane-warren.ts:564:64
     persistentAreas: [grease, web],
     nextPersistentAreaSequence: 3,
   };
-  const terrainFeatures: readonly VaneWarrenTerrainFeature[] = [
-    ...objects.map((entry): VaneWarrenTerrainFeature => ({
-      kind: 'world_object', objectClass: entry.class, objectId: entry.object.id,
-    })),
-    { kind: 'flammable_surface', material: 'grease', areaId: String(grease.id) },
-    { kind: 'flammable_surface', material: 'webs', areaId: String(web.id) },
-    { kind: 'difficult_terrain', regionId: `${fightId}:rubble` },
-    { kind: 'light', regionId: `${fightId}:brazier-light` },
-    { kind: 'obscurement', regionId: `${fightId}:smoke` },
-    { kind: 'forced_movement_hazard', regionId: `${fightId}:ember-bed` },
-  ];
+  const terrainFeatures: readonly VaneWarrenTerrainFeature[] = [];
   return {
     fight,
killedBy: D377.5 The Vane Warren flagship bundle pins the complete authored object, environment, and seeded-area contracts
statusReason: expected [] to deeply equal [ Array(9) ]

[Killed] StringLiteral
src/vtt/vane-warren.ts:570:44
     })),
     { kind: 'flammable_surface', material: 'grease', areaId: String(grease.id) },
     { kind: 'flammable_surface', material: 'webs', areaId: String(web.id) },
-    { kind: 'difficult_terrain', regionId: `${fightId}:rubble` },
+    { kind: 'difficult_terrain', regionId: `` },
     { kind: 'light', regionId: `${fightId}:brazier-light` },
     { kind: 'obscurement', regionId: `${fightId}:smoke` },
killedBy: D377.5 The Vane Warren flagship bundle pins the complete authored object, environment, and seeded-area contracts
statusReason: expected [ Array(9) ] to deeply equal [ Array(9) ]

[Killed] EqualityOperator
src/vtt/vane-warren.ts:580:12
     encounter: withAreas,
     objects,
     terrainFeatures,
-    alarm: scenarioConfig === null
+    alarm: scenarioConfig !== null
       ? { kind: 'ready' }
       : {
killedBy: D377.5 The Vane Warren flagship bundle tpk_rehearsal_configs: keeps the default fight unchanged and stacks both doomed variants from existing roster content
statusReason: expected { kind: 'complete', …(3) } to deeply equal { kind: 'ready' }

[Killed] ArrowFunction
src/vtt/vane-warren.ts:594:35
 }
 
 function positionOf(state: EncounterState, actor: CombatantId): GridCell {
-  const token = state.tokens.find((candidate) => candidate.combatantId === actor);
+  const token = state.tokens.find(() => undefined);
   if (token === undefined) throw new Error(`Combatant ${actor} has no Vane Warren token.`);
   return token.position;
killedBy: D377.5 The Vane Warren flagship bundle drum_double_trigger: taking the adjacent class action sounds the alarm once and cannot queue it again
statusReason: Combatant combatant:vane-warren:cinder-rite:cinder-guard-b has no Vane Warren token.

[Killed] ArithmeticOperator
src/vtt/vane-warren.ts:600:28
 }
 
 function adjacent(left: GridCell, right: GridCell): boolean {
-  return Math.max(Math.abs(left.column - right.column), Math.abs(left.row - right.row)) <= 1;
+  return Math.max(Math.abs(left.column + right.column), Math.abs(left.row - right.row)) <= 1;
 }
 
killedBy: D377.5 The Vane Warren flagship bundle drum_double_trigger: taking the adjacent class action sounds the alarm once and cannot queue it again
statusReason: The enemy must reach the war drum before using it.

[Killed] EqualityOperator
src/vtt/vane-warren.ts:604:47
 }
 
 function drum(state: VaneWarrenEncounterState): VaneWarrenWorldObject {
-  const found = state.objects.find((entry) => entry.class === 'war_drum');
+  const found = state.objects.find((entry) => entry.class !== 'war_drum');
   if (found === undefined) throw new Error(`${state.fight.name} has no war drum.`);
   return found;
killedBy: DmEncounterHost live algorithm path replays the same configured pure reducer used by live host commands
statusReason: The Vane Warren war drum control is missing.

[Killed] BlockStatement
src/vtt/vane-warren.ts:615:68
 ): VaneWarrenEncounterState {
   if (state.alarm.kind !== 'ready') throw new Error('The Vane Warren war drum has already been used.');
   const subject = state.encounter.combatants.find((candidate) => candidate.profile.id === actor);
-  if (subject === undefined || subject.profile.kind !== 'monster') {
-    throw new Error('Only an enemy in this fight can sound the Vane Warren war drum.');
-  }
+  if (subject === undefined || subject.profile.kind !== 'monster') {}
   const alarmObject = drum(state);
   if (!adjacent(positionOf(state.encounter, actor), alarmObject.object.position)) {
killedBy: D377.5 The Vane Warren flagship bundle reports every direct war-drum refusal with its exact contract reason
statusReason: expected [Function] to throw error including 'Only an enemy in this fight can sound…' but got 'The enemy must reach the war drum bef…'

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:619:7
     throw new Error('Only an enemy in this fight can sound the Vane Warren war drum.');
   }
   const alarmObject = drum(state);
-  if (!adjacent(positionOf(state.encounter, actor), alarmObject.object.position)) {
+  if (false) {
     throw new Error('The enemy must reach the war drum before using it.');
   }
killedBy: D377.5 The Vane Warren flagship bundle reports every direct war-drum refusal with its exact contract reason
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/vtt/vane-warren.ts:620:21
   }
   const alarmObject = drum(state);
   if (!adjacent(positionOf(state.encounter, actor), alarmObject.object.position)) {
-    throw new Error('The enemy must reach the war drum before using it.');
+    throw new Error("");
   }
   const usedAtRound = Math.max(1, state.encounter.round);
killedBy: D377.5 The Vane Warren flagship bundle reports every direct war-drum refusal with its exact contract reason
statusReason: expected [Function] to throw error including 'The enemy must reach the war drum bef…' but got ''

[Survived] StringLiteral
src/vtt/vane-warren.ts:670:56
 }
 
 function openPosition(state: EncounterState, preferred: GridCell): GridCell {
-  const occupied = new Set(state.tokens.map((token) => `${String(token.position.column)},${String(token.position.row)}`));
+  const occupied = new Set(state.tokens.map((token) => ``));
   const blocked = new Set(state.blockedCells.map((cell) => `${String(cell.column)},${String(cell.row)}`));
   for (let radius = 0; radius < Math.max(state.bounds.columns, state.bounds.rows); radius += 1) {

[Killed] StringLiteral
src/vtt/vane-warren.ts:671:60
 
 function openPosition(state: EncounterState, preferred: GridCell): GridCell {
   const occupied = new Set(state.tokens.map((token) => `${String(token.position.column)},${String(token.position.row)}`));
-  const blocked = new Set(state.blockedCells.map((cell) => `${String(cell.column)},${String(cell.row)}`));
+  const blocked = new Set(state.blockedCells.map((cell) => ``));
   for (let radius = 0; radius < Math.max(state.bounds.columns, state.bounds.rows); radius += 1) {
     for (let row = Math.max(0, preferred.row - radius); row <= Math.min(state.bounds.rows - 1, preferred.row + radius); row += 1) {
killedBy: D377.5 The Vane Warren flagship bundle deploys into the first open searched cell with exact appended initiative and revision
statusReason: expected { column: 12, row: 1 } to deeply equal { column: 11, row: +0 }

[Killed] MethodExpression
src/vtt/vane-warren.ts:672:33
 function openPosition(state: EncounterState, preferred: GridCell): GridCell {
   const occupied = new Set(state.tokens.map((token) => `${String(token.position.column)},${String(token.position.row)}`));
   const blocked = new Set(state.blockedCells.map((cell) => `${String(cell.column)},${String(cell.row)}`));
-  for (let radius = 0; radius < Math.max(state.bounds.columns, state.bounds.rows); radius += 1) {
+  for (let radius = 0; radius < Math.min(state.bounds.columns, state.bounds.rows); radius += 1) {
     for (let row = Math.max(0, preferred.row - radius); row <= Math.min(state.bounds.rows - 1, preferred.row + radius); row += 1) {
       for (let column = Math.max(0, preferred.column - radius); column <= Math.min(state.bounds.columns - 1, preferred.column + radius); column += 1) {
killedBy: D377.5 The Vane Warren flagship bundle reports a full reinforcement grid and a manifest without its named leader
statusReason: The Vane Warren has no open reinforcement cell.

[Killed] EqualityOperator
src/vtt/vane-warren.ts:673:57
   const occupied = new Set(state.tokens.map((token) => `${String(token.position.column)},${String(token.position.row)}`));
   const blocked = new Set(state.blockedCells.map((cell) => `${String(cell.column)},${String(cell.row)}`));
   for (let radius = 0; radius < Math.max(state.bounds.columns, state.bounds.rows); radius += 1) {
-    for (let row = Math.max(0, preferred.row - radius); row <= Math.min(state.bounds.rows - 1, preferred.row + radius); row += 1) {
+    for (let row = Math.max(0, preferred.row - radius); row < Math.min(state.bounds.rows - 1, preferred.row + radius); row += 1) {
       for (let column = Math.max(0, preferred.column - radius); column <= Math.min(state.bounds.columns - 1, preferred.column + radius); column += 1) {
         const key = `${String(column)},${String(row)}`;
killedBy: D382 survival package pins the fixed 30-seed final-encounter survival fraction at or above two thirds
statusReason: expected { successes: 28, total: 30 } to deeply equal { successes: 29, total: 30 }

[Killed] ArithmeticOperator
src/vtt/vane-warren.ts:674:84
   const blocked = new Set(state.blockedCells.map((cell) => `${String(cell.column)},${String(cell.row)}`));
   for (let radius = 0; radius < Math.max(state.bounds.columns, state.bounds.rows); radius += 1) {
     for (let row = Math.max(0, preferred.row - radius); row <= Math.min(state.bounds.rows - 1, preferred.row + radius); row += 1) {
-      for (let column = Math.max(0, preferred.column - radius); column <= Math.min(state.bounds.columns - 1, preferred.column + radius); column += 1) {
+      for (let column = Math.max(0, preferred.column - radius); column <= Math.min(state.bounds.columns + 1, preferred.column + radius); column += 1) {
         const key = `${String(column)},${String(row)}`;
         if (!occupied.has(key) && !blocked.has(key)) return { column, row };
killedBy: D377.5 The Vane Warren flagship bundle reports a full reinforcement grid and a manifest without its named leader
statusReason: expected [Function] to throw error including 'The Vane Warren has no open reinforce…' but got 'Token token:vane-warren:cinder-rite:c…'

[Killed] StringLiteral
src/vtt/vane-warren.ts:675:21
   for (let radius = 0; radius < Math.max(state.bounds.columns, state.bounds.rows); radius += 1) {
     for (let row = Math.max(0, preferred.row - radius); row <= Math.min(state.bounds.rows - 1, preferred.row + radius); row += 1) {
       for (let column = Math.max(0, preferred.column - radius); column <= Math.min(state.bounds.columns - 1, preferred.column + radius); column += 1) {
-        const key = `${String(column)},${String(row)}`;
+        const key = ``;
         if (!occupied.has(key) && !blocked.has(key)) return { column, row };
       }
killedBy: D377.5 The Vane Warren flagship bundle deploys into the first open searched cell with exact appended initiative and revision
statusReason: expected { column: 12, row: 1 } to deeply equal { column: 11, row: +0 }

[Killed] BooleanLiteral
src/vtt/vane-warren.ts:676:13
     for (let row = Math.max(0, preferred.row - radius); row <= Math.min(state.bounds.rows - 1, preferred.row + radius); row += 1) {
       for (let column = Math.max(0, preferred.column - radius); column <= Math.min(state.bounds.columns - 1, preferred.column + radius); column += 1) {
         const key = `${String(column)},${String(row)}`;
-        if (!occupied.has(key) && !blocked.has(key)) return { column, row };
+        if (occupied.has(key) && !blocked.has(key)) return { column, row };
       }
     }
killedBy: Vane Warren loader, chaining, seats, and end-session export all-algorithm chain concludes Iron Voice and assigns its conditional successor roster
statusReason: expected 2 to be greater than 2

[Killed] LogicalOperator
src/vtt/vane-warren.ts:676:13
     for (let row = Math.max(0, preferred.row - radius); row <= Math.min(state.bounds.rows - 1, preferred.row + radius); row += 1) {
       for (let column = Math.max(0, preferred.column - radius); column <= Math.min(state.bounds.columns - 1, preferred.column + radius); column += 1) {
         const key = `${String(column)},${String(row)}`;
-        if (!occupied.has(key) && !blocked.has(key)) return { column, row };
+        if (!occupied.has(key) || !blocked.has(key)) return { column, row };
       }
     }
killedBy: D377.5 The Vane Warren flagship bundle deploys into the first open searched cell with exact appended initiative and revision
statusReason: expected { column: 12, row: 1 } to deeply equal { column: 11, row: +0 }

[Killed] StringLiteral
src/vtt/vane-warren.ts:680:19
       }
     }
   }
-  throw new Error('The Vane Warren has no open reinforcement cell.');
+  throw new Error("");
 }
 
killedBy: D377.5 The Vane Warren flagship bundle reports a full reinforcement grid and a manifest without its named leader
statusReason: expected [Function] to throw error including 'The Vane Warren has no open reinforce…' but got ''

[Killed] MethodExpression
src/vtt/vane-warren.ts:742:45
 }
 
 function fightForEncounter(state: EncounterState): VaneWarrenFight | null {
-  return VANE_WARREN_FIGHTS.find((fight) => state.combatants.some((subject) =>
-    subject.profile.id === combatantId(`combatant:vane-warren:${fight.id}:${fight.leaderRosterId}`))) ?? null;
+  return VANE_WARREN_FIGHTS.find((fight) => state.combatants.every(subject => subject.profile.id === combatantId(`combatant:vane-warren:${fight.id}:${fight.leaderRosterId}`))) ?? null;
 }
 
killedBy: Vane Warren loader, chaining, seats, and end-session export all-algorithm chain concludes Iron Voice and assigns its conditional successor roster
statusReason: expected [ { …(4) }, { …(4) }, { …(4) }, …(3) ] to deep equally contain ObjectContaining{…}

[Killed] EqualityOperator
src/vtt/vane-warren.ts:743:5
 
 function fightForEncounter(state: EncounterState): VaneWarrenFight | null {
   return VANE_WARREN_FIGHTS.find((fight) => state.combatants.some((subject) =>
-    subject.profile.id === combatantId(`combatant:vane-warren:${fight.id}:${fight.leaderRosterId}`))) ?? null;
+    subject.profile.id !== combatantId(`combatant:vane-warren:${fight.id}:${fight.leaderRosterId}`))) ?? null;
 }
 
killedBy: Vane Warren loader, chaining, seats, and end-session export all-algorithm chain concludes Iron Voice and assigns its conditional successor roster
statusReason: expected [ { …(4) }, { …(4) }, { …(4) }, …(3) ] to deep equally contain ObjectContaining{…}

[Killed] StringLiteral
src/vtt/vane-warren.ts:755:39
   const reduction = reduceEncounter(state, command, rng, options);
   const fight = fightForEncounter(reduction.state);
   if (fight === null) return reduction;
-  const alarmObjectId = worldObjectId(`world-object:vane-warren:${fight.id}:war_drum`);
+  const alarmObjectId = worldObjectId(``);
   const alarm = reduction.state.eventLog.find((event) =>
     event.type === 'world_object_used' &&
killedBy: DmEncounterHost live algorithm path replays the same configured pure reducer used by live host commands
statusReason: WorldObjectId must be trimmed, non-empty, and at most 200 characters.

[Killed] EqualityOperator
src/vtt/vane-warren.ts:767:30
       const deployAtRound = alarm.round + wave.delayRounds;
       const alreadyDeployed = wave.adds.every((entry) => next.combatants.some((subject) =>
         subject.profile.id === combatantId(`combatant:vane-warren:${fight.id}:${entry.id}`)));
-      if (alreadyDeployed || deployAtRound > next.round) continue;
+      if (alreadyDeployed || deployAtRound >= next.round) continue;
       next = deployRosterEntriesInEncounter(next, fight, wave.adds, false);
       const event: EncounterEvent = {
killedBy: D377.5 The Vane Warren flagship bundle the live command reducer deploys each alarm wave once when its arrival round is reached
statusReason: expected undefined to deeply equal { sequence: 2, …(6) }

[Killed] LogicalOperator
src/vtt/vane-warren.ts:767:11
       const deployAtRound = alarm.round + wave.delayRounds;
       const alreadyDeployed = wave.adds.every((entry) => next.combatants.some((subject) =>
         subject.profile.id === combatantId(`combatant:vane-warren:${fight.id}:${entry.id}`)));
-      if (alreadyDeployed || deployAtRound > next.round) continue;
+      if (alreadyDeployed && deployAtRound > next.round) continue;
       next = deployRosterEntriesInEncounter(next, fight, wave.adds, false);
       const event: EncounterEvent = {
killedBy: Vane Warren loader, chaining, seats, and end-session export all-algorithm chain concludes Iron Voice and assigns its conditional successor roster
statusReason: Algorithm host action refused: Combatant combatant:vane-warren:cinder-rite:cinder-wave-2-a is not the active combatant.

[Killed] MethodExpression
src/vtt/vane-warren.ts:786:26
       events.push(event);
     }
   }
-  const pendingJoiners = fight.conditionalJoiners.filter((entry) => !next.combatants.some((subject) =>
-    subject.profile.id === combatantId(`combatant:vane-warren:${fight.id}:${entry.id}`)));
+  const pendingJoiners = fight.conditionalJoiners;
   const leader = next.combatants.find((subject) =>
     subject.profile.id === combatantId(`combatant:vane-warren:${fight.id}:${fight.leaderRosterId}`));
killedBy: D382 survival package pins the fixed 30-seed final-encounter survival fraction at or above two thirds
statusReason: Controller already assigned to combatant:vane-warren:last-muster:muster-joiner-a.

[Killed] MethodExpression
src/vtt/vane-warren.ts:786:70
       events.push(event);
     }
   }
-  const pendingJoiners = fight.conditionalJoiners.filter((entry) => !next.combatants.some((subject) =>
-    subject.profile.id === combatantId(`combatant:vane-warren:${fight.id}:${entry.id}`)));
+  const pendingJoiners = fight.conditionalJoiners.filter((entry) => !next.combatants.every(subject => subject.profile.id === combatantId(`combatant:vane-warren:${fight.id}:${entry.id}`)));
   const leader = next.combatants.find((subject) =>
     subject.profile.id === combatantId(`combatant:vane-warren:${fight.id}:${fight.leaderRosterId}`));
killedBy: Vane Warren loader, chaining, seats, and end-session export all-algorithm chain concludes Iron Voice and assigns its conditional successor roster
statusReason: Algorithm host action refused: Illegal movement: non_adjacent_step at step 0.

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:787:5
     }
   }
   const pendingJoiners = fight.conditionalJoiners.filter((entry) => !next.combatants.some((subject) =>
-    subject.profile.id === combatantId(`combatant:vane-warren:${fight.id}:${entry.id}`)));
+    true));
   const leader = next.combatants.find((subject) =>
     subject.profile.id === combatantId(`combatant:vane-warren:${fight.id}:${fight.leaderRosterId}`));
killedBy: Vane Warren loader, chaining, seats, and end-session export all-algorithm chain concludes Iron Voice and assigns its conditional successor roster
statusReason: expected [ { …(4) }, { …(4) }, { …(4) }, …(3) ] to deep equally contain ObjectContaining{…}

[Killed] EqualityOperator
src/vtt/vane-warren.ts:789:5
   const pendingJoiners = fight.conditionalJoiners.filter((entry) => !next.combatants.some((subject) =>
     subject.profile.id === combatantId(`combatant:vane-warren:${fight.id}:${entry.id}`)));
   const leader = next.combatants.find((subject) =>
-    subject.profile.id === combatantId(`combatant:vane-warren:${fight.id}:${fight.leaderRosterId}`));
+    subject.profile.id !== combatantId(`combatant:vane-warren:${fight.id}:${fight.leaderRosterId}`));
   if (pendingJoiners.length > 0 && leader !== undefined &&
     leader.hitPoints * 2 <= leader.profile.rules.hitPointMaximum) {
killedBy: Vane Warren loader, chaining, seats, and end-session export all-algorithm chain concludes Iron Voice and assigns its conditional successor roster
statusReason: expected [ { …(4) }, { …(4) }, { …(4) }, …(3) ] to deep equally contain ObjectContaining{…}

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:790:7
     subject.profile.id === combatantId(`combatant:vane-warren:${fight.id}:${entry.id}`)));
   const leader = next.combatants.find((subject) =>
     subject.profile.id === combatantId(`combatant:vane-warren:${fight.id}:${fight.leaderRosterId}`));
-  if (pendingJoiners.length > 0 && leader !== undefined &&
+  if (true && leader !== undefined &&
     leader.hitPoints * 2 <= leader.profile.rules.hitPointMaximum) {
     next = deployRosterEntriesInEncounter(next, fight, pendingJoiners, false);
killedBy: Vane Warren loader, chaining, seats, and end-session export all-algorithm chain concludes Iron Voice and assigns its conditional successor roster
statusReason: Algorithm host action refused: An encounter requires at least one combatant.

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:791:5
   const leader = next.combatants.find((subject) =>
     subject.profile.id === combatantId(`combatant:vane-warren:${fight.id}:${fight.leaderRosterId}`));
   if (pendingJoiners.length > 0 && leader !== undefined &&
-    leader.hitPoints * 2 <= leader.profile.rules.hitPointMaximum) {
+    true) {
     next = deployRosterEntriesInEncounter(next, fight, pendingJoiners, false);
     const event: EncounterEvent = {
killedBy: D382 survival package pins the fixed 30-seed final-encounter survival fraction at or above two thirds
statusReason: expected { successes: 28, total: 30 } to deeply equal { successes: 29, total: 30 }

[Killed] ArrayDeclaration
src/vtt/vane-warren.ts:804:17
     next = {
       ...next,
       nextEventSequence: next.nextEventSequence + 1,
-      eventLog: [...next.eventLog, event],
+      eventLog: [],
     };
     events.push(event);
killedBy: D377.5 The Vane Warren flagship bundle the live reducer deploys a conditional joiner at exactly half HP with one exact event
statusReason: expected undefined to deeply equal { sequence: 1, …(5) }

[Killed] BooleanLiteral
src/vtt/vane-warren.ts:815:7
   state: VaneWarrenEncounterState,
   round: number,
 ): VaneWarrenEncounterState {
-  if (!Number.isSafeInteger(round) || round < 1) throw new RangeError('Alarm advancement requires a positive round.');
+  if (Number.isSafeInteger(round) || round < 1) throw new RangeError('Alarm advancement requires a positive round.');
   if (state.alarm.kind !== 'sounded') return state;
   const due = state.alarm.waves.filter((wave) => wave.status === 'pending' && wave.deployAtRound <= round);
killedBy: D377.5 The Vane Warren flagship bundle alarm_double_wave: deploys each fight-local alarm wave once on its listed subsequent round
statusReason: Alarm advancement requires a positive round.

[Killed] EqualityOperator
src/vtt/vane-warren.ts:817:79
 ): VaneWarrenEncounterState {
   if (!Number.isSafeInteger(round) || round < 1) throw new RangeError('Alarm advancement requires a positive round.');
   if (state.alarm.kind !== 'sounded') return state;
-  const due = state.alarm.waves.filter((wave) => wave.status === 'pending' && wave.deployAtRound <= round);
+  const due = state.alarm.waves.filter((wave) => wave.status === 'pending' && wave.deployAtRound < round);
   let next = state;
   for (const pending of due) {
killedBy: D377.5 The Vane Warren flagship bundle alarm_double_wave: deploys each fight-local alarm wave once on its listed subsequent round
statusReason: expected [ 'ashmaw', 'cinder-guard-b' ] to have a length of 3 but got 2

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:817:79
 ): VaneWarrenEncounterState {
   if (!Number.isSafeInteger(round) || round < 1) throw new RangeError('Alarm advancement requires a positive round.');
   if (state.alarm.kind !== 'sounded') return state;
-  const due = state.alarm.waves.filter((wave) => wave.status === 'pending' && wave.deployAtRound <= round);
+  const due = state.alarm.waves.filter((wave) => wave.status === 'pending' && true);
   let next = state;
   for (const pending of due) {
killedBy: D377.5 The Vane Warren flagship bundle alarm_double_wave: deploys each fight-local alarm wave once on its listed subsequent round
statusReason: expected [ 'ashmaw', 'cinder-guard-b', …(2) ] to have a length of 2 but got 4
