[Killed] EqualityOperator
src/vtt/vane-warren.ts:820:61
   const due = state.alarm.waves.filter((wave) => wave.status === 'pending' && wave.deployAtRound <= round);
   let next = state;
   for (const pending of due) {
-    const wave = state.fight.alarmWaves.find((candidate) => candidate.id === pending.id);
+    const wave = state.fight.alarmWaves.find((candidate) => candidate.id !== pending.id);
     if (wave === undefined) throw new Error(`Alarm wave ${pending.id} is not listed for ${state.fight.name}.`);
     next = deployRosterEntries(next, wave.adds);
killedBy: D377.5 The Vane Warren flagship bundle alarm_wave_timing: keeps every Cinder Rite reinforcement off-board until its exact arrival round
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:831:29
     };
   }
   const waves = state.alarm.waves.map((wave) =>
-    due.some((candidate) => candidate.id === wave.id) ? { ...wave, status: 'deployed' as const } : wave);
+    due.some((candidate) => true) ? { ...wave, status: 'deployed' as const } : wave);
   const remaining = waves.some((wave) => wave.status === 'pending');
   return {
killedBy: D377.5 The Vane Warren flagship bundle alarm_double_wave: deploys each fight-local alarm wave once on its listed subsequent round
statusReason: expected [ 'ashmaw', 'cinder-guard-b', …(1) ] to have a length of 4 but got 3

[Killed] EqualityOperator
src/vtt/vane-warren.ts:832:42
   }
   const waves = state.alarm.waves.map((wave) =>
     due.some((candidate) => candidate.id === wave.id) ? { ...wave, status: 'deployed' as const } : wave);
-  const remaining = waves.some((wave) => wave.status === 'pending');
+  const remaining = waves.some((wave) => wave.status !== 'pending');
   return {
     ...next,
killedBy: D377.5 The Vane Warren flagship bundle alarm_double_wave: deploys each fight-local alarm wave once on its listed subsequent round
statusReason: expected [ 'ashmaw', 'cinder-guard-b' ] to have a length of 3 but got 2

[Killed] BooleanLiteral
src/vtt/vane-warren.ts:849:68
 export function deployVaneWarrenConditionalJoiners(
   state: VaneWarrenEncounterState,
 ): VaneWarrenEncounterState {
-  const pending = state.fight.conditionalJoiners.filter((entry) => !state.deployedRosterIds.includes(entry.id));
+  const pending = state.fight.conditionalJoiners.filter((entry) => state.deployedRosterIds.includes(entry.id));
   if (pending.length === 0) return state;
   const leaderEntry = state.fight.standing.find((entry) => entry.id === state.fight.leaderRosterId);
killedBy: D377.5 The Vane Warren flagship bundle deploys conditional joiners exactly at half HP and only once
statusReason: expected [ 'commander-sablehook' ] to include 'muster-joiner-a'

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:851:60
 ): VaneWarrenEncounterState {
   const pending = state.fight.conditionalJoiners.filter((entry) => !state.deployedRosterIds.includes(entry.id));
   if (pending.length === 0) return state;
-  const leaderEntry = state.fight.standing.find((entry) => entry.id === state.fight.leaderRosterId);
+  const leaderEntry = state.fight.standing.find((entry) => false);
   if (leaderEntry === undefined) throw new Error(`${state.fight.name} has no listed leader.`);
   const leaderId = combatantId(`combatant:vane-warren:${state.fight.id}:${leaderEntry.id}`);
killedBy: D377.5 The Vane Warren flagship bundle deploys conditional joiners exactly at half HP and only once
statusReason: The Last Muster has no listed leader.

[Killed] StringLiteral
src/vtt/vane-warren.ts:852:50
   const pending = state.fight.conditionalJoiners.filter((entry) => !state.deployedRosterIds.includes(entry.id));
   if (pending.length === 0) return state;
   const leaderEntry = state.fight.standing.find((entry) => entry.id === state.fight.leaderRosterId);
-  if (leaderEntry === undefined) throw new Error(`${state.fight.name} has no listed leader.`);
+  if (leaderEntry === undefined) throw new Error(``);
   const leaderId = combatantId(`combatant:vane-warren:${state.fight.id}:${leaderEntry.id}`);
   const leader = state.encounter.combatants.find((candidate) => candidate.profile.id === leaderId);
killedBy: D377.5 The Vane Warren flagship bundle reports a full reinforcement grid and a manifest without its named leader
statusReason: expected [Function] to throw error including 'The Last Muster has no listed leader.' but got ''

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:854:65
   const leaderEntry = state.fight.standing.find((entry) => entry.id === state.fight.leaderRosterId);
   if (leaderEntry === undefined) throw new Error(`${state.fight.name} has no listed leader.`);
   const leaderId = combatantId(`combatant:vane-warren:${state.fight.id}:${leaderEntry.id}`);
-  const leader = state.encounter.combatants.find((candidate) => candidate.profile.id === leaderId);
+  const leader = state.encounter.combatants.find((candidate) => true);
   if (leader === undefined || leader.hitPoints * 2 > leader.profile.rules.hitPointMaximum) return state;
   const deployed = deployRosterEntries(state, pending);
killedBy: D377.5 The Vane Warren flagship bundle deploys conditional joiners exactly at half HP and only once
statusReason: expected [ 'commander-sablehook' ] to include 'muster-joiner-a'

[Killed] EqualityOperator
src/vtt/vane-warren.ts:854:65
   const leaderEntry = state.fight.standing.find((entry) => entry.id === state.fight.leaderRosterId);
   if (leaderEntry === undefined) throw new Error(`${state.fight.name} has no listed leader.`);
   const leaderId = combatantId(`combatant:vane-warren:${state.fight.id}:${leaderEntry.id}`);
-  const leader = state.encounter.combatants.find((candidate) => candidate.profile.id === leaderId);
+  const leader = state.encounter.combatants.find((candidate) => candidate.profile.id !== leaderId);
   if (leader === undefined || leader.hitPoints * 2 > leader.profile.rules.hitPointMaximum) return state;
   const deployed = deployRosterEntries(state, pending);
killedBy: D377.5 The Vane Warren flagship bundle deploys conditional joiners exactly at half HP and only once
statusReason: expected [ 'commander-sablehook' ] to include 'muster-joiner-a'

[Killed] EqualityOperator
src/vtt/vane-warren.ts:855:31
   if (leaderEntry === undefined) throw new Error(`${state.fight.name} has no listed leader.`);
   const leaderId = combatantId(`combatant:vane-warren:${state.fight.id}:${leaderEntry.id}`);
   const leader = state.encounter.combatants.find((candidate) => candidate.profile.id === leaderId);
-  if (leader === undefined || leader.hitPoints * 2 > leader.profile.rules.hitPointMaximum) return state;
+  if (leader === undefined || leader.hitPoints * 2 >= leader.profile.rules.hitPointMaximum) return state;
   const deployed = deployRosterEntries(state, pending);
   return {
killedBy: D377.5 The Vane Warren flagship bundle deploys conditional joiners exactly at half HP and only once
statusReason: expected [ 'commander-sablehook' ] to include 'muster-joiner-a'

[Killed] ArithmeticOperator
src/vtt/vane-warren.ts:855:31
   if (leaderEntry === undefined) throw new Error(`${state.fight.name} has no listed leader.`);
   const leaderId = combatantId(`combatant:vane-warren:${state.fight.id}:${leaderEntry.id}`);
   const leader = state.encounter.combatants.find((candidate) => candidate.profile.id === leaderId);
-  if (leader === undefined || leader.hitPoints * 2 > leader.profile.rules.hitPointMaximum) return state;
+  if (leader === undefined || leader.hitPoints / 2 > leader.profile.rules.hitPointMaximum) return state;
   const deployed = deployRosterEntries(state, pending);
   return {
killedBy: D377.5 The Vane Warren flagship bundle deploys conditional joiners exactly at half HP and only once
statusReason: expected { …(7) } to be { …(7) } // Object.is equality

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:870:46
 export function breakVaneWarrenOilCask(
   state: VaneWarrenEncounterState,
 ): VaneWarrenEncounterState {
-  const cask = state.objects.find((entry) => entry.class === 'oil_cask');
+  const cask = state.objects.find((entry) => false);
   if (cask === undefined || !state.encounter.worldObjects.some((object) => object.id === cask.object.id)) return state;
   const sequence = state.encounter.nextPersistentAreaSequence;
killedBy: D377.5 The Vane Warren flagship bundle breaks the oil cask once, removes its object, and refuses a surface without an enemy owner
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ArrowFunction
src/vtt/vane-warren.ts:870:35
 export function breakVaneWarrenOilCask(
   state: VaneWarrenEncounterState,
 ): VaneWarrenEncounterState {
-  const cask = state.objects.find((entry) => entry.class === 'oil_cask');
+  const cask = state.objects.find(() => undefined);
   if (cask === undefined || !state.encounter.worldObjects.some((object) => object.id === cask.object.id)) return state;
   const sequence = state.encounter.nextPersistentAreaSequence;
killedBy: D377.5 The Vane Warren flagship bundle breaks the oil cask once, removes its object, and refuses a surface without an enemy owner
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/vtt/vane-warren.ts:871:29
   state: VaneWarrenEncounterState,
 ): VaneWarrenEncounterState {
   const cask = state.objects.find((entry) => entry.class === 'oil_cask');
-  if (cask === undefined || !state.encounter.worldObjects.some((object) => object.id === cask.object.id)) return state;
+  if (cask === undefined || state.encounter.worldObjects.some(object => object.id === cask.object.id)) return state;
   const sequence = state.encounter.nextPersistentAreaSequence;
   const owner = state.encounter.combatants.find((candidate) => candidate.profile.kind === 'monster')?.profile.id;
killedBy: D377.5 The Vane Warren flagship bundle breaks the oil cask once, removes its object, and refuses a surface without an enemy owner
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:873:64
   const cask = state.objects.find((entry) => entry.class === 'oil_cask');
   if (cask === undefined || !state.encounter.worldObjects.some((object) => object.id === cask.object.id)) return state;
   const sequence = state.encounter.nextPersistentAreaSequence;
-  const owner = state.encounter.combatants.find((candidate) => candidate.profile.kind === 'monster')?.profile.id;
+  const owner = state.encounter.combatants.find((candidate) => false)?.profile.id;
   if (owner === undefined) throw new Error('The oil-cask surface requires a fight owner.');
   const grease = seededArea(sequence, owner, GREASE_MATERIAL, cask.object.position);
killedBy: D377.5 The Vane Warren flagship bundle breaks the oil cask once, removes its object, and refuses a surface without an enemy owner
statusReason: The oil-cask surface requires a fight owner.

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:881:69
     encounter: {
       ...state.encounter,
       revision: state.encounter.revision + 1,
-      worldObjects: state.encounter.worldObjects.filter((object) => object.id !== cask.object.id),
+      worldObjects: state.encounter.worldObjects.filter((object) => true),
       persistentAreas: [...state.encounter.persistentAreas, grease],
       nextPersistentAreaSequence: sequence + 1,
killedBy: D377.5 The Vane Warren flagship bundle breaks the oil cask once, removes its object, and refuses a surface without an enemy owner
statusReason: expected true to be false // Object.is equality

[Killed] ArrayDeclaration
src/vtt/vane-warren.ts:889:80
       kind: 'flammable_surface', material: 'grease', areaId: String(grease.id),
     }],
     transitions: [...state.transitions, {
-      kind: 'oil_cask_broken', round: Math.max(1, state.encounter.round), ids: [String(cask.object.id), String(grease.id)],
+      kind: 'oil_cask_broken', round: Math.max(1, state.encounter.round), ids: [],
     }],
   };
killedBy: D377.5 The Vane Warren flagship bundle breaks the oil cask once, removes its object, and refuses a surface without an enemy owner
statusReason: expected { kind: 'oil_cask_broken', …(2) } to deeply equal { kind: 'oil_cask_broken', …(2) }

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:898:49
   state: VaneWarrenEncounterState,
   cell: GridCell,
 ): VaneWarrenEncounterState {
-  const brazier = state.objects.find((entry) => entry.class === 'brazier');
+  const brazier = state.objects.find((entry) => true);
   if (brazier === undefined || !adjacent(brazier.object.position, cell)) {
     throw new Error('A Vane Warren brazier can ignite only an adjacent cell.');
killedBy: D377.5 The Vane Warren flagship bundle ignition_skipped: brazier adjacency converts Grease to burning and its next start deals cited 2d4 Fire damage
statusReason: A Vane Warren brazier can ignite only an adjacent cell.

[Killed] BooleanLiteral
src/vtt/vane-warren.ts:899:32
   cell: GridCell,
 ): VaneWarrenEncounterState {
   const brazier = state.objects.find((entry) => entry.class === 'brazier');
-  if (brazier === undefined || !adjacent(brazier.object.position, cell)) {
+  if (brazier === undefined || adjacent(brazier.object.position, cell)) {
     throw new Error('A Vane Warren brazier can ignite only an adjacent cell.');
   }
killedBy: D377.5 The Vane Warren flagship bundle ignition_skipped: brazier adjacency converts Grease to burning and its next start deals cited 2d4 Fire damage
statusReason: A Vane Warren brazier can ignite only an adjacent cell.

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:906:21
   if (initiativeIndex === null) throw new Error('Roll initiative before resolving brazier ignition.');
   const matching = state.encounter.persistentAreas.filter((area) => {
     const flammability = area.material?.flammability;
-    const enabled = flammability?.kind === 'flammable' ||
-      (flammability?.kind === 'optional_rule' && state.encounter.config.optionalRules?.includes(flammability.rule) === true);
+    const enabled = true;
     return enabled && persistentAreaContains(area, cell, null, state.encounter);
   });
killedBy: D377.5 The Vane Warren flagship bundle enforces brazier ignition preconditions and does not duplicate a burning cell
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/vtt/vane-warren.ts:907:50
   const matching = state.encounter.persistentAreas.filter((area) => {
     const flammability = area.material?.flammability;
     const enabled = flammability?.kind === 'flammable' ||
-      (flammability?.kind === 'optional_rule' && state.encounter.config.optionalRules?.includes(flammability.rule) === true);
+      (flammability?.kind === 'optional_rule' && state.encounter.config.optionalRules?.includes(flammability.rule) !== true);
     return enabled && persistentAreaContains(area, cell, null, state.encounter);
   });
killedBy: D377.5 The Vane Warren flagship bundle ignition_skipped: brazier adjacency converts Grease to burning and its next start deals cited 2d4 Fire damage
statusReason: The adjacent cell has no enabled flammable surface.

[Killed] EqualityOperator
src/vtt/vane-warren.ts:914:97
   const encounter = {
     ...state.encounter,
     revision: state.encounter.revision + 1,
-    persistentAreas: state.encounter.persistentAreas.map((area) => matching.some((candidate) => candidate.id === area.id)
+    persistentAreas: state.encounter.persistentAreas.map((area) => matching.some((candidate) => candidate.id !== area.id)
       ? {
           ...area,
killedBy: D377.5 The Vane Warren flagship bundle ignition_skipped: brazier adjacency converts Grease to burning and its next start deals cited 2d4 Fire damage
statusReason: expected [] to deeply equal [ ObjectContaining{…} ]

[Killed] MethodExpression
src/vtt/vane-warren.ts:917:25
     persistentAreas: state.encounter.persistentAreas.map((area) => matching.some((candidate) => candidate.id === area.id)
       ? {
           ...area,
-          burningCells: area.burningCells.some((entry) => entry.cell.column === cell.column && entry.cell.row === cell.row)
+          burningCells: area.burningCells.every(entry => entry.cell.column === cell.column && entry.cell.row === cell.row)
             ? area.burningCells
             : [...area.burningCells, {
killedBy: D377.5 The Vane Warren flagship bundle ignition_skipped: brazier adjacency converts Grease to burning and its next start deals cited 2d4 Fire damage
statusReason: expected [] to deeply equal [ ObjectContaining{…} ]

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:917:96
     persistentAreas: state.encounter.persistentAreas.map((area) => matching.some((candidate) => candidate.id === area.id)
       ? {
           ...area,
-          burningCells: area.burningCells.some((entry) => entry.cell.column === cell.column && entry.cell.row === cell.row)
+          burningCells: area.burningCells.some((entry) => entry.cell.column === cell.column && true)
             ? area.burningCells
             : [...area.burningCells, {
killedBy: D377.5 The Vane Warren flagship bundle ignites only matching areas, preserves same-column cells, and records the exact transition
statusReason: expected [ { …(2) } ] to deeply equal [ { …(2) }, { …(2) } ]

[Killed] EqualityOperator
src/vtt/vane-warren.ts:959:50
     playerIds: players.map((profile) => profile.id),
     controllers: storedPartyControllerIdentities(state.combatants),
     turnLegalActions: (current, actor) => {
-      const member = members.find((candidate) => candidate.profile.id === actor);
+      const member = members.find((candidate) => candidate.profile.id !== actor);
       const base = member === undefined
         ? regretTurnLegalActions(current, actor).actions
killedBy: player-character AlgorithmController policy vane-cinder-rite-terminates: both sides receive combat actions and conclude within 20 rounds
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/vtt/vane-warren.ts:960:20
     controllers: storedPartyControllerIdentities(state.combatants),
     turnLegalActions: (current, actor) => {
       const member = members.find((candidate) => candidate.profile.id === actor);
-      const base = member === undefined
+      const base = member !== undefined
         ? regretTurnLegalActions(current, actor).actions
         : partyActions(current, actor).actions;
killedBy: D377.5 The Vane Warren flagship bundle composes fast default and rehearsal contracts with actor-specific actions
statusReason: expected [] to include 'attack:vane-loaded-4'

[Killed] ArrayDeclaration
src/vtt/vane-warren.ts:963:25
       const base = member === undefined
         ? regretTurnLegalActions(current, actor).actions
         : partyActions(current, actor).actions;
-      return { actions: [...worldObjectClassActionCommands(current, actor).actions, ...base] };
+      return { actions: [] };
     },
   };
killedBy: D382 survival package pins the fixed 30-seed final-encounter survival fraction at or above two thirds
statusReason: Controller request has no legal actions.

[Killed] BooleanLiteral
src/vtt/vane-warren.ts:974:24
 ): NonNullable<Parameters<typeof loadedPartyTurnLegalActions>[1]> {
   if (override !== undefined) return override;
   return {
-    useHealingPotions: true,
+    useHealingPotions: false,
     openWithBless: true,
     reserveClericSlotsForBless: true,
killedBy: D377.5 The Vane Warren flagship bundle exposes exact default, clean-wipe, recovery, and override party policies
statusReason: expected { useHealingPotions: false, …(4) } to deeply equal { useHealingPotions: true, …(4) }

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:979:9
     reserveClericSlotsForBless: true,
     useWizardTactics: true,
     useClericContingency: true,
-    ...(scenario === 'default'
+    ...(false
       ? {}
       : { reserveClericSlotForRevivify: scenario === 'tpk-recovery' }),
killedBy: D377.5 The Vane Warren flagship bundle exposes exact default, clean-wipe, recovery, and override party policies
statusReason: expected { useHealingPotions: true, …(5) } to deeply equal { useHealingPotions: true, …(4) }

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:979:9
     reserveClericSlotsForBless: true,
     useWizardTactics: true,
     useClericContingency: true,
-    ...(scenario === 'default'
+    ...(true
       ? {}
       : { reserveClericSlotForRevivify: scenario === 'tpk-recovery' }),
killedBy: D377.5 The Vane Warren flagship bundle exposes exact default, clean-wipe, recovery, and override party policies
statusReason: expected { useHealingPotions: true, …(4) } to deeply equal { useHealingPotions: true, …(5) }

[Killed] EqualityOperator
src/vtt/vane-warren.ts:981:41
     useClericContingency: true,
     ...(scenario === 'default'
       ? {}
-      : { reserveClericSlotForRevivify: scenario === 'tpk-recovery' }),
+      : { reserveClericSlotForRevivify: scenario !== 'tpk-recovery' }),
   };
 }
killedBy: D377.5 The Vane Warren flagship bundle exposes exact default, clean-wipe, recovery, and override party policies
statusReason: expected { useHealingPotions: true, …(5) } to deeply equal { useHealingPotions: true, …(5) }

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:981:41
     useClericContingency: true,
     ...(scenario === 'default'
       ? {}
-      : { reserveClericSlotForRevivify: scenario === 'tpk-recovery' }),
+      : { reserveClericSlotForRevivify: true }),
   };
 }
killedBy: D377.5 The Vane Warren flagship bundle exposes exact default, clean-wipe, recovery, and override party policies
statusReason: expected { useHealingPotions: true, …(5) } to deeply equal { useHealingPotions: true, …(5) }

[Killed] BlockStatement
src/vtt/vane-warren.ts:991:31
   partyState: PartySessionState,
   scenario: VaneWarrenRehearsalScenario = 'default',
 ): StoredCharacterEncounter {
-  if (scenario !== 'default') {
-    const config = VANE_WARREN_TPK_SCENARIOS[scenario];
-    const encounter = composeVaneWarrenFight(
-      'cinder-rite',
-      members,
-      displayNames,
-      partyState,
-      vaneWarrenPartyPolicy(scenario),
-      scenario,
-    );
-    return {
-      ...encounter,
-      controllers: encounter.controllers.map((identity) => ({
-        ...identity,
-        controllerId: `${identity.combatantId}:algorithm:rehearsal`,
-        kind: 'algorithm' as const,
-      })),
-      startPaused: true,
-      sessionFlow: {
-        name: config.sessionName,
-        encounterCount: 1,
-        endControlLabel: 'End Session and export',
-      },
-    };
-  }
+  if (scenario !== 'default') {}
   const fightId = VANE_WARREN_FIGHT_IDS[partyState.room - 1];
   if (fightId === undefined) {
killedBy: D377.5 The Vane Warren flagship bundle composes fast default and rehearsal contracts with actor-specific actions
statusReason: expected undefined to be true // Object.is equality

[Killed] StringLiteral
src/vtt/vane-warren.ts:1005:23
       ...encounter,
       controllers: encounter.controllers.map((identity) => ({
         ...identity,
-        controllerId: `${identity.combatantId}:algorithm:rehearsal`,
+        controllerId: ``,
         kind: 'algorithm' as const,
       })),
killedBy: D377.5 The Vane Warren flagship bundle composes fast default and rehearsal contracts with actor-specific actions
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/vtt/vane-warren.ts:1018:21
   }
   const fightId = VANE_WARREN_FIGHT_IDS[partyState.room - 1];
   if (fightId === undefined) {
-    throw new Error('The three-encounter Vane Warren session is complete.');
+    throw new Error("");
   }
   return {
killedBy: D377.5 The Vane Warren flagship bundle composes fast default and rehearsal contracts with actor-specific actions
statusReason: expected [Function] to throw error including 'The three-encounter Vane Warren sessi…' but got ''
