[Killed] ConditionalExpression
src/combat/controllers.ts:73:9
     request: ControllerRequest,
     signal: AbortSignal,
   ): Promise<ControllerDecision> {
-    if (this.#pending !== null) {
+    if (false) {
       return Promise.reject(new Error('HumanController already has a pending request.'));
     }
killedBy: controller mutation contract: HumanController reports the pending request, rejects a second request, and resolves only an exact submission
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] EqualityOperator
src/combat/controllers.ts:73:9
     request: ControllerRequest,
     signal: AbortSignal,
   ): Promise<ControllerDecision> {
-    if (this.#pending !== null) {
+    if (this.#pending === null) {
       return Promise.reject(new Error('HumanController already has a pending request.'));
     }
killedBy: event-sourced encounter persistence CRASH-PROBE-EVERY-REVISION restores canonical state, RNG, ids, and history byte-for-byte
statusReason: Expected a durable turn request.

[Killed] BlockStatement
src/combat/controllers.ts:76:25
     if (this.#pending !== null) {
       return Promise.reject(new Error('HumanController already has a pending request.'));
     }
-    if (signal.aborted) {
-      return Promise.reject(new ControllerRequestCancelledError('Controller request was cancelled.'));
-    }
+    if (signal.aborted) {}
     return new Promise((resolve, reject) => {
       const cancel = () => {
killedBy: controller mutation contract: HumanController rejects pre-aborted and subsequently aborted requests with the typed cancellation error
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/combat/controllers.ts:76:9
     if (this.#pending !== null) {
       return Promise.reject(new Error('HumanController already has a pending request.'));
     }
-    if (signal.aborted) {
+    if (false) {
       return Promise.reject(new ControllerRequestCancelledError('Controller request was cancelled.'));
     }
killedBy: controller mutation contract: HumanController rejects pre-aborted and subsequently aborted requests with the typed cancellation error
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
src/combat/controllers.ts:77:65
       return Promise.reject(new Error('HumanController already has a pending request.'));
     }
     if (signal.aborted) {
-      return Promise.reject(new ControllerRequestCancelledError('Controller request was cancelled.'));
+      return Promise.reject(new ControllerRequestCancelledError(""));
     }
     return new Promise((resolve, reject) => {
killedBy: controller mutation contract: HumanController rejects pre-aborted and subsequently aborted requests with the typed cancellation error
statusReason: expected [Function] to throw error including 'Controller request was cancelled.' but got ''

[Killed] BlockStatement
src/combat/controllers.ts:79:45
     if (signal.aborted) {
       return Promise.reject(new ControllerRequestCancelledError('Controller request was cancelled.'));
     }
-    return new Promise((resolve, reject) => {
-      const cancel = () => {
-        if (this.#pending?.request.requestId !== request.requestId) return;
-        this.#pending = null;
-        reject(new ControllerRequestCancelledError('Controller request was cancelled.'));
-      };
-      signal.addEventListener('abort', cancel, { once: true });
-      this.#pending = {
-        request,
-        resolve,
-        reject,
-        detachAbort: () => signal.removeEventListener('abort', cancel),
-      };
-    });
+    return new Promise((resolve, reject) => {});
   }
 
killedBy: event-sourced encounter persistence CRASH-PROBE-EVERY-REVISION restores canonical state, RNG, ids, and history byte-for-byte
statusReason: Expected a durable turn request.

[Killed] BlockStatement
src/combat/controllers.ts:80:28
       return Promise.reject(new ControllerRequestCancelledError('Controller request was cancelled.'));
     }
     return new Promise((resolve, reject) => {
-      const cancel = () => {
-        if (this.#pending?.request.requestId !== request.requestId) return;
-        this.#pending = null;
-        reject(new ControllerRequestCancelledError('Controller request was cancelled.'));
-      };
+      const cancel = () => {};
       signal.addEventListener('abort', cancel, { once: true });
       this.#pending = {
killedBy: event-sourced encounter persistence CONTROLLER-SWAP-CANCELS-DURABLY rejects the stale late human response
statusReason: expected function to throw an error, but it didn't

[Killed] ConditionalExpression
src/combat/controllers.ts:81:13
     }
     return new Promise((resolve, reject) => {
       const cancel = () => {
-        if (this.#pending?.request.requestId !== request.requestId) return;
+        if (true) return;
         this.#pending = null;
         reject(new ControllerRequestCancelledError('Controller request was cancelled.'));
killedBy: event-sourced encounter persistence CONTROLLER-SWAP-CANCELS-DURABLY rejects the stale late human response
statusReason: expected function to throw an error, but it didn't

[Killed] EqualityOperator
src/combat/controllers.ts:81:13
     }
     return new Promise((resolve, reject) => {
       const cancel = () => {
-        if (this.#pending?.request.requestId !== request.requestId) return;
+        if (this.#pending?.request.requestId === request.requestId) return;
         this.#pending = null;
         reject(new ControllerRequestCancelledError('Controller request was cancelled.'));
killedBy: event-sourced encounter persistence CONTROLLER-SWAP-CANCELS-DURABLY rejects the stale late human response
statusReason: expected function to throw an error, but it didn't

[Killed] StringLiteral
src/combat/controllers.ts:83:52
       const cancel = () => {
         if (this.#pending?.request.requestId !== request.requestId) return;
         this.#pending = null;
-        reject(new ControllerRequestCancelledError('Controller request was cancelled.'));
+        reject(new ControllerRequestCancelledError(""));
       };
       signal.addEventListener('abort', cancel, { once: true });
killedBy: controller mutation contract: HumanController rejects pre-aborted and subsequently aborted requests with the typed cancellation error
statusReason: expected [Function] to throw error including 'Controller request was cancelled.' but got ''

[Killed] BooleanLiteral
src/combat/controllers.ts:85:56
         this.#pending = null;
         reject(new ControllerRequestCancelledError('Controller request was cancelled.'));
       };
-      signal.addEventListener('abort', cancel, { once: true });
+      signal.addEventListener('abort', cancel, { once: false });
       this.#pending = {
         request,
killedBy: controller mutation contract: HumanController registers a one-shot abort listener and detaches it after a successful submit
statusReason: expected { once: false } to deeply equal { once: true }

[Killed] ObjectLiteral
src/combat/controllers.ts:85:48
         this.#pending = null;
         reject(new ControllerRequestCancelledError('Controller request was cancelled.'));
       };
-      signal.addEventListener('abort', cancel, { once: true });
+      signal.addEventListener('abort', cancel, {});
       this.#pending = {
         request,
killedBy: controller mutation contract: HumanController registers a one-shot abort listener and detaches it after a successful submit
statusReason: expected {} to deeply equal { once: true }

[Killed] ArrowFunction
src/combat/controllers.ts:90:22
         request,
         resolve,
         reject,
-        detachAbort: () => signal.removeEventListener('abort', cancel),
+        detachAbort: () => undefined,
       };
     });
killedBy: controller mutation contract: HumanController registers a one-shot abort listener and detaches it after a successful submit
statusReason: expected "removeEventListener" to be called once, but got 0 times

[Killed] BlockStatement
src/combat/controllers.ts:95:46
     });
   }
 
-  submit(decision: ControllerDecision): void {
-    const pending = this.#pending;
-    if (
-      pending === null ||
-      decision.requestId !== pending.request.requestId ||
-      decision.encounterRevision !== pending.request.encounterRevision
-    ) {
-      throw new StaleControllerResponseError('Human response does not match the pending request.');
-    }
-    this.#pending = null;
-    pending.detachAbort();
-    pending.resolve(decision);
-  }
+  submit(decision: ControllerDecision): void {}
 }
 
killedBy: event-sourced encounter persistence CRASH-PROBE-EVERY-REVISION restores canonical state, RNG, ids, and history byte-for-byte
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/combat/controllers.ts:99:7
     const pending = this.#pending;
     if (
       pending === null ||
-      decision.requestId !== pending.request.requestId ||
+      false ||
       decision.encounterRevision !== pending.request.encounterRevision
     ) {
killedBy: controller mutation contract: HumanController reports the pending request, rejects a second request, and resolves only an exact submission
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/combat/controllers.ts:99:7
     const pending = this.#pending;
     if (
       pending === null ||
-      decision.requestId !== pending.request.requestId ||
+      decision.requestId === pending.request.requestId ||
       decision.encounterRevision !== pending.request.encounterRevision
     ) {
killedBy: event-sourced encounter persistence CRASH-PROBE-EVERY-REVISION restores canonical state, RNG, ids, and history byte-for-byte
statusReason: Human response does not match the pending request.

[Killed] ConditionalExpression
src/combat/controllers.ts:100:7
     if (
       pending === null ||
       decision.requestId !== pending.request.requestId ||
-      decision.encounterRevision !== pending.request.encounterRevision
+      false
     ) {
       throw new StaleControllerResponseError('Human response does not match the pending request.');
killedBy: controller mutation contract: HumanController reports the pending request, rejects a second request, and resolves only an exact submission
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/combat/controllers.ts:100:7
     if (
       pending === null ||
       decision.requestId !== pending.request.requestId ||
-      decision.encounterRevision !== pending.request.encounterRevision
+      decision.encounterRevision === pending.request.encounterRevision
     ) {
       throw new StaleControllerResponseError('Human response does not match the pending request.');
killedBy: event-sourced encounter persistence CRASH-PROBE-EVERY-REVISION restores canonical state, RNG, ids, and history byte-for-byte
statusReason: Human response does not match the pending request.

[Killed] BlockStatement
src/combat/controllers.ts:118:41
   request: ControllerRequest,
   actorId: CombatantId,
 ): number | null {
-  if ('viewer' in request.visibleState) {
-    return request.visibleState.combatants.find((candidate) => candidate.id === actorId)
-      ?.turn.movement.remaining ?? null;
-  }
+  if ('viewer' in request.visibleState) {}
   if ('ownedCombatants' in request.visibleState) {
     return request.visibleState.ownedCombatants.find((candidate) => candidate.id === actorId)
killedBy: controller mutation contract: movement and listed-action validation uses the DM movement budget and rejects a candidate whose first cell exceeds it
statusReason: promise resolved "{ …(3) }" instead of rejecting

[Killed] EqualityOperator
src/combat/controllers.ts:119:64
   actorId: CombatantId,
 ): number | null {
   if ('viewer' in request.visibleState) {
-    return request.visibleState.combatants.find((candidate) => candidate.id === actorId)
+    return request.visibleState.combatants.find((candidate) => candidate.id !== actorId)
       ?.turn.movement.remaining ?? null;
   }
killedBy: controller mutation contract: movement and listed-action validation looks up the movement budget for the command actor rather than the first combatant
statusReason: promise resolved "{ type: 'move', …(3) }" instead of rejecting

[Killed] ArrowFunction
src/combat/controllers.ts:119:49
   actorId: CombatantId,
 ): number | null {
   if ('viewer' in request.visibleState) {
-    return request.visibleState.combatants.find((candidate) => candidate.id === actorId)
+    return request.visibleState.combatants.find(() => undefined)
       ?.turn.movement.remaining ?? null;
   }
killedBy: controller mutation contract: movement and listed-action validation uses the DM movement budget and rejects a candidate whose first cell exceeds it
statusReason: promise resolved "{ …(3) }" instead of rejecting

[Killed] BlockStatement
src/combat/controllers.ts:122:50
     return request.visibleState.combatants.find((candidate) => candidate.id === actorId)
       ?.turn.movement.remaining ?? null;
   }
-  if ('ownedCombatants' in request.visibleState) {
-    return request.visibleState.ownedCombatants.find((candidate) => candidate.id === actorId)
-      ?.turn.movement.remaining ?? null;
-  }
+  if ('ownedCombatants' in request.visibleState) {}
   return null;
 }
killedBy: one Controller contract and stale response rejection path_not_clipped: clips a movement candidate to the actor remaining movement budget
statusReason: expected { type: 'move', …(3) } to deeply equal { type: 'move', …(3) }

[Survived] ConditionalExpression
src/combat/controllers.ts:122:7
     return request.visibleState.combatants.find((candidate) => candidate.id === actorId)
       ?.turn.movement.remaining ?? null;
   }
-  if ('ownedCombatants' in request.visibleState) {
+  if (true) {
     return request.visibleState.ownedCombatants.find((candidate) => candidate.id === actorId)
       ?.turn.movement.remaining ?? null;

[Killed] EqualityOperator
src/combat/controllers.ts:123:69
       ?.turn.movement.remaining ?? null;
   }
   if ('ownedCombatants' in request.visibleState) {
-    return request.visibleState.ownedCombatants.find((candidate) => candidate.id === actorId)
+    return request.visibleState.ownedCombatants.find((candidate) => candidate.id !== actorId)
       ?.turn.movement.remaining ?? null;
   }
killedBy: one Controller contract and stale response rejection path_not_clipped: clips a movement candidate to the actor remaining movement budget
statusReason: expected { type: 'move', …(3) } to deeply equal { type: 'move', …(3) }

[Killed] ConditionalExpression
src/combat/controllers.ts:123:69
       ?.turn.movement.remaining ?? null;
   }
   if ('ownedCombatants' in request.visibleState) {
-    return request.visibleState.ownedCombatants.find((candidate) => candidate.id === actorId)
+    return request.visibleState.ownedCombatants.find((candidate) => false)
       ?.turn.movement.remaining ?? null;
   }
killedBy: one Controller contract and stale response rejection path_not_clipped: clips a movement candidate to the actor remaining movement budget
statusReason: expected { type: 'move', …(3) } to deeply equal { type: 'move', …(3) }

[Killed] ConditionalExpression
src/combat/controllers.ts:134:69
   command: EncounterCommand,
 ): EncounterCommand | null {
   if (command.type !== 'move') return command;
-  const actor = request.visibleState.combatants.find((candidate) => candidate.id === command.actor);
+  const actor = request.visibleState.combatants.find((candidate) => false);
   const budget = movementRemaining(request, command.actor);
   if (actor === undefined || budget === null) return command;
killedBy: one Controller contract and stale response rejection path_not_clipped: clips a movement candidate to the actor remaining movement budget
statusReason: expected { type: 'move', …(3) } to deeply equal { type: 'move', …(3) }

[Killed] EqualityOperator
src/combat/controllers.ts:134:69
   command: EncounterCommand,
 ): EncounterCommand | null {
   if (command.type !== 'move') return command;
-  const actor = request.visibleState.combatants.find((candidate) => candidate.id === command.actor);
+  const actor = request.visibleState.combatants.find((candidate) => candidate.id !== command.actor);
   const budget = movementRemaining(request, command.actor);
   if (actor === undefined || budget === null) return command;
killedBy: one Controller contract and stale response rejection path_not_clipped: clips a movement candidate to the actor remaining movement budget
statusReason: Controller request has no legal actions.

[Killed] BlockStatement
src/combat/controllers.ts:140:36
   const path: Array<(typeof command.path)[number]> = [];
   let previous = actor.position;
   let spent = 0;
-  for (const cell of command.path) {
-    const cost = gridDistance(previous, cell);
-    if (spent + cost > budget) break;
-    path.push(cell);
-    spent += cost;
-    previous = cell;
-  }
+  for (const cell of command.path) {}
   return path.length === 0 ? null : { ...command, path };
 }
killedBy: one Controller contract and stale response rejection path_not_clipped: clips a movement candidate to the actor remaining movement budget
statusReason: Controller request has no legal actions.

[Killed] EqualityOperator
src/combat/controllers.ts:142:9
   let spent = 0;
   for (const cell of command.path) {
     const cost = gridDistance(previous, cell);
-    if (spent + cost > budget) break;
+    if (spent + cost >= budget) break;
     path.push(cell);
     spent += cost;
killedBy: one Controller contract and stale response rejection path_not_clipped: clips a movement candidate to the actor remaining movement budget
statusReason: expected { type: 'move', …(3) } to deeply equal { type: 'move', …(3) }

[Killed] ConditionalExpression
src/combat/controllers.ts:142:9
   let spent = 0;
   for (const cell of command.path) {
     const cost = gridDistance(previous, cell);
-    if (spent + cost > budget) break;
+    if (true) break;
     path.push(cell);
     spent += cost;
killedBy: one Controller contract and stale response rejection path_not_clipped: clips a movement candidate to the actor remaining movement budget
statusReason: Controller request has no legal actions.

[Killed] AssignmentOperator
src/combat/controllers.ts:144:5
     const cost = gridDistance(previous, cell);
     if (spent + cost > budget) break;
     path.push(cell);
-    spent += cost;
+    spent -= cost;
     previous = cell;
   }
killedBy: one Controller contract and stale response rejection path_not_clipped: clips a movement candidate to the actor remaining movement budget
statusReason: expected { type: 'move', …(3) } to deeply equal { type: 'move', …(3) }

[Killed] EqualityOperator
src/combat/controllers.ts:147:10
     spent += cost;
     previous = cell;
   }
-  return path.length === 0 ? null : { ...command, path };
+  return path.length !== 0 ? null : { ...command, path };
 }
 
killedBy: one Controller contract and stale response rejection path_not_clipped: clips a movement candidate to the actor remaining movement budget
statusReason: Controller request has no legal actions.

[Killed] ConditionalExpression
src/combat/controllers.ts:147:10
     spent += cost;
     previous = cell;
   }
-  return path.length === 0 ? null : { ...command, path };
+  return false ? null : { ...command, path };
 }
 
killedBy: controller mutation contract: movement and listed-action validation uses the DM movement budget and rejects a candidate whose first cell exceeds it
statusReason: promise resolved "{ …(3) }" instead of rejecting

[Killed] BlockStatement
src/combat/controllers.ts:154:51
   command: EncounterCommand,
   legalActions: LegalActionSummary,
 ): boolean {
-  return legalActions.actions.some((candidate) => {
-    if (commandKey(candidate) === commandKey(command)) return true;
-    if (
-      command.type !== 'move' || candidate.type !== 'move' ||
-      command.actor !== candidate.actor || command.cause !== candidate.cause ||
-      command.path.length === 0 || command.path.length >= candidate.path.length
-    ) return false;
-    return command.path.every((cell, index) => {
-      const listed = candidate.path[index];
-      return listed !== undefined && listed.column === cell.column && listed.row === cell.row;
-    });
-  });
+  return legalActions.actions.some((candidate) => {});
 }
 
killedBy: one Controller contract and stale response rejection controller swap aborts the old prompt and reissues at the action boundary
statusReason: expected { kind: 'refused', …(3) } to match object { kind: 'applied' }
(37 matching properties omitted from actual)

[Killed] BooleanLiteral
src/combat/controllers.ts:155:63
   legalActions: LegalActionSummary,
 ): boolean {
   return legalActions.actions.some((candidate) => {
-    if (commandKey(candidate) === commandKey(command)) return true;
+    if (commandKey(candidate) === commandKey(command)) return false;
     if (
       command.type !== 'move' || candidate.type !== 'move' ||
killedBy: one Controller contract and stale response rejection controller swap aborts the old prompt and reissues at the action boundary
statusReason: expected { kind: 'refused', …(3) } to match object { kind: 'applied' }
(37 matching properties omitted from actual)

[Killed] EqualityOperator
src/combat/controllers.ts:155:9
   legalActions: LegalActionSummary,
 ): boolean {
   return legalActions.actions.some((candidate) => {
-    if (commandKey(candidate) === commandKey(command)) return true;
+    if (commandKey(candidate) !== commandKey(command)) return true;
     if (
       command.type !== 'move' || candidate.type !== 'move' ||
killedBy: one Controller contract and stale response rejection controller swap aborts the old prompt and reissues at the action boundary
statusReason: expected { kind: 'refused', …(3) } to match object { kind: 'applied' }
(37 matching properties omitted from actual)

[Killed] ConditionalExpression
src/combat/controllers.ts:158:7
     if (commandKey(candidate) === commandKey(command)) return true;
     if (
       command.type !== 'move' || candidate.type !== 'move' ||
-      command.actor !== candidate.actor || command.cause !== candidate.cause ||
+      false || command.cause !== candidate.cause ||
       command.path.length === 0 || command.path.length >= candidate.path.length
     ) return false;
killedBy: controller mutation contract: movement and listed-action validation accepts exactly listed actions and only strict matching movement prefixes
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/combat/controllers.ts:158:7
     if (commandKey(candidate) === commandKey(command)) return true;
     if (
       command.type !== 'move' || candidate.type !== 'move' ||
-      command.actor !== candidate.actor || command.cause !== candidate.cause ||
+      command.actor === candidate.actor || command.cause !== candidate.cause ||
       command.path.length === 0 || command.path.length >= candidate.path.length
     ) return false;
killedBy: controller mutation contract: movement and listed-action validation accepts exactly listed actions and only strict matching movement prefixes
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/combat/controllers.ts:159:7
     if (
       command.type !== 'move' || candidate.type !== 'move' ||
       command.actor !== candidate.actor || command.cause !== candidate.cause ||
-      command.path.length === 0 || command.path.length >= candidate.path.length
+      false || command.path.length >= candidate.path.length
     ) return false;
     return command.path.every((cell, index) => {
killedBy: controller mutation contract: movement and listed-action validation accepts exactly listed actions and only strict matching movement prefixes
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/combat/controllers.ts:159:36
     if (
       command.type !== 'move' || candidate.type !== 'move' ||
       command.actor !== candidate.actor || command.cause !== candidate.cause ||
-      command.path.length === 0 || command.path.length >= candidate.path.length
+      command.path.length === 0 || command.path.length < candidate.path.length
     ) return false;
     return command.path.every((cell, index) => {
killedBy: controller mutation contract: movement and listed-action validation accepts exactly listed actions and only strict matching movement prefixes
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/combat/controllers.ts:160:14
       command.type !== 'move' || candidate.type !== 'move' ||
       command.actor !== candidate.actor || command.cause !== candidate.cause ||
       command.path.length === 0 || command.path.length >= candidate.path.length
-    ) return false;
+    ) return true;
     return command.path.every((cell, index) => {
       const listed = candidate.path[index];
killedBy: event-sourced encounter persistence POLICY-AND-REFUSAL-CRASH-PROBES persist non-prompt coordinator transitions
statusReason: expected 'applied' to be 'refused' // Object.is equality

[Killed] BlockStatement
src/combat/controllers.ts:161:48
       command.actor !== candidate.actor || command.cause !== candidate.cause ||
       command.path.length === 0 || command.path.length >= candidate.path.length
     ) return false;
-    return command.path.every((cell, index) => {
-      const listed = candidate.path[index];
-      return listed !== undefined && listed.column === cell.column && listed.row === cell.row;
-    });
+    return command.path.every((cell, index) => {});
   });
 }
killedBy: controller mutation contract: movement and listed-action validation accepts exactly listed actions and only strict matching movement prefixes
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/combat/controllers.ts:161:12
       command.actor !== candidate.actor || command.cause !== candidate.cause ||
       command.path.length === 0 || command.path.length >= candidate.path.length
     ) return false;
-    return command.path.every((cell, index) => {
-      const listed = candidate.path[index];
-      return listed !== undefined && listed.column === cell.column && listed.row === cell.row;
-    });
+    return command.path.some((cell, index) => {
+  const listed = candidate.path[index];
+  return listed !== undefined && listed.column === cell.column && listed.row === cell.row;
+});
   });
 }
killedBy: controller mutation contract: movement and listed-action validation accepts exactly listed actions and only strict matching movement prefixes
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/combat/controllers.ts:163:38
     ) return false;
     return command.path.every((cell, index) => {
       const listed = candidate.path[index];
-      return listed !== undefined && listed.column === cell.column && listed.row === cell.row;
+      return listed !== undefined && listed.column !== cell.column && listed.row === cell.row;
     });
   });
killedBy: controller mutation contract: movement and listed-action validation accepts exactly listed actions and only strict matching movement prefixes
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/combat/controllers.ts:163:71
     ) return false;
     return command.path.every((cell, index) => {
       const listed = candidate.path[index];
-      return listed !== undefined && listed.column === cell.column && listed.row === cell.row;
+      return listed !== undefined && listed.column === cell.column && true;
     });
   });
killedBy: controller mutation contract: movement and listed-action validation accepts exactly listed actions and only strict matching movement prefixes
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/combat/controllers.ts:173:70
   actorKind: VisibleEncounterState['combatants'][number]['kind'],
   id: CombatantId,
 ) {
-  const target = request.visibleState.combatants.find((candidate) => candidate.id === id);
+  const target = request.visibleState.combatants.find((candidate) => candidate.id !== id);
   return target !== undefined && target.kind !== actorKind && target.life !== 'dead'
     ? target
killedBy: controller mutation contract: player-character ranking heals a DM-visible dying ally, rejects enemy/dead targets, and honors the 75-percent boundary
statusReason: expected { type: 'cast_spell', …(12) } to match object { type: 'attack', …(1) }
(12 matching properties omitted from actual)

[Killed] ArrowFunction
src/combat/controllers.ts:173:55
   actorKind: VisibleEncounterState['combatants'][number]['kind'],
   id: CombatantId,
 ) {
-  const target = request.visibleState.combatants.find((candidate) => candidate.id === id);
+  const target = request.visibleState.combatants.find(() => undefined);
   return target !== undefined && target.kind !== actorKind && target.life !== 'dead'
     ? target
killedBy: controller mutation contract: player-character ranking heals a DM-visible dying ally, rejects enemy/dead targets, and honors the 75-percent boundary
statusReason: expected { type: 'cast_spell', …(12) } to match object { type: 'attack', …(1) }
(12 matching properties omitted from actual)
