[Killed] ConditionalExpression
src/combat/controllers.ts:174:34
   id: CombatantId,
 ) {
   const target = request.visibleState.combatants.find((candidate) => candidate.id === id);
-  return target !== undefined && target.kind !== actorKind && target.life !== 'dead'
+  return target !== undefined && true && target.life !== 'dead'
     ? target
     : null;
killedBy: player-character AlgorithmController policy pc_always_ends_turn + attacks_allies: a bow PC attacks a hostile at range instead of dashing or attacking an ally
statusReason: expected { type: 'attack', …(9) } to match object { type: 'attack', …(3) }
(9 matching properties omitted from actual)

[Killed] EqualityOperator
src/combat/controllers.ts:174:34
   id: CombatantId,
 ) {
   const target = request.visibleState.combatants.find((candidate) => candidate.id === id);
-  return target !== undefined && target.kind !== actorKind && target.life !== 'dead'
+  return target !== undefined && target.kind === actorKind && target.life !== 'dead'
     ? target
     : null;
killedBy: controller mutation contract: player-character ranking heals a DM-visible dying ally, rejects enemy/dead targets, and honors the 75-percent boundary
statusReason: expected { type: 'cast_spell', …(12) } to match object { type: 'attack', …(1) }
(12 matching properties omitted from actual)

[Killed] ConditionalExpression
src/combat/controllers.ts:180:10
 }
 
 function isTacticalHealingSpell(spellId: string): boolean {
-  return spellId === 'cure-wounds' || spellId === 'healing-word';
+  return false;
 }
 
killedBy: controller mutation contract: player-character ranking heals a DM-visible dying ally, rejects enemy/dead targets, and honors the 75-percent boundary
statusReason: expected { type: 'attack', …(9) } to be { type: 'cast_spell', …(12) } // Object.is equality

[Killed] ConditionalExpression
src/combat/controllers.ts:180:10
 }
 
 function isTacticalHealingSpell(spellId: string): boolean {
-  return spellId === 'cure-wounds' || spellId === 'healing-word';
+  return false || spellId === 'healing-word';
 }
 
killedBy: controller mutation contract: player-character ranking heals a DM-visible dying ally, rejects enemy/dead targets, and honors the 75-percent boundary
statusReason: expected { type: 'attack', …(9) } to be { type: 'cast_spell', …(12) } // Object.is equality

[Killed] ConditionalExpression
src/combat/controllers.ts:184:72
 }
 
 function isTacticalRangedSpell(spellId: string): boolean {
-  return spellId === 'eldritch-blast' || spellId === 'ray-of-frost' || spellId === 'slow' ||
+  return spellId === 'eldritch-blast' || spellId === 'ray-of-frost' || false ||
     spellId === 'spirit-guardians' || spellId === 'command';
 }
killedBy: controller mutation contract: player-character ranking moves farther from hostiles after the tactical ranged spell slow
statusReason: expected { type: 'move', …(3) } to deeply equal { type: 'move', …(3) }

[Killed] ConditionalExpression
src/combat/controllers.ts:184:10
 }
 
 function isTacticalRangedSpell(spellId: string): boolean {
-  return spellId === 'eldritch-blast' || spellId === 'ray-of-frost' || spellId === 'slow' ||
-    spellId === 'spirit-guardians' || spellId === 'command';
+  return false;
 }
 
killedBy: controller mutation contract: player-character ranking moves farther from hostiles after the tactical ranged spell eldritch-blast
statusReason: expected { type: 'move', …(3) } to deeply equal { type: 'move', …(3) }

[Killed] EqualityOperator
src/combat/controllers.ts:185:39
 
 function isTacticalRangedSpell(spellId: string): boolean {
   return spellId === 'eldritch-blast' || spellId === 'ray-of-frost' || spellId === 'slow' ||
-    spellId === 'spirit-guardians' || spellId === 'command';
+    spellId === 'spirit-guardians' || spellId !== 'command';
 }
 
killedBy: controller mutation contract: player-character ranking moves farther from hostiles after the tactical ranged spell command
statusReason: expected { type: 'move', …(3) } to deeply equal { type: 'move', …(3) }

[Killed] ConditionalExpression
src/combat/controllers.ts:185:39
 
 function isTacticalRangedSpell(spellId: string): boolean {
   return spellId === 'eldritch-blast' || spellId === 'ray-of-frost' || spellId === 'slow' ||
-    spellId === 'spirit-guardians' || spellId === 'command';
+    spellId === 'spirit-guardians' || false;
 }
 
killedBy: controller mutation contract: player-character ranking moves farther from hostiles after the tactical ranged spell command
statusReason: expected { type: 'move', …(3) } to deeply equal { type: 'move', …(3) }

[Killed] ConditionalExpression
src/combat/controllers.ts:200:70
   actorKind: VisibleEncounterState['combatants'][number]['kind'],
   id: CombatantId,
 ) {
-  const target = request.visibleState.combatants.find((candidate) => candidate.id === id);
+  const target = request.visibleState.combatants.find((candidate) => false);
   return target !== undefined && target.kind === actorKind && target.life !== 'dead'
     ? target
killedBy: player-character AlgorithmController policy heals_enemies: heals a dying ally rather than a dying enemy
statusReason: expected { type: 'attack', …(9) } to match object { type: 'cast_spell', …(2) }
(12 matching properties omitted from actual)

[Killed] EqualityOperator
src/combat/controllers.ts:201:63
   id: CombatantId,
 ) {
   const target = request.visibleState.combatants.find((candidate) => candidate.id === id);
-  return target !== undefined && target.kind === actorKind && target.life !== 'dead'
+  return target !== undefined && target.kind === actorKind && target.life === 'dead'
     ? target
     : null;
killedBy: D382 survival package pins the fixed 30-seed final-encounter survival fraction at or above two thirds
statusReason: expected { successes: 30, total: 30 } to deeply equal { successes: 29, total: 30 }

[Killed] EqualityOperator
src/combat/controllers.ts:201:34
   id: CombatantId,
 ) {
   const target = request.visibleState.combatants.find((candidate) => candidate.id === id);
-  return target !== undefined && target.kind === actorKind && target.life !== 'dead'
+  return target !== undefined && target.kind !== actorKind && target.life !== 'dead'
     ? target
     : null;
killedBy: D382 survival package pins the fixed 30-seed final-encounter survival fraction at or above two thirds
statusReason: expected { successes: 30, total: 30 } to deeply equal { successes: 29, total: 30 }

[Killed] BlockStatement
src/combat/controllers.ts:210:41
   request: ControllerRequest,
   id: CombatantId,
 ): { readonly current: number; readonly maximumKnown: number } | null {
-  if ('viewer' in request.visibleState) {
-    const target = request.visibleState.combatants.find((candidate) => candidate.id === id);
-    return target === undefined
-      ? null
-      : { current: target.hitPoints, maximumKnown: target.rules.hitPointMaximum };
-  }
+  if ('viewer' in request.visibleState) {}
   if ('ownedCombatants' in request.visibleState) {
     const owned = request.visibleState.ownedCombatants.find((candidate) => candidate.id === id);
killedBy: controller mutation contract: player-character ranking heals a DM-visible dying ally, rejects enemy/dead targets, and honors the 75-percent boundary
statusReason: expected { type: 'attack', …(9) } to be { type: 'cast_spell', …(12) } // Object.is equality

[Killed] ConditionalExpression
src/combat/controllers.ts:211:72
   id: CombatantId,
 ): { readonly current: number; readonly maximumKnown: number } | null {
   if ('viewer' in request.visibleState) {
-    const target = request.visibleState.combatants.find((candidate) => candidate.id === id);
+    const target = request.visibleState.combatants.find((candidate) => true);
     return target === undefined
       ? null
killedBy: controller mutation contract: player-character ranking heals a DM-visible dying ally, rejects enemy/dead targets, and honors the 75-percent boundary
statusReason: expected { type: 'attack', …(9) } to be { type: 'cast_spell', …(12) } // Object.is equality

[Killed] EqualityOperator
src/combat/controllers.ts:211:72
   id: CombatantId,
 ): { readonly current: number; readonly maximumKnown: number } | null {
   if ('viewer' in request.visibleState) {
-    const target = request.visibleState.combatants.find((candidate) => candidate.id === id);
+    const target = request.visibleState.combatants.find((candidate) => candidate.id !== id);
     return target === undefined
       ? null
killedBy: controller mutation contract: player-character ranking heals a DM-visible dying ally, rejects enemy/dead targets, and honors the 75-percent boundary
statusReason: expected { type: 'attack', …(9) } to be { type: 'cast_spell', …(12) } // Object.is equality

[Killed] BlockStatement
src/combat/controllers.ts:216:50
       ? null
       : { current: target.hitPoints, maximumKnown: target.rules.hitPointMaximum };
   }
-  if ('ownedCombatants' in request.visibleState) {
-    const owned = request.visibleState.ownedCombatants.find((candidate) => candidate.id === id);
-    if (owned !== undefined) {
-      return { current: owned.hitPoints, maximumKnown: owned.hitPointMaximum };
-    }
-  }
+  if ('ownedCombatants' in request.visibleState) {}
   const hitPointEvents: Array<{
     readonly hitPointsBefore: number;
killedBy: controller mutation contract: player-character ranking uses player-owned hit points before event history when ranking a healing target
statusReason: expected { type: 'attack', …(9) } to be { type: 'cast_spell', …(12) } // Object.is equality

[Killed] EqualityOperator
src/combat/controllers.ts:217:76
       : { current: target.hitPoints, maximumKnown: target.rules.hitPointMaximum };
   }
   if ('ownedCombatants' in request.visibleState) {
-    const owned = request.visibleState.ownedCombatants.find((candidate) => candidate.id === id);
+    const owned = request.visibleState.ownedCombatants.find((candidate) => candidate.id !== id);
     if (owned !== undefined) {
       return { current: owned.hitPoints, maximumKnown: owned.hitPointMaximum };
killedBy: player-character AlgorithmController policy focus_fire_inverted: prefers the already-damaged enemy over a healthier closer target
statusReason: expected { type: 'attack', …(9) } to match object { type: 'attack', …(1) }
(11 matching properties omitted from actual)

[Killed] ConditionalExpression
src/combat/controllers.ts:217:76
       : { current: target.hitPoints, maximumKnown: target.rules.hitPointMaximum };
   }
   if ('ownedCombatants' in request.visibleState) {
-    const owned = request.visibleState.ownedCombatants.find((candidate) => candidate.id === id);
+    const owned = request.visibleState.ownedCombatants.find((candidate) => true);
     if (owned !== undefined) {
       return { current: owned.hitPoints, maximumKnown: owned.hitPointMaximum };
killedBy: player-character AlgorithmController policy focus_fire_inverted: prefers the already-damaged enemy over a healthier closer target
statusReason: expected { type: 'attack', …(9) } to match object { type: 'attack', …(1) }
(11 matching properties omitted from actual)

[Killed] BlockStatement
src/combat/controllers.ts:218:30
   }
   if ('ownedCombatants' in request.visibleState) {
     const owned = request.visibleState.ownedCombatants.find((candidate) => candidate.id === id);
-    if (owned !== undefined) {
-      return { current: owned.hitPoints, maximumKnown: owned.hitPointMaximum };
-    }
+    if (owned !== undefined) {}
   }
   const hitPointEvents: Array<{
killedBy: controller mutation contract: player-character ranking uses player-owned hit points before event history when ranking a healing target
statusReason: expected { type: 'attack', …(9) } to be { type: 'cast_spell', …(12) } // Object.is equality

[Killed] BlockStatement
src/combat/controllers.ts:226:58
     readonly hitPointsBefore: number;
     readonly hitPointsAfter: number;
   }> = [];
-  for (const event of request.visibleState.recentEvents) {
-    if (
-      (event.type === 'damage_applied' || event.type === 'healing_applied') &&
-      event.target === id
-    ) hitPointEvents.push(event);
-  }
+  for (const event of request.visibleState.recentEvents) {}
   const latest = hitPointEvents.at(-1);
   if (latest === undefined) return null;
killedBy: player-character AlgorithmController policy focus_fire_inverted: prefers the already-damaged enemy over a healthier closer target
statusReason: expected { type: 'attack', …(9) } to match object { type: 'attack', …(1) }
(11 matching properties omitted from actual)

[Killed] ConditionalExpression
src/combat/controllers.ts:228:8
   }> = [];
   for (const event of request.visibleState.recentEvents) {
     if (
-      (event.type === 'damage_applied' || event.type === 'healing_applied') &&
+      (false || event.type === 'healing_applied') &&
       event.target === id
     ) hitPointEvents.push(event);
killedBy: player-character AlgorithmController policy focus_fire_inverted: prefers the already-damaged enemy over a healthier closer target
statusReason: expected { type: 'attack', …(9) } to match object { type: 'attack', …(1) }
(11 matching properties omitted from actual)

[Survived] ConditionalExpression
src/combat/controllers.ts:228:43
   }> = [];
   for (const event of request.visibleState.recentEvents) {
     if (
-      (event.type === 'damage_applied' || event.type === 'healing_applied') &&
+      (event.type === 'damage_applied' || false) &&
       event.target === id
     ) hitPointEvents.push(event);

[Killed] ConditionalExpression
src/combat/controllers.ts:229:7
   for (const event of request.visibleState.recentEvents) {
     if (
       (event.type === 'damage_applied' || event.type === 'healing_applied') &&
-      event.target === id
+      true
     ) hitPointEvents.push(event);
   }
killedBy: player-character AlgorithmController policy focus_fire_inverted: prefers the already-damaged enemy over a healthier closer target
statusReason: expected { type: 'attack', …(9) } to match object { type: 'attack', …(1) }
(11 matching properties omitted from actual)

[Killed] EqualityOperator
src/combat/controllers.ts:229:7
   for (const event of request.visibleState.recentEvents) {
     if (
       (event.type === 'damage_applied' || event.type === 'healing_applied') &&
-      event.target === id
+      event.target !== id
     ) hitPointEvents.push(event);
   }
killedBy: player-character AlgorithmController policy focus_fire_inverted: prefers the already-damaged enemy over a healthier closer target
statusReason: expected { type: 'attack', …(9) } to match object { type: 'attack', …(1) }
(11 matching properties omitted from actual)

[Killed] UnaryOperator
src/combat/controllers.ts:232:36
       event.target === id
     ) hitPointEvents.push(event);
   }
-  const latest = hitPointEvents.at(-1);
+  const latest = hitPointEvents.at(+1);
   if (latest === undefined) return null;
   return {
killedBy: player-character AlgorithmController policy focus_fire_inverted: prefers the already-damaged enemy over a healthier closer target
statusReason: expected { type: 'attack', …(9) } to match object { type: 'attack', …(1) }
(11 matching properties omitted from actual)

[Killed] MethodExpression
src/combat/controllers.ts:236:19
   if (latest === undefined) return null;
   return {
     current: latest.hitPointsAfter,
-    maximumKnown: Math.max(...hitPointEvents.flatMap((event) => [
-      event.hitPointsBefore,
-      event.hitPointsAfter,
-    ])),
+    maximumKnown: Math.min(...hitPointEvents.flatMap(event => [event.hitPointsBefore, event.hitPointsAfter])),
   };
 }
killedBy: player-character AlgorithmController policy heal_below_threshold: heals an ally at half of its last-known maximum before attacking
statusReason: expected { type: 'attack', …(9) } to match object { type: 'cast_spell', …(2) }
(12 matching properties omitted from actual)

[Killed] ConditionalExpression
src/combat/controllers.ts:247:7
   request: ControllerRequest,
   target: VisibleEncounterState['combatants'][number],
 ): 0 | 1 | null {
-  if (target.life === 'dying') return 0;
+  if (false) return 0;
   const hitPoints = lastKnownHitPoints(request, target.id);
   return hitPoints !== null && hitPoints.current * 4 <= hitPoints.maximumKnown * 3 ? 1 : null;
killedBy: controller mutation contract: player-character ranking keeps a dying target first when the healing-priority comparator receives dying then wounded
statusReason: expected { type: 'cast_spell', …(12) } to be { type: 'cast_spell', …(12) } // Object.is equality

[Killed] EqualityOperator
src/combat/controllers.ts:247:7
   request: ControllerRequest,
   target: VisibleEncounterState['combatants'][number],
 ): 0 | 1 | null {
-  if (target.life === 'dying') return 0;
+  if (target.life !== 'dying') return 0;
   const hitPoints = lastKnownHitPoints(request, target.id);
   return hitPoints !== null && hitPoints.current * 4 <= hitPoints.maximumKnown * 3 ? 1 : null;
killedBy: player-character AlgorithmController policy healing_priority: heals a dying ally before an ally at half hit points
statusReason: expected { type: 'cast_spell', …(12) } to match object { type: 'cast_spell', …(2) }
(10 matching properties omitted from actual)

[Killed] ConditionalExpression
src/combat/controllers.ts:249:10
 ): 0 | 1 | null {
   if (target.life === 'dying') return 0;
   const hitPoints = lastKnownHitPoints(request, target.id);
-  return hitPoints !== null && hitPoints.current * 4 <= hitPoints.maximumKnown * 3 ? 1 : null;
+  return false ? 1 : null;
 }
 
killedBy: controller mutation contract: player-character ranking heals a DM-visible dying ally, rejects enemy/dead targets, and honors the 75-percent boundary
statusReason: expected { type: 'attack', …(9) } to be { type: 'cast_spell', …(12) } // Object.is equality

[Killed] EqualityOperator
src/combat/controllers.ts:249:32
 ): 0 | 1 | null {
   if (target.life === 'dying') return 0;
   const hitPoints = lastKnownHitPoints(request, target.id);
-  return hitPoints !== null && hitPoints.current * 4 <= hitPoints.maximumKnown * 3 ? 1 : null;
+  return hitPoints !== null && hitPoints.current * 4 < hitPoints.maximumKnown * 3 ? 1 : null;
 }
 
killedBy: controller mutation contract: player-character ranking heals a DM-visible dying ally, rejects enemy/dead targets, and honors the 75-percent boundary
statusReason: expected { type: 'attack', …(9) } to be { type: 'cast_spell', …(12) } // Object.is equality

[Killed] UnaryOperator
src/combat/controllers.ts:267:23
   request: ControllerRequest,
   actor: VisibleEncounterState['combatants'][number],
 ): boolean {
-  let lastTurnStart = -1;
+  let lastTurnStart = +1;
   for (const [index, event] of request.visibleState.recentEvents.entries()) {
     if (event.type === 'turn_started' && event.combatant === actor.id) lastTurnStart = index;
killedBy: player-character AlgorithmController policy policy_ignores_cover: 'Warlock' caster selects reachable cover after 'eldritch-blast'
statusReason: expected { type: 'move', …(3) } to deeply equal { type: 'move', …(3) }

[Killed] BlockStatement
src/combat/controllers.ts:268:77
   actor: VisibleEncounterState['combatants'][number],
 ): boolean {
   let lastTurnStart = -1;
-  for (const [index, event] of request.visibleState.recentEvents.entries()) {
-    if (event.type === 'turn_started' && event.combatant === actor.id) lastTurnStart = index;
-  }
+  for (const [index, event] of request.visibleState.recentEvents.entries()) {}
   return request.visibleState.recentEvents.slice(lastTurnStart + 1).some((event) => {
     if (event.type === 'attack_resolved' && event.actor === actor.id) {
killedBy: controller mutation contract: player-character ranking recognizes any far hostile spell target, but ignores allied targets and events before the latest own turn
statusReason: expected { type: 'move', …(3) } to deeply equal { type: 'move', …(3) }

[Killed] ConditionalExpression
src/combat/controllers.ts:269:9
 ): boolean {
   let lastTurnStart = -1;
   for (const [index, event] of request.visibleState.recentEvents.entries()) {
-    if (event.type === 'turn_started' && event.combatant === actor.id) lastTurnStart = index;
+    if (true) lastTurnStart = index;
   }
   return request.visibleState.recentEvents.slice(lastTurnStart + 1).some((event) => {
killedBy: controller mutation contract: player-character ranking moves farther from hostiles after the tactical ranged spell eldritch-blast
statusReason: expected { type: 'move', …(3) } to deeply equal { type: 'move', …(3) }

[Killed] ConditionalExpression
src/combat/controllers.ts:269:42
 ): boolean {
   let lastTurnStart = -1;
   for (const [index, event] of request.visibleState.recentEvents.entries()) {
-    if (event.type === 'turn_started' && event.combatant === actor.id) lastTurnStart = index;
+    if (event.type === 'turn_started' && true) lastTurnStart = index;
   }
   return request.visibleState.recentEvents.slice(lastTurnStart + 1).some((event) => {
killedBy: controller mutation contract: player-character ranking recognizes any far hostile spell target, but ignores allied targets and events before the latest own turn
statusReason: expected { type: 'move', …(3) } to deeply equal { type: 'move', …(3) }

[Killed] ArithmeticOperator
src/combat/controllers.ts:271:50
   for (const [index, event] of request.visibleState.recentEvents.entries()) {
     if (event.type === 'turn_started' && event.combatant === actor.id) lastTurnStart = index;
   }
-  return request.visibleState.recentEvents.slice(lastTurnStart + 1).some((event) => {
+  return request.visibleState.recentEvents.slice(lastTurnStart - 1).some((event) => {
     if (event.type === 'attack_resolved' && event.actor === actor.id) {
       const target = visibleHostile(request, actor.kind, event.target);
killedBy: controller mutation contract: player-character ranking recognizes any far hostile spell target, but ignores allied targets and events before the latest own turn
statusReason: expected { type: 'move', …(3) } to deeply equal { type: 'move', …(3) }

[Killed] BlockStatement
src/combat/controllers.ts:271:85
   for (const [index, event] of request.visibleState.recentEvents.entries()) {
     if (event.type === 'turn_started' && event.combatant === actor.id) lastTurnStart = index;
   }
-  return request.visibleState.recentEvents.slice(lastTurnStart + 1).some((event) => {
-    if (event.type === 'attack_resolved' && event.actor === actor.id) {
-      const target = visibleHostile(request, actor.kind, event.target);
-      return target !== null && gridDistance(actor.position, target.position) > 5;
-    }
-    if (event.type === 'spell_cast' && event.caster === actor.id) {
-      if (isTacticalRangedSpell(event.spellId)) return true;
-      return event.targets.some((id) => {
-        const target = visibleHostile(request, actor.kind, id);
-        return target !== null && gridDistance(actor.position, target.position) > 5;
-      });
-    }
-    return false;
-  });
+  return request.visibleState.recentEvents.slice(lastTurnStart + 1).some((event) => {});
 }
 
killedBy: controller mutation contract: player-character ranking moves farther from hostiles after the tactical ranged spell eldritch-blast
statusReason: expected { type: 'move', …(3) } to deeply equal { type: 'move', …(3) }

[Killed] ConditionalExpression
src/combat/controllers.ts:272:45
     if (event.type === 'turn_started' && event.combatant === actor.id) lastTurnStart = index;
   }
   return request.visibleState.recentEvents.slice(lastTurnStart + 1).some((event) => {
-    if (event.type === 'attack_resolved' && event.actor === actor.id) {
+    if (event.type === 'attack_resolved' && true) {
       const target = visibleHostile(request, actor.kind, event.target);
       return target !== null && gridDistance(actor.position, target.position) > 5;
killedBy: controller mutation contract: player-character ranking recognizes only the acting PC ranged attack after the latest turn start
statusReason: expected { type: 'move', …(3) } to deeply equal { type: 'move', …(3) }

[Killed] EqualityOperator
src/combat/controllers.ts:272:45
     if (event.type === 'turn_started' && event.combatant === actor.id) lastTurnStart = index;
   }
   return request.visibleState.recentEvents.slice(lastTurnStart + 1).some((event) => {
-    if (event.type === 'attack_resolved' && event.actor === actor.id) {
+    if (event.type === 'attack_resolved' && event.actor !== actor.id) {
       const target = visibleHostile(request, actor.kind, event.target);
       return target !== null && gridDistance(actor.position, target.position) > 5;
killedBy: controller mutation contract: player-character ranking recognizes only the acting PC ranged attack after the latest turn start
statusReason: expected { type: 'move', …(3) } to deeply equal { type: 'move', …(3) }

[Killed] ConditionalExpression
src/combat/controllers.ts:274:14
   return request.visibleState.recentEvents.slice(lastTurnStart + 1).some((event) => {
     if (event.type === 'attack_resolved' && event.actor === actor.id) {
       const target = visibleHostile(request, actor.kind, event.target);
-      return target !== null && gridDistance(actor.position, target.position) > 5;
+      return false;
     }
     if (event.type === 'spell_cast' && event.caster === actor.id) {
killedBy: controller mutation contract: player-character ranking recognizes only the acting PC ranged attack after the latest turn start
statusReason: expected { type: 'move', …(3) } to deeply equal { type: 'move', …(3) }

[Killed] EqualityOperator
src/combat/controllers.ts:274:33
   return request.visibleState.recentEvents.slice(lastTurnStart + 1).some((event) => {
     if (event.type === 'attack_resolved' && event.actor === actor.id) {
       const target = visibleHostile(request, actor.kind, event.target);
-      return target !== null && gridDistance(actor.position, target.position) > 5;
+      return target !== null && gridDistance(actor.position, target.position) >= 5;
     }
     if (event.type === 'spell_cast' && event.caster === actor.id) {
killedBy: controller mutation contract: player-character ranking does not classify an exactly 5-foot attack as ranged
statusReason: expected { type: 'move', …(3) } to deeply equal { type: 'move', …(3) }

[Killed] BlockStatement
src/combat/controllers.ts:276:67
       const target = visibleHostile(request, actor.kind, event.target);
       return target !== null && gridDistance(actor.position, target.position) > 5;
     }
-    if (event.type === 'spell_cast' && event.caster === actor.id) {
-      if (isTacticalRangedSpell(event.spellId)) return true;
-      return event.targets.some((id) => {
-        const target = visibleHostile(request, actor.kind, id);
-        return target !== null && gridDistance(actor.position, target.position) > 5;
-      });
-    }
+    if (event.type === 'spell_cast' && event.caster === actor.id) {}
     return false;
   });
killedBy: controller mutation contract: player-character ranking moves farther from hostiles after the tactical ranged spell eldritch-blast
statusReason: expected { type: 'move', …(3) } to deeply equal { type: 'move', …(3) }

[Killed] ConditionalExpression
src/combat/controllers.ts:276:40
       const target = visibleHostile(request, actor.kind, event.target);
       return target !== null && gridDistance(actor.position, target.position) > 5;
     }
-    if (event.type === 'spell_cast' && event.caster === actor.id) {
+    if (event.type === 'spell_cast' && true) {
       if (isTacticalRangedSpell(event.spellId)) return true;
       return event.targets.some((id) => {
killedBy: controller mutation contract: player-character ranking recognizes any far hostile spell target, but ignores allied targets and events before the latest own turn
statusReason: expected { type: 'move', …(3) } to deeply equal { type: 'move', …(3) }

[Killed] ConditionalExpression
src/combat/controllers.ts:277:11
       return target !== null && gridDistance(actor.position, target.position) > 5;
     }
     if (event.type === 'spell_cast' && event.caster === actor.id) {
-      if (isTacticalRangedSpell(event.spellId)) return true;
+      if (false) return true;
       return event.targets.some((id) => {
         const target = visibleHostile(request, actor.kind, id);
killedBy: player-character AlgorithmController policy ranged_hugs_melee: after shooting at range, moves farther away and stays put rather than provoking when adjacent
statusReason: expected { type: 'move', …(3) } to deeply equal { type: 'end_turn', …(1) }

[Killed] BooleanLiteral
src/combat/controllers.ts:277:56
       return target !== null && gridDistance(actor.position, target.position) > 5;
     }
     if (event.type === 'spell_cast' && event.caster === actor.id) {
-      if (isTacticalRangedSpell(event.spellId)) return true;
+      if (isTacticalRangedSpell(event.spellId)) return false;
       return event.targets.some((id) => {
         const target = visibleHostile(request, actor.kind, id);
killedBy: controller mutation contract: player-character ranking moves farther from hostiles after the tactical ranged spell eldritch-blast
statusReason: expected { type: 'move', …(3) } to deeply equal { type: 'move', …(3) }

[Killed] BlockStatement
src/combat/controllers.ts:278:41
     }
     if (event.type === 'spell_cast' && event.caster === actor.id) {
       if (isTacticalRangedSpell(event.spellId)) return true;
-      return event.targets.some((id) => {
-        const target = visibleHostile(request, actor.kind, id);
-        return target !== null && gridDistance(actor.position, target.position) > 5;
-      });
+      return event.targets.some((id) => {});
     }
     return false;
killedBy: controller mutation contract: player-character ranking recognizes any far hostile spell target, but ignores allied targets and events before the latest own turn
statusReason: expected { type: 'move', …(3) } to deeply equal { type: 'move', …(3) }
