[Killed] MethodExpression
src/combat/controllers.ts:278:14
     }
     if (event.type === 'spell_cast' && event.caster === actor.id) {
       if (isTacticalRangedSpell(event.spellId)) return true;
-      return event.targets.some((id) => {
-        const target = visibleHostile(request, actor.kind, id);
-        return target !== null && gridDistance(actor.position, target.position) > 5;
-      });
+      return event.targets.every(id => {
+  const target = visibleHostile(request, actor.kind, id);
+  return target !== null && gridDistance(actor.position, target.position) > 5;
+});
     }
     return false;
killedBy: controller mutation contract: player-character ranking recognizes any far hostile spell target, but ignores allied targets and events before the latest own turn
statusReason: expected { type: 'move', …(3) } to deeply equal { type: 'move', …(3) }

[Killed] EqualityOperator
src/combat/controllers.ts:280:35
       if (isTacticalRangedSpell(event.spellId)) return true;
       return event.targets.some((id) => {
         const target = visibleHostile(request, actor.kind, id);
-        return target !== null && gridDistance(actor.position, target.position) > 5;
+        return target !== null && gridDistance(actor.position, target.position) <= 5;
       });
     }
killedBy: controller mutation contract: player-character ranking recognizes any far hostile spell target, but ignores allied targets and events before the latest own turn
statusReason: expected { type: 'move', …(3) } to deeply equal { type: 'move', …(3) }

[Killed] EqualityOperator
src/combat/controllers.ts:280:35
       if (isTacticalRangedSpell(event.spellId)) return true;
       return event.targets.some((id) => {
         const target = visibleHostile(request, actor.kind, id);
-        return target !== null && gridDistance(actor.position, target.position) > 5;
+        return target !== null && gridDistance(actor.position, target.position) >= 5;
       });
     }
killedBy: controller mutation contract: player-character ranking does not classify an arbitrary spell against an exactly 5-foot target as ranged
statusReason: expected { type: 'move', …(3) } to deeply equal { type: 'move', …(3) }

[Killed] ArrowFunction
src/combat/controllers.ts:292:69
   command: EncounterCommand,
   actor: VisibleEncounterState['combatants'][number],
 ): readonly [number, number, number, string] {
-  const isWeaponMasteryDefender = request.legalActions.actions.some((action) =>
-    action.type === 'attack' && action.weaponMastery !== undefined);
+  const isWeaponMasteryDefender = request.legalActions.actions.some(() => undefined);
   const hasToppleTarget = request.legalActions.actions.some((action) =>
     action.type === 'attack' && action.weaponMastery?.property === 'Topple');
killedBy: D382 survival package moves Brann toward a body-blocking melee position before using his ranged Slow weapon
statusReason: expected 'attack' to be 'move' // Object.is equality

[Killed] MethodExpression
src/combat/controllers.ts:292:35
   command: EncounterCommand,
   actor: VisibleEncounterState['combatants'][number],
 ): readonly [number, number, number, string] {
-  const isWeaponMasteryDefender = request.legalActions.actions.some((action) =>
-    action.type === 'attack' && action.weaponMastery !== undefined);
+  const isWeaponMasteryDefender = request.legalActions.actions.every(action => action.type === 'attack' && action.weaponMastery !== undefined);
   const hasToppleTarget = request.legalActions.actions.some((action) =>
     action.type === 'attack' && action.weaponMastery?.property === 'Topple');
killedBy: player-character AlgorithmController policy room-1-terminates: four algorithm PCs versus the bundled pack reaches an end state within 4 rounds
statusReason: expected [ 'initiative_rolled', …(233) ] to not include 'healing_applied'

[Killed] ConditionalExpression
src/combat/controllers.ts:293:5
   actor: VisibleEncounterState['combatants'][number],
 ): readonly [number, number, number, string] {
   const isWeaponMasteryDefender = request.legalActions.actions.some((action) =>
-    action.type === 'attack' && action.weaponMastery !== undefined);
+    true);
   const hasToppleTarget = request.legalActions.actions.some((action) =>
     action.type === 'attack' && action.weaponMastery?.property === 'Topple');
killedBy: player-character AlgorithmController policy ranged_hugs_melee: after shooting at range, moves farther away and stays put rather than provoking when adjacent
statusReason: expected { type: 'move', …(3) } to deeply equal { type: 'move', …(3) }

[Killed] ConditionalExpression
src/combat/controllers.ts:293:5
   actor: VisibleEncounterState['combatants'][number],
 ): readonly [number, number, number, string] {
   const isWeaponMasteryDefender = request.legalActions.actions.some((action) =>
-    action.type === 'attack' && action.weaponMastery !== undefined);
+    false);
   const hasToppleTarget = request.legalActions.actions.some((action) =>
     action.type === 'attack' && action.weaponMastery?.property === 'Topple');
killedBy: D382 survival package moves Brann toward a body-blocking melee position before using his ranged Slow weapon
statusReason: expected 'attack' to be 'move' // Object.is equality

[Killed] MethodExpression
src/combat/controllers.ts:294:27
 ): readonly [number, number, number, string] {
   const isWeaponMasteryDefender = request.legalActions.actions.some((action) =>
     action.type === 'attack' && action.weaponMastery !== undefined);
-  const hasToppleTarget = request.legalActions.actions.some((action) =>
-    action.type === 'attack' && action.weaponMastery?.property === 'Topple');
+  const hasToppleTarget = request.legalActions.actions.every(action => action.type === 'attack' && action.weaponMastery?.property === 'Topple');
   if (command.type === 'drink_healing_potion') {
     const hitPoints = lastKnownHitPoints(request, actor.id);
killedBy: D382 survival package pins the fixed 30-seed final-encounter survival fraction at or above two thirds
statusReason: expected { successes: 30, total: 30 } to deeply equal { successes: 29, total: 30 }

[Killed] ArrowFunction
src/combat/controllers.ts:294:61
 ): readonly [number, number, number, string] {
   const isWeaponMasteryDefender = request.legalActions.actions.some((action) =>
     action.type === 'attack' && action.weaponMastery !== undefined);
-  const hasToppleTarget = request.legalActions.actions.some((action) =>
-    action.type === 'attack' && action.weaponMastery?.property === 'Topple');
+  const hasToppleTarget = request.legalActions.actions.some(() => undefined);
   if (command.type === 'drink_healing_potion') {
     const hitPoints = lastKnownHitPoints(request, actor.id);
killedBy: D382 survival package pins the fixed 30-seed final-encounter survival fraction at or above two thirds
statusReason: expected { successes: 30, total: 30 } to deeply equal { successes: 29, total: 30 }

[Killed] ConditionalExpression
src/combat/controllers.ts:295:5
   const isWeaponMasteryDefender = request.legalActions.actions.some((action) =>
     action.type === 'attack' && action.weaponMastery !== undefined);
   const hasToppleTarget = request.legalActions.actions.some((action) =>
-    action.type === 'attack' && action.weaponMastery?.property === 'Topple');
+    true);
   if (command.type === 'drink_healing_potion') {
     const hitPoints = lastKnownHitPoints(request, actor.id);
killedBy: D382 survival package moves Brann toward a body-blocking melee position before using his ranged Slow weapon
statusReason: expected 'attack' to be 'move' // Object.is equality

[Killed] EqualityOperator
src/combat/controllers.ts:295:33
   const isWeaponMasteryDefender = request.legalActions.actions.some((action) =>
     action.type === 'attack' && action.weaponMastery !== undefined);
   const hasToppleTarget = request.legalActions.actions.some((action) =>
-    action.type === 'attack' && action.weaponMastery?.property === 'Topple');
+    action.type === 'attack' && action.weaponMastery?.property !== 'Topple');
   if (command.type === 'drink_healing_potion') {
     const hitPoints = lastKnownHitPoints(request, actor.id);
killedBy: D382 survival package moves Brann toward a body-blocking melee position before using his ranged Slow weapon
statusReason: expected 'attack' to be 'move' // Object.is equality

[Killed] BlockStatement
src/combat/controllers.ts:296:48
     action.type === 'attack' && action.weaponMastery !== undefined);
   const hasToppleTarget = request.legalActions.actions.some((action) =>
     action.type === 'attack' && action.weaponMastery?.property === 'Topple');
-  if (command.type === 'drink_healing_potion') {
-    const hitPoints = lastKnownHitPoints(request, actor.id);
-    return [1, hitPoints?.current ?? 0, 0, commandKey(command)];
-  }
+  if (command.type === 'drink_healing_potion') {}
   if (command.type === 'opportunity_attack') {
     const target = visibleHostile(request, actor.kind, command.target);
killedBy: controller mutation contract: player-character ranking ranks a potion by the actor current hit points ahead of attacks and fallback actions
statusReason: expected { type: 'attack', …(9) } to deeply equal { type: 'drink_healing_potion', …(2) }

[Killed] ConditionalExpression
src/combat/controllers.ts:296:7
     action.type === 'attack' && action.weaponMastery !== undefined);
   const hasToppleTarget = request.legalActions.actions.some((action) =>
     action.type === 'attack' && action.weaponMastery?.property === 'Topple');
-  if (command.type === 'drink_healing_potion') {
+  if (false) {
     const hitPoints = lastKnownHitPoints(request, actor.id);
     return [1, hitPoints?.current ?? 0, 0, commandKey(command)];
killedBy: controller mutation contract: player-character ranking ranks a potion by the actor current hit points ahead of attacks and fallback actions
statusReason: expected { type: 'attack', …(9) } to deeply equal { type: 'drink_healing_potion', …(2) }

[Killed] BlockStatement
src/combat/controllers.ts:300:46
     const hitPoints = lastKnownHitPoints(request, actor.id);
     return [1, hitPoints?.current ?? 0, 0, commandKey(command)];
   }
-  if (command.type === 'opportunity_attack') {
-    const target = visibleHostile(request, actor.kind, command.target);
-    if (target !== null) {
-      const [hitPoints, distance] = focusRank(request, actor, target);
-      return [0, hitPoints, distance, commandKey(command)];
-    }
-  }
+  if (command.type === 'opportunity_attack') {}
   if (command.type === 'cast_spell') {
     if (command.spellId === 'revivify') return [0, -3, 0, commandKey(command)];
killedBy: controller mutation contract: player-character ranking prefers a hostile opportunity attack to an ordinary attack
statusReason: expected { type: 'attack', …(9) } to be { type: 'opportunity_attack', …(9) } // Object.is equality

[Killed] BlockStatement
src/combat/controllers.ts:302:26
   }
   if (command.type === 'opportunity_attack') {
     const target = visibleHostile(request, actor.kind, command.target);
-    if (target !== null) {
-      const [hitPoints, distance] = focusRank(request, actor, target);
-      return [0, hitPoints, distance, commandKey(command)];
-    }
+    if (target !== null) {}
   }
   if (command.type === 'cast_spell') {
killedBy: controller mutation contract: player-character ranking prefers a hostile opportunity attack to an ordinary attack
statusReason: expected { type: 'attack', …(9) } to be { type: 'opportunity_attack', …(9) } // Object.is equality

[Killed] UnaryOperator
src/combat/controllers.ts:308:52
     }
   }
   if (command.type === 'cast_spell') {
-    if (command.spellId === 'revivify') return [0, -3, 0, commandKey(command)];
+    if (command.spellId === 'revivify') return [0, +3, 0, commandKey(command)];
     if (command.spellId === 'bless') return [0, -1, 0, commandKey(command)];
     if (command.spellId === 'slow' || command.spellId === 'spirit-guardians') {
killedBy: controller mutation contract: player-character ranking keeps revivify ahead of an opportunity attack at the mutated negative-rank boundary
statusReason: expected { type: 'opportunity_attack', …(9) } to match object { type: 'cast_spell', …(1) }
(12 matching properties omitted from actual)

[Killed] ConditionalExpression
src/combat/controllers.ts:308:9
     }
   }
   if (command.type === 'cast_spell') {
-    if (command.spellId === 'revivify') return [0, -3, 0, commandKey(command)];
+    if (false) return [0, -3, 0, commandKey(command)];
     if (command.spellId === 'bless') return [0, -1, 0, commandKey(command)];
     if (command.spellId === 'slow' || command.spellId === 'spirit-guardians') {
killedBy: controller mutation contract: player-character ranking gives revivify its exact tactical priority
statusReason: expected { type: 'opportunity_attack', …(9) } to match object { type: 'cast_spell', …(1) }
(12 matching properties omitted from actual)

[Killed] ConditionalExpression
src/combat/controllers.ts:309:9
   }
   if (command.type === 'cast_spell') {
     if (command.spellId === 'revivify') return [0, -3, 0, commandKey(command)];
-    if (command.spellId === 'bless') return [0, -1, 0, commandKey(command)];
+    if (false) return [0, -1, 0, commandKey(command)];
     if (command.spellId === 'slow' || command.spellId === 'spirit-guardians') {
       return [0, -2, 0, commandKey(command)];
killedBy: typed encounter conclusion room-3-composition-concludes: all algorithm controllers finish the Ridgewing Gallery without a charge refusal
statusReason: Host did not conclude the encounter: round=2 active=combatant:d365-room-3-monster-1 pause=interrupted refusal=none.

[Killed] UnaryOperator
src/combat/controllers.ts:309:49
   }
   if (command.type === 'cast_spell') {
     if (command.spellId === 'revivify') return [0, -3, 0, commandKey(command)];
-    if (command.spellId === 'bless') return [0, -1, 0, commandKey(command)];
+    if (command.spellId === 'bless') return [0, +1, 0, commandKey(command)];
     if (command.spellId === 'slow' || command.spellId === 'spirit-guardians') {
       return [0, -2, 0, commandKey(command)];
killedBy: controller mutation contract: player-character ranking keeps bless negative second-rank ahead of an opportunity attack against a zero-HP hostile
statusReason: expected { type: 'opportunity_attack', …(9) } to match object { Object (type, spellId) }
(12 matching properties omitted from actual)

[Killed] BlockStatement
src/combat/controllers.ts:310:79
   if (command.type === 'cast_spell') {
     if (command.spellId === 'revivify') return [0, -3, 0, commandKey(command)];
     if (command.spellId === 'bless') return [0, -1, 0, commandKey(command)];
-    if (command.spellId === 'slow' || command.spellId === 'spirit-guardians') {
-      return [0, -2, 0, commandKey(command)];
-    }
+    if (command.spellId === 'slow' || command.spellId === 'spirit-guardians') {}
     if (command.spellId === 'command') return [1, -1, 0, commandKey(command)];
     if (isTacticalHealingSpell(command.spellId)) {
killedBy: controller mutation contract: player-character ranking gives slow its exact tactical priority
statusReason: expected { type: 'cast_spell', …(12) } to match object { type: 'cast_spell', spellId: 'slow' }
(11 matching properties omitted from actual)

[Killed] ConditionalExpression
src/combat/controllers.ts:310:39
   if (command.type === 'cast_spell') {
     if (command.spellId === 'revivify') return [0, -3, 0, commandKey(command)];
     if (command.spellId === 'bless') return [0, -1, 0, commandKey(command)];
-    if (command.spellId === 'slow' || command.spellId === 'spirit-guardians') {
+    if (command.spellId === 'slow' || false) {
       return [0, -2, 0, commandKey(command)];
     }
killedBy: controller mutation contract: player-character ranking gives spirit-guardians its exact tactical priority
statusReason: expected { type: 'cast_spell', …(12) } to match object { type: 'cast_spell', …(1) }
(11 matching properties omitted from actual)

[Killed] UnaryOperator
src/combat/controllers.ts:311:18
     if (command.spellId === 'revivify') return [0, -3, 0, commandKey(command)];
     if (command.spellId === 'bless') return [0, -1, 0, commandKey(command)];
     if (command.spellId === 'slow' || command.spellId === 'spirit-guardians') {
-      return [0, -2, 0, commandKey(command)];
+      return [0, +2, 0, commandKey(command)];
     }
     if (command.spellId === 'command') return [1, -1, 0, commandKey(command)];
killedBy: controller mutation contract: player-character ranking gives slow its exact tactical priority
statusReason: expected { type: 'cast_spell', …(12) } to match object { type: 'cast_spell', spellId: 'slow' }
(11 matching properties omitted from actual)

[Killed] ConditionalExpression
src/combat/controllers.ts:313:9
     if (command.spellId === 'slow' || command.spellId === 'spirit-guardians') {
       return [0, -2, 0, commandKey(command)];
     }
-    if (command.spellId === 'command') return [1, -1, 0, commandKey(command)];
+    if (false) return [1, -1, 0, commandKey(command)];
     if (isTacticalHealingSpell(command.spellId)) {
       const ally = command.targets
killedBy: controller mutation contract: player-character ranking ranks command ahead of a potion at the exact second-rank boundary
statusReason: expected { type: 'drink_healing_potion', …(2) } to match object { type: 'cast_spell', …(1) }
(2 matching properties omitted from actual)

[Killed] EqualityOperator
src/combat/controllers.ts:313:9
     if (command.spellId === 'slow' || command.spellId === 'spirit-guardians') {
       return [0, -2, 0, commandKey(command)];
     }
-    if (command.spellId === 'command') return [1, -1, 0, commandKey(command)];
+    if (command.spellId !== 'command') return [1, -1, 0, commandKey(command)];
     if (isTacticalHealingSpell(command.spellId)) {
       const ally = command.targets
killedBy: controller mutation contract: player-character ranking ranks command ahead of a potion at the exact second-rank boundary
statusReason: expected { type: 'drink_healing_potion', …(2) } to match object { type: 'cast_spell', …(1) }
(2 matching properties omitted from actual)

[Killed] BlockStatement
src/combat/controllers.ts:314:50
       return [0, -2, 0, commandKey(command)];
     }
     if (command.spellId === 'command') return [1, -1, 0, commandKey(command)];
-    if (isTacticalHealingSpell(command.spellId)) {
-      const ally = command.targets
-        .map((id) => visibleAlly(request, actor.kind, id))
-        .filter((candidate) => candidate !== null)
-        .sort((left, right) => {
-          const leftPriority = healingPriority(request, left) ?? Number.POSITIVE_INFINITY;
-          const rightPriority = healingPriority(request, right) ?? Number.POSITIVE_INFINITY;
-          return leftPriority - rightPriority || left.id.localeCompare(right.id);
-        })[0];
-      const priority = ally === undefined ? null : healingPriority(request, ally);
-      if (ally !== undefined && priority !== null) {
-        return [priority, lastKnownHitPoints(request, ally.id)?.current ?? 0, 0, commandKey(command)];
-      }
-      return [8, 0, 0, commandKey(command)];
-    }
+    if (isTacticalHealingSpell(command.spellId)) {}
     const target = command.targets
       .map((id) => visibleHostile(request, actor.kind, id))
killedBy: controller mutation contract: player-character ranking heals a DM-visible dying ally, rejects enemy/dead targets, and honors the 75-percent boundary
statusReason: expected { type: 'attack', …(9) } to be { type: 'cast_spell', …(12) } // Object.is equality

[Killed] MethodExpression
src/combat/controllers.ts:315:20
     }
     if (command.spellId === 'command') return [1, -1, 0, commandKey(command)];
     if (isTacticalHealingSpell(command.spellId)) {
-      const ally = command.targets
-        .map((id) => visibleAlly(request, actor.kind, id))
-        .filter((candidate) => candidate !== null)
-        .sort((left, right) => {
-          const leftPriority = healingPriority(request, left) ?? Number.POSITIVE_INFINITY;
-          const rightPriority = healingPriority(request, right) ?? Number.POSITIVE_INFINITY;
-          return leftPriority - rightPriority || left.id.localeCompare(right.id);
-        })[0];
+      const ally = command.targets.map(id => visibleAlly(request, actor.kind, id)).filter(candidate => candidate !== null)[0];
       const priority = ally === undefined ? null : healingPriority(request, ally);
       if (ally !== undefined && priority !== null) {
killedBy: controller mutation contract: player-character ranking sorts healing targets by priority before id and exposes that choice through command rank
statusReason: expected { type: 'cast_spell', …(12) } to be { type: 'cast_spell', …(12) } // Object.is equality

[Killed] LogicalOperator
src/combat/controllers.ts:321:18
         .sort((left, right) => {
           const leftPriority = healingPriority(request, left) ?? Number.POSITIVE_INFINITY;
           const rightPriority = healingPriority(request, right) ?? Number.POSITIVE_INFINITY;
-          return leftPriority - rightPriority || left.id.localeCompare(right.id);
+          return leftPriority - rightPriority && left.id.localeCompare(right.id);
         })[0];
       const priority = ally === undefined ? null : healingPriority(request, ally);
killedBy: controller mutation contract: player-character ranking keeps a dying target first when the healing-priority comparator receives dying then wounded
statusReason: expected { type: 'cast_spell', …(12) } to be { type: 'cast_spell', …(12) } // Object.is equality

[Killed] ArithmeticOperator
src/combat/controllers.ts:321:18
         .sort((left, right) => {
           const leftPriority = healingPriority(request, left) ?? Number.POSITIVE_INFINITY;
           const rightPriority = healingPriority(request, right) ?? Number.POSITIVE_INFINITY;
-          return leftPriority - rightPriority || left.id.localeCompare(right.id);
+          return leftPriority + rightPriority || left.id.localeCompare(right.id);
         })[0];
       const priority = ally === undefined ? null : healingPriority(request, ally);
killedBy: controller mutation contract: player-character ranking sorts healing targets by priority before id and exposes that choice through command rank
statusReason: expected { type: 'cast_spell', …(12) } to be { type: 'cast_spell', …(12) } // Object.is equality

[Killed] BlockStatement
src/combat/controllers.ts:324:52
           return leftPriority - rightPriority || left.id.localeCompare(right.id);
         })[0];
       const priority = ally === undefined ? null : healingPriority(request, ally);
-      if (ally !== undefined && priority !== null) {
-        return [priority, lastKnownHitPoints(request, ally.id)?.current ?? 0, 0, commandKey(command)];
-      }
+      if (ally !== undefined && priority !== null) {}
       return [8, 0, 0, commandKey(command)];
     }
killedBy: controller mutation contract: player-character ranking heals a DM-visible dying ally, rejects enemy/dead targets, and honors the 75-percent boundary
statusReason: expected { type: 'attack', …(9) } to be { type: 'cast_spell', …(12) } // Object.is equality

[Killed] MethodExpression
src/combat/controllers.ts:329:20
       }
       return [8, 0, 0, commandKey(command)];
     }
-    const target = command.targets
-      .map((id) => visibleHostile(request, actor.kind, id))
-      .filter((candidate) => candidate !== null)
-      .sort((left, right) => {
-        const [leftHitPoints, leftDistance] = focusRank(request, actor, left);
-        const [rightHitPoints, rightDistance] = focusRank(request, actor, right);
-        return leftHitPoints - rightHitPoints || leftDistance - rightDistance ||
-          left.id.localeCompare(right.id);
-      })[0];
+    const target = command.targets.map(id => visibleHostile(request, actor.kind, id)).filter(candidate => candidate !== null)[0];
     if (target !== undefined) {
       const [hitPoints, distance] = focusRank(request, actor, target);
killedBy: controller mutation contract: player-character ranking sorts hostile spell targets by known HP, then distance, then id
statusReason: expected { type: 'cast_spell', …(12) } to be { type: 'cast_spell', …(12) } // Object.is equality

[Killed] ConditionalExpression
src/combat/controllers.ts:335:16
       .sort((left, right) => {
         const [leftHitPoints, leftDistance] = focusRank(request, actor, left);
         const [rightHitPoints, rightDistance] = focusRank(request, actor, right);
-        return leftHitPoints - rightHitPoints || leftDistance - rightDistance ||
+        return false ||
           left.id.localeCompare(right.id);
       })[0];
killedBy: controller mutation contract: player-character ranking keeps the lower-HP hostile first when the focus comparator receives weak then strong
statusReason: expected { type: 'cast_spell', …(12) } to be { type: 'cast_spell', …(12) } // Object.is equality

[Killed] ArithmeticOperator
src/combat/controllers.ts:335:16
       .sort((left, right) => {
         const [leftHitPoints, leftDistance] = focusRank(request, actor, left);
         const [rightHitPoints, rightDistance] = focusRank(request, actor, right);
-        return leftHitPoints - rightHitPoints || leftDistance - rightDistance ||
+        return leftHitPoints + rightHitPoints || leftDistance - rightDistance ||
           left.id.localeCompare(right.id);
       })[0];
killedBy: controller mutation contract: player-character ranking sorts hostile spell targets by known HP, then distance, then id
statusReason: expected { type: 'cast_spell', …(12) } to be { type: 'cast_spell', …(12) } // Object.is equality

[Killed] BlockStatement
src/combat/controllers.ts:338:31
         return leftHitPoints - rightHitPoints || leftDistance - rightDistance ||
           left.id.localeCompare(right.id);
       })[0];
-    if (target !== undefined) {
-      const [hitPoints, distance] = focusRank(request, actor, target);
-      return [2, hitPoints, distance, commandKey(command)];
-    }
+    if (target !== undefined) {}
   }
   if (command.type === 'attack') {
killedBy: controller mutation contract: player-character ranking sorts hostile spell targets by known HP, then distance, then id
statusReason: expected { type: 'cast_spell', …(12) } to be { type: 'cast_spell', …(12) } // Object.is equality

[Killed] BlockStatement
src/combat/controllers.ts:343:34
       return [2, hitPoints, distance, commandKey(command)];
     }
   }
-  if (command.type === 'attack') {
-    const target = visibleHostile(request, actor.kind, command.target);
-    if (target !== null) {
-      const [hitPoints, distance] = focusRank(request, actor, target);
-      return command.weaponMastery?.property === 'Topple'
-        ? [2, hitPoints, distance, commandKey(command)]
-        : [3, hitPoints, distance, commandKey(command)];
-    }
-  }
+  if (command.type === 'attack') {}
   if (command.type === 'force_save') {
     const target = visibleHostile(request, actor.kind, command.target);
killedBy: controller mutation contract: player-character ranking heals a DM-visible dying ally, rejects enemy/dead targets, and honors the 75-percent boundary
statusReason: expected { type: 'cast_spell', …(12) } to match object { type: 'attack', …(1) }
(12 matching properties omitted from actual)

[Killed] BlockStatement
src/combat/controllers.ts:345:26
   }
   if (command.type === 'attack') {
     const target = visibleHostile(request, actor.kind, command.target);
-    if (target !== null) {
-      const [hitPoints, distance] = focusRank(request, actor, target);
-      return command.weaponMastery?.property === 'Topple'
-        ? [2, hitPoints, distance, commandKey(command)]
-        : [3, hitPoints, distance, commandKey(command)];
-    }
+    if (target !== null) {}
   }
   if (command.type === 'force_save') {
killedBy: controller mutation contract: player-character ranking heals a DM-visible dying ally, rejects enemy/dead targets, and honors the 75-percent boundary
statusReason: expected { type: 'cast_spell', …(12) } to match object { type: 'attack', …(1) }
(12 matching properties omitted from actual)

[Killed] ConditionalExpression
src/combat/controllers.ts:347:14
     const target = visibleHostile(request, actor.kind, command.target);
     if (target !== null) {
       const [hitPoints, distance] = focusRank(request, actor, target);
-      return command.weaponMastery?.property === 'Topple'
+      return false
         ? [2, hitPoints, distance, commandKey(command)]
         : [3, hitPoints, distance, commandKey(command)];
killedBy: controller mutation contract: player-character ranking prefers Topple, then the weakest hostile for ordinary attacks and saves
statusReason: expected { type: 'attack', …(9) } to be { type: 'attack', …(10) } // Object.is equality

[Killed] EqualityOperator
src/combat/controllers.ts:347:14
     const target = visibleHostile(request, actor.kind, command.target);
     if (target !== null) {
       const [hitPoints, distance] = focusRank(request, actor, target);
-      return command.weaponMastery?.property === 'Topple'
+      return command.weaponMastery?.property !== 'Topple'
         ? [2, hitPoints, distance, commandKey(command)]
         : [3, hitPoints, distance, commandKey(command)];
killedBy: controller mutation contract: player-character ranking prefers Topple, then the weakest hostile for ordinary attacks and saves
statusReason: expected { type: 'attack', …(9) } to be { type: 'attack', …(10) } // Object.is equality
