[Killed] BlockStatement
src/combat/controllers.ts:352:38
         : [3, hitPoints, distance, commandKey(command)];
     }
   }
-  if (command.type === 'force_save') {
-    const target = visibleHostile(request, actor.kind, command.target);
-    if (target !== null) {
-      const [hitPoints, distance] = focusRank(request, actor, target);
-      return [3, hitPoints, distance, commandKey(command)];
-    }
-  }
+  if (command.type === 'force_save') {}
   if (command.type === 'move') {
     const destination = command.path.at(-1) ?? actor.position;
killedBy: controller mutation contract: player-character ranking prefers Topple, then the weakest hostile for ordinary attacks and saves
statusReason: expected { type: 'attack', …(9) } to be { type: 'force_save', …(8) } // Object.is equality

[Killed] BlockStatement
src/combat/controllers.ts:354:26
   }
   if (command.type === 'force_save') {
     const target = visibleHostile(request, actor.kind, command.target);
-    if (target !== null) {
-      const [hitPoints, distance] = focusRank(request, actor, target);
-      return [3, hitPoints, distance, commandKey(command)];
-    }
+    if (target !== null) {}
   }
   if (command.type === 'move') {
killedBy: controller mutation contract: player-character ranking prefers Topple, then the weakest hostile for ordinary attacks and saves
statusReason: expected { type: 'attack', …(9) } to be { type: 'force_save', …(8) } // Object.is equality

[Killed] UnaryOperator
src/combat/controllers.ts:360:41
     }
   }
   if (command.type === 'move') {
-    const destination = command.path.at(-1) ?? actor.position;
+    const destination = command.path.at(+1) ?? actor.position;
     const nearest = Math.min(
       ...request.visibleState.combatants
killedBy: D382 survival package pins the fixed 30-seed final-encounter survival fraction at or above two thirds
statusReason: expected { successes: 30, total: 30 } to deeply equal { successes: 29, total: 30 }

[Killed] MethodExpression
src/combat/controllers.ts:362:10
   if (command.type === 'move') {
     const destination = command.path.at(-1) ?? actor.position;
     const nearest = Math.min(
-      ...request.visibleState.combatants
-        .filter((candidate) => candidate.kind !== actor.kind && candidate.life !== 'dead')
+      ...request.visibleState.combatants
         .map((candidate) => gridDistance(destination, candidate.position)),
     );
killedBy: controller mutation contract: player-character ranking ignores an adjacent ally when deciding whether ranged repositioning would provoke
statusReason: expected { type: 'move', …(3) } to deeply equal { type: 'move', …(3) }

[Killed] EqualityOperator
src/combat/controllers.ts:363:32
     const destination = command.path.at(-1) ?? actor.position;
     const nearest = Math.min(
       ...request.visibleState.combatants
-        .filter((candidate) => candidate.kind !== actor.kind && candidate.life !== 'dead')
+        .filter((candidate) => candidate.kind === actor.kind && candidate.life !== 'dead')
         .map((candidate) => gridDistance(destination, candidate.position)),
     );
killedBy: controller mutation contract: player-character ranking does not classify an arbitrary spell against an exactly 5-foot target as ranged
statusReason: expected { type: 'move', …(3) } to deeply equal { type: 'move', …(3) }

[Killed] ConditionalExpression
src/combat/controllers.ts:363:65
     const destination = command.path.at(-1) ?? actor.position;
     const nearest = Math.min(
       ...request.visibleState.combatants
-        .filter((candidate) => candidate.kind !== actor.kind && candidate.life !== 'dead')
+        .filter((candidate) => candidate.kind !== actor.kind && true)
         .map((candidate) => gridDistance(destination, candidate.position)),
     );
killedBy: player-character AlgorithmController policy room-1-terminates: four algorithm PCs versus the bundled pack reaches an end state within 4 rounds
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/combat/controllers.ts:366:9
         .filter((candidate) => candidate.kind !== actor.kind && candidate.life !== 'dead')
         .map((candidate) => gridDistance(destination, candidate.position)),
     );
-    if (isWeaponMasteryDefender) {
+    if (true) {
       // The defender advances between the nearest hostile and the ranged
       // casters, preferring a legal Topple attack once melee is reached. The
killedBy: player-character AlgorithmController policy ranged_hugs_melee: after shooting at range, moves farther away and stays put rather than provoking when adjacent
statusReason: expected { type: 'move', …(3) } to deeply equal { type: 'move', …(3) }

[Killed] BlockStatement
src/combat/controllers.ts:366:34
         .filter((candidate) => candidate.kind !== actor.kind && candidate.life !== 'dead')
         .map((candidate) => gridDistance(destination, candidate.position)),
     );
-    if (isWeaponMasteryDefender) {
-      // The defender advances between the nearest hostile and the ranged
-      // casters, preferring a legal Topple attack once melee is reached. The
-      // grid has no occupied-cell path reservation, so nearest-hostile
-      // interposition is the movement model's concrete body-block primitive.
-      return hasToppleTarget ? [4, nearest, 0, commandKey(command)] : [2, nearest, 0, commandKey(command)];
-    }
+    if (isWeaponMasteryDefender) {}
     if (usedRangedActionThisTurn(request, actor)) {
       const currentlyAdjacent = request.visibleState.combatants.some((candidate) =>
killedBy: player-character AlgorithmController policy room-1-terminates: four algorithm PCs versus the bundled pack reaches an end state within 4 rounds
statusReason: expected [ 'initiative_rolled', …(233) ] to not include 'healing_applied'

[Killed] ConditionalExpression
src/combat/controllers.ts:373:9
       // interposition is the movement model's concrete body-block primitive.
       return hasToppleTarget ? [4, nearest, 0, commandKey(command)] : [2, nearest, 0, commandKey(command)];
     }
-    if (usedRangedActionThisTurn(request, actor)) {
+    if (false) {
       const currentlyAdjacent = request.visibleState.combatants.some((candidate) =>
         candidate.kind !== actor.kind && candidate.life !== 'dead' &&
killedBy: player-character AlgorithmController policy ranged_hugs_melee: after shooting at range, moves farther away and stays put rather than provoking when adjacent
statusReason: expected { type: 'move', …(3) } to deeply equal { type: 'move', …(3) }

[Killed] BlockStatement
src/combat/controllers.ts:373:51
       // interposition is the movement model's concrete body-block primitive.
       return hasToppleTarget ? [4, nearest, 0, commandKey(command)] : [2, nearest, 0, commandKey(command)];
     }
-    if (usedRangedActionThisTurn(request, actor)) {
-      const currentlyAdjacent = request.visibleState.combatants.some((candidate) =>
-        candidate.kind !== actor.kind && candidate.life !== 'dead' &&
-        gridDistance(actor.position, candidate.position) <= 5);
-      const currentNearest = Math.min(
-        ...request.visibleState.combatants
-          .filter((candidate) => candidate.kind !== actor.kind && candidate.life !== 'dead')
-          .map((candidate) => gridDistance(actor.position, candidate.position)),
-      );
-      const cover = Math.max(0, ...request.visibleState.combatants
-        .filter((candidate) => candidate.kind !== actor.kind && candidate.life !== 'dead')
-        .map((candidate) => COVER_RANK[coverTierBetweenObjects(
-          request.visibleState.worldObjects,
-          destination,
-          candidate.position,
-        )]));
-      return currentlyAdjacent || nearest <= currentNearest
-        ? [10, 0, 0, commandKey(command)]
-        : [4, -nearest, -cover, commandKey(command)];
-    }
+    if (usedRangedActionThisTurn(request, actor)) {}
     return [4, nearest, 0, commandKey(command)];
   }
killedBy: player-character AlgorithmController policy ranged_hugs_melee: after shooting at range, moves farther away and stays put rather than provoking when adjacent
statusReason: expected { type: 'move', …(3) } to deeply equal { type: 'move', …(3) }

[Killed] MethodExpression
src/combat/controllers.ts:374:33
       return hasToppleTarget ? [4, nearest, 0, commandKey(command)] : [2, nearest, 0, commandKey(command)];
     }
     if (usedRangedActionThisTurn(request, actor)) {
-      const currentlyAdjacent = request.visibleState.combatants.some((candidate) =>
-        candidate.kind !== actor.kind && candidate.life !== 'dead' &&
-        gridDistance(actor.position, candidate.position) <= 5);
+      const currentlyAdjacent = request.visibleState.combatants.every(candidate => candidate.kind !== actor.kind && candidate.life !== 'dead' && gridDistance(actor.position, candidate.position) <= 5);
       const currentNearest = Math.min(
         ...request.visibleState.combatants
killedBy: player-character AlgorithmController policy ranged_hugs_melee: after shooting at range, moves farther away and stays put rather than provoking when adjacent
statusReason: expected { type: 'move', …(3) } to deeply equal { type: 'end_turn', …(1) }

[Killed] ArrowFunction
src/combat/controllers.ts:374:70
       return hasToppleTarget ? [4, nearest, 0, commandKey(command)] : [2, nearest, 0, commandKey(command)];
     }
     if (usedRangedActionThisTurn(request, actor)) {
-      const currentlyAdjacent = request.visibleState.combatants.some((candidate) =>
-        candidate.kind !== actor.kind && candidate.life !== 'dead' &&
-        gridDistance(actor.position, candidate.position) <= 5);
+      const currentlyAdjacent = request.visibleState.combatants.some(() => undefined);
       const currentNearest = Math.min(
         ...request.visibleState.combatants
killedBy: player-character AlgorithmController policy ranged_hugs_melee: after shooting at range, moves farther away and stays put rather than provoking when adjacent
statusReason: expected { type: 'move', …(3) } to deeply equal { type: 'end_turn', …(1) }

[Killed] ConditionalExpression
src/combat/controllers.ts:375:9
     }
     if (usedRangedActionThisTurn(request, actor)) {
       const currentlyAdjacent = request.visibleState.combatants.some((candidate) =>
-        candidate.kind !== actor.kind && candidate.life !== 'dead' &&
-        gridDistance(actor.position, candidate.position) <= 5);
+        true);
       const currentNearest = Math.min(
         ...request.visibleState.combatants
killedBy: player-character AlgorithmController policy ranged_hugs_melee: after shooting at range, moves farther away and stays put rather than provoking when adjacent
statusReason: expected { type: 'end_turn', …(1) } to deeply equal { type: 'move', …(3) }

[Killed] ConditionalExpression
src/combat/controllers.ts:375:9
     }
     if (usedRangedActionThisTurn(request, actor)) {
       const currentlyAdjacent = request.visibleState.combatants.some((candidate) =>
-        candidate.kind !== actor.kind && candidate.life !== 'dead' &&
+        true &&
         gridDistance(actor.position, candidate.position) <= 5);
       const currentNearest = Math.min(
killedBy: player-character AlgorithmController policy ranged_hugs_melee: after shooting at range, moves farther away and stays put rather than provoking when adjacent
statusReason: expected { type: 'end_turn', …(1) } to deeply equal { type: 'move', …(3) }

[Killed] EqualityOperator
src/combat/controllers.ts:376:9
     if (usedRangedActionThisTurn(request, actor)) {
       const currentlyAdjacent = request.visibleState.combatants.some((candidate) =>
         candidate.kind !== actor.kind && candidate.life !== 'dead' &&
-        gridDistance(actor.position, candidate.position) <= 5);
+        gridDistance(actor.position, candidate.position) > 5);
       const currentNearest = Math.min(
         ...request.visibleState.combatants
killedBy: player-character AlgorithmController policy ranged_hugs_melee: after shooting at range, moves farther away and stays put rather than provoking when adjacent
statusReason: expected { type: 'end_turn', …(1) } to deeply equal { type: 'move', …(3) }

[Killed] ConditionalExpression
src/combat/controllers.ts:376:9
     if (usedRangedActionThisTurn(request, actor)) {
       const currentlyAdjacent = request.visibleState.combatants.some((candidate) =>
         candidate.kind !== actor.kind && candidate.life !== 'dead' &&
-        gridDistance(actor.position, candidate.position) <= 5);
+        true);
       const currentNearest = Math.min(
         ...request.visibleState.combatants
killedBy: player-character AlgorithmController policy ranged_hugs_melee: after shooting at range, moves farther away and stays put rather than provoking when adjacent
statusReason: expected { type: 'end_turn', …(1) } to deeply equal { type: 'move', …(3) }

[Killed] MethodExpression
src/combat/controllers.ts:378:12
         candidate.kind !== actor.kind && candidate.life !== 'dead' &&
         gridDistance(actor.position, candidate.position) <= 5);
       const currentNearest = Math.min(
-        ...request.visibleState.combatants
-          .filter((candidate) => candidate.kind !== actor.kind && candidate.life !== 'dead')
+        ...request.visibleState.combatants
           .map((candidate) => gridDistance(actor.position, candidate.position)),
       );
killedBy: D382 survival package pins the fixed 30-seed final-encounter survival fraction at or above two thirds
statusReason: expected { successes: 28, total: 30 } to deeply equal { successes: 29, total: 30 }

[Killed] ConditionalExpression
src/combat/controllers.ts:379:34
         gridDistance(actor.position, candidate.position) <= 5);
       const currentNearest = Math.min(
         ...request.visibleState.combatants
-          .filter((candidate) => candidate.kind !== actor.kind && candidate.life !== 'dead')
+          .filter((candidate) => true)
           .map((candidate) => gridDistance(actor.position, candidate.position)),
       );
killedBy: D382 survival package pins the fixed 30-seed final-encounter survival fraction at or above two thirds
statusReason: expected { successes: 28, total: 30 } to deeply equal { successes: 29, total: 30 }

[Killed] ConditionalExpression
src/combat/controllers.ts:379:34
         gridDistance(actor.position, candidate.position) <= 5);
       const currentNearest = Math.min(
         ...request.visibleState.combatants
-          .filter((candidate) => candidate.kind !== actor.kind && candidate.life !== 'dead')
+          .filter((candidate) => true && candidate.life !== 'dead')
           .map((candidate) => gridDistance(actor.position, candidate.position)),
       );
killedBy: D382 survival package pins the fixed 30-seed final-encounter survival fraction at or above two thirds
statusReason: expected { successes: 28, total: 30 } to deeply equal { successes: 29, total: 30 }

[Killed] MethodExpression
src/combat/controllers.ts:382:36
           .filter((candidate) => candidate.kind !== actor.kind && candidate.life !== 'dead')
           .map((candidate) => gridDistance(actor.position, candidate.position)),
       );
-      const cover = Math.max(0, ...request.visibleState.combatants
-        .filter((candidate) => candidate.kind !== actor.kind && candidate.life !== 'dead')
+      const cover = Math.max(0, ...request.visibleState.combatants
         .map((candidate) => COVER_RANK[coverTierBetweenObjects(
           request.visibleState.worldObjects,
killedBy: player-character AlgorithmController policy policy_ignores_cover: 'Warlock' caster selects reachable cover after 'eldritch-blast'
statusReason: expected { type: 'move', …(3) } to deeply equal { type: 'move', …(3) }

[Killed] ConditionalExpression
src/combat/controllers.ts:383:32
           .map((candidate) => gridDistance(actor.position, candidate.position)),
       );
       const cover = Math.max(0, ...request.visibleState.combatants
-        .filter((candidate) => candidate.kind !== actor.kind && candidate.life !== 'dead')
+        .filter((candidate) => true)
         .map((candidate) => COVER_RANK[coverTierBetweenObjects(
           request.visibleState.worldObjects,
killedBy: player-character AlgorithmController policy policy_ignores_cover: 'Warlock' caster selects reachable cover after 'eldritch-blast'
statusReason: expected { type: 'move', …(3) } to deeply equal { type: 'move', …(3) }

[Killed] ConditionalExpression
src/combat/controllers.ts:383:32
           .map((candidate) => gridDistance(actor.position, candidate.position)),
       );
       const cover = Math.max(0, ...request.visibleState.combatants
-        .filter((candidate) => candidate.kind !== actor.kind && candidate.life !== 'dead')
+        .filter((candidate) => true && candidate.life !== 'dead')
         .map((candidate) => COVER_RANK[coverTierBetweenObjects(
           request.visibleState.worldObjects,
killedBy: player-character AlgorithmController policy policy_ignores_cover: 'Warlock' caster selects reachable cover after 'eldritch-blast'
statusReason: expected { type: 'move', …(3) } to deeply equal { type: 'move', …(3) }

[Killed] ConditionalExpression
src/combat/controllers.ts:389:14
           destination,
           candidate.position,
         )]));
-      return currentlyAdjacent || nearest <= currentNearest
+      return true
         ? [10, 0, 0, commandKey(command)]
         : [4, -nearest, -cover, commandKey(command)];
killedBy: player-character AlgorithmController policy ranged_hugs_melee: after shooting at range, moves farther away and stays put rather than provoking when adjacent
statusReason: expected { type: 'end_turn', …(1) } to deeply equal { type: 'move', …(3) }

[Killed] ConditionalExpression
src/combat/controllers.ts:389:14
           destination,
           candidate.position,
         )]));
-      return currentlyAdjacent || nearest <= currentNearest
+      return false
         ? [10, 0, 0, commandKey(command)]
         : [4, -nearest, -cover, commandKey(command)];
killedBy: player-character AlgorithmController policy ranged_hugs_melee: after shooting at range, moves farther away and stays put rather than provoking when adjacent
statusReason: expected { type: 'move', …(3) } to deeply equal { type: 'end_turn', …(1) }

[Killed] UnaryOperator
src/combat/controllers.ts:391:25
         )]));
       return currentlyAdjacent || nearest <= currentNearest
         ? [10, 0, 0, commandKey(command)]
-        : [4, -nearest, -cover, commandKey(command)];
+        : [4, -nearest, +cover, commandKey(command)];
     }
     return [4, nearest, 0, commandKey(command)];
killedBy: player-character AlgorithmController policy policy_ignores_cover: 'Warlock' caster selects reachable cover after 'eldritch-blast'
statusReason: expected { type: 'move', …(3) } to deeply equal { type: 'move', …(3) }

[Killed] UnaryOperator
src/combat/controllers.ts:391:15
         )]));
       return currentlyAdjacent || nearest <= currentNearest
         ? [10, 0, 0, commandKey(command)]
-        : [4, -nearest, -cover, commandKey(command)];
+        : [4, +nearest, -cover, commandKey(command)];
     }
     return [4, nearest, 0, commandKey(command)];
killedBy: controller mutation contract: player-character ranking ignores dead hostiles in retreat distance and prefers the farther of two valid retreats
statusReason: expected { type: 'move', …(3) } to deeply equal { type: 'move', …(3) }

[Killed] ConditionalExpression
src/combat/controllers.ts:395:7
     }
     return [4, nearest, 0, commandKey(command)];
   }
-  if (command.type === 'dash') return [5, 0, 0, commandKey(command)];
+  if (true) return [5, 0, 0, commandKey(command)];
   if (command.type === 'decline_reaction') return [6, 0, 0, commandKey(command)];
   if (command.type === 'end_turn') return [9, 0, 0, commandKey(command)];
killedBy: D382 survival package pins the fixed 30-seed final-encounter survival fraction at or above two thirds
statusReason: expected { successes: 30, total: 30 } to deeply equal { successes: 29, total: 30 }

[Killed] ConditionalExpression
src/combat/controllers.ts:395:7
     }
     return [4, nearest, 0, commandKey(command)];
   }
-  if (command.type === 'dash') return [5, 0, 0, commandKey(command)];
+  if (false) return [5, 0, 0, commandKey(command)];
   if (command.type === 'decline_reaction') return [6, 0, 0, commandKey(command)];
   if (command.type === 'end_turn') return [9, 0, 0, commandKey(command)];
killedBy: D382 survival package pins the fixed 30-seed final-encounter survival fraction at or above two thirds
statusReason: expected { successes: 30, total: 30 } to deeply equal { successes: 29, total: 30 }

[Killed] ConditionalExpression
src/combat/controllers.ts:396:7
     return [4, nearest, 0, commandKey(command)];
   }
   if (command.type === 'dash') return [5, 0, 0, commandKey(command)];
-  if (command.type === 'decline_reaction') return [6, 0, 0, commandKey(command)];
+  if (false) return [6, 0, 0, commandKey(command)];
   if (command.type === 'end_turn') return [9, 0, 0, commandKey(command)];
   return [8, 0, 0, commandKey(command)];
killedBy: controller mutation contract: player-character ranking keeps an adjacent ranged actor in place and ranks decline/end/fallback distinctly
statusReason: expected { type: 'activate_action_surge', …(2) } to be { type: 'decline_reaction', …(2) } // Object.is equality

[Killed] ConditionalExpression
src/combat/controllers.ts:396:7
     return [4, nearest, 0, commandKey(command)];
   }
   if (command.type === 'dash') return [5, 0, 0, commandKey(command)];
-  if (command.type === 'decline_reaction') return [6, 0, 0, commandKey(command)];
+  if (true) return [6, 0, 0, commandKey(command)];
   if (command.type === 'end_turn') return [9, 0, 0, commandKey(command)];
   return [8, 0, 0, commandKey(command)];
killedBy: controller mutation contract: player-character ranking keeps an adjacent ranged actor in place and ranks decline/end/fallback distinctly
statusReason: expected { type: 'activate_action_surge', …(2) } to be { type: 'decline_reaction', …(2) } // Object.is equality

[Killed] EqualityOperator
src/combat/controllers.ts:397:7
   }
   if (command.type === 'dash') return [5, 0, 0, commandKey(command)];
   if (command.type === 'decline_reaction') return [6, 0, 0, commandKey(command)];
-  if (command.type === 'end_turn') return [9, 0, 0, commandKey(command)];
+  if (command.type !== 'end_turn') return [9, 0, 0, commandKey(command)];
   return [8, 0, 0, commandKey(command)];
 }
killedBy: controller mutation contract: player-character ranking keeps an adjacent ranged actor in place and ranks decline/end/fallback distinctly
statusReason: expected { type: 'end_turn', …(1) } to be { type: 'heal', …(4) } // Object.is equality

[Survived] ConditionalExpression
src/combat/controllers.ts:397:7
   }
   if (command.type === 'dash') return [5, 0, 0, commandKey(command)];
   if (command.type === 'decline_reaction') return [6, 0, 0, commandKey(command)];
-  if (command.type === 'end_turn') return [9, 0, 0, commandKey(command)];
+  if (false) return [9, 0, 0, commandKey(command)];
   return [8, 0, 0, commandKey(command)];
 }

[Killed] ArrowFunction
src/combat/controllers.ts:406:5
   command: EncounterCommand,
 ): readonly [number, number, number, string] {
   const actor = request.visibleState.combatants.find(
-    (candidate) => candidate.id === request.actorId,
+    () => undefined,
   );
   if (actor?.kind === 'player_character') {
killedBy: D382 survival package pins the fixed 30-seed final-encounter survival fraction at or above two thirds
statusReason: expected { successes: 30, total: 30 } to deeply equal { successes: 29, total: 30 }

[Killed] ConditionalExpression
src/combat/controllers.ts:406:20
   command: EncounterCommand,
 ): readonly [number, number, number, string] {
   const actor = request.visibleState.combatants.find(
-    (candidate) => candidate.id === request.actorId,
+    (candidate) => false,
   );
   if (actor?.kind === 'player_character') {
killedBy: D382 survival package pins the fixed 30-seed final-encounter survival fraction at or above two thirds
statusReason: expected { successes: 30, total: 30 } to deeply equal { successes: 29, total: 30 }

[Killed] BlockStatement
src/combat/controllers.ts:408:43
   const actor = request.visibleState.combatants.find(
     (candidate) => candidate.id === request.actorId,
   );
-  if (actor?.kind === 'player_character') {
-    return playerCharacterAlgorithmRank(request, command, actor);
-  }
+  if (actor?.kind === 'player_character') {}
   const hostile = (id: CombatantId) => {
     const target = request.visibleState.combatants.find((candidate) => candidate.id === id);
killedBy: D382 survival package moves Brann toward a body-blocking melee position before using his ranged Slow weapon
statusReason: expected 'attack' to be 'move' // Object.is equality

[Killed] BlockStatement
src/combat/controllers.ts:411:40
   if (actor?.kind === 'player_character') {
     return playerCharacterAlgorithmRank(request, command, actor);
   }
-  const hostile = (id: CombatantId) => {
-    const target = request.visibleState.combatants.find((candidate) => candidate.id === id);
-    return actor !== undefined && target !== undefined && actor.kind !== target.kind;
-  };
+  const hostile = (id: CombatantId) => {};
   if (command.type === 'opportunity_attack' && hostile(command.target)) {
     return [0, 0, 0, commandKey(command)];
killedBy: Vane Warren loader, chaining, seats, and end-session export all-algorithm chain concludes Iron Voice and assigns its conditional successor roster
statusReason: Algorithm host published 1,000 times at round 11 after resource_spent.

[Killed] ConditionalExpression
src/combat/controllers.ts:412:72
     return playerCharacterAlgorithmRank(request, command, actor);
   }
   const hostile = (id: CombatantId) => {
-    const target = request.visibleState.combatants.find((candidate) => candidate.id === id);
+    const target = request.visibleState.combatants.find((candidate) => false);
     return actor !== undefined && target !== undefined && actor.kind !== target.kind;
   };
killedBy: Vane Warren loader, chaining, seats, and end-session export all-algorithm chain concludes Iron Voice and assigns its conditional successor roster
statusReason: Algorithm host published 1,000 times at round 11 after resource_spent.

[Killed] ArrowFunction
src/combat/controllers.ts:412:57
     return playerCharacterAlgorithmRank(request, command, actor);
   }
   const hostile = (id: CombatantId) => {
-    const target = request.visibleState.combatants.find((candidate) => candidate.id === id);
+    const target = request.visibleState.combatants.find(() => undefined);
     return actor !== undefined && target !== undefined && actor.kind !== target.kind;
   };
killedBy: Vane Warren loader, chaining, seats, and end-session export all-algorithm chain concludes Iron Voice and assigns its conditional successor roster
statusReason: Algorithm host published 1,000 times at round 11 after resource_spent.

[Killed] ConditionalExpression
src/combat/controllers.ts:413:59
   }
   const hostile = (id: CombatantId) => {
     const target = request.visibleState.combatants.find((candidate) => candidate.id === id);
-    return actor !== undefined && target !== undefined && actor.kind !== target.kind;
+    return actor !== undefined && target !== undefined && true;
   };
   if (command.type === 'opportunity_attack' && hostile(command.target)) {
killedBy: D382 survival package pins the fixed 30-seed final-encounter survival fraction at or above two thirds
statusReason: expected { successes: 30, total: 30 } to deeply equal { successes: 29, total: 30 }

[Killed] ConditionalExpression
src/combat/controllers.ts:413:12
   }
   const hostile = (id: CombatantId) => {
     const target = request.visibleState.combatants.find((candidate) => candidate.id === id);
-    return actor !== undefined && target !== undefined && actor.kind !== target.kind;
+    return false;
   };
   if (command.type === 'opportunity_attack' && hostile(command.target)) {
killedBy: Vane Warren loader, chaining, seats, and end-session export all-algorithm chain concludes Iron Voice and assigns its conditional successor roster
statusReason: Algorithm host published 1,000 times at round 11 after resource_spent.

[Killed] BlockStatement
src/combat/controllers.ts:415:73
     const target = request.visibleState.combatants.find((candidate) => candidate.id === id);
     return actor !== undefined && target !== undefined && actor.kind !== target.kind;
   };
-  if (command.type === 'opportunity_attack' && hostile(command.target)) {
-    return [0, 0, 0, commandKey(command)];
-  }
+  if (command.type === 'opportunity_attack' && hostile(command.target)) {}
   if (command.type === 'attack' && hostile(command.target)) {
     const target = request.visibleState.combatants.find(
killedBy: D382 survival package pins the fixed 30-seed final-encounter survival fraction at or above two thirds
statusReason: expected { successes: 30, total: 30 } to deeply equal { successes: 29, total: 30 }

[Killed] ConditionalExpression
src/combat/controllers.ts:415:7
     const target = request.visibleState.combatants.find((candidate) => candidate.id === id);
     return actor !== undefined && target !== undefined && actor.kind !== target.kind;
   };
-  if (command.type === 'opportunity_attack' && hostile(command.target)) {
+  if (false) {
     return [0, 0, 0, commandKey(command)];
   }
killedBy: D382 survival package pins the fixed 30-seed final-encounter survival fraction at or above two thirds
statusReason: expected { successes: 30, total: 30 } to deeply equal { successes: 29, total: 30 }
