[Killed] BlockStatement
src/combat/controllers.ts:418:61
   if (command.type === 'opportunity_attack' && hostile(command.target)) {
     return [0, 0, 0, commandKey(command)];
   }
-  if (command.type === 'attack' && hostile(command.target)) {
-    const target = request.visibleState.combatants.find(
-      (candidate) => candidate.id === command.target,
-    );
-    const distance =
-      actor === undefined || target === undefined
-        ? Number.POSITIVE_INFINITY
-        : gridDistance(actor.position, target.position);
-    return [1, distance, 0, commandKey(command)];
-  }
+  if (command.type === 'attack' && hostile(command.target)) {}
   if (command.type === 'move') {
     const destination = command.path.at(-1) ?? actor?.position;
killedBy: controller mutation contract: monster ranking prefers the nearest hostile attack, then a move toward the nearest hostile
statusReason: expected { type: 'attack', …(9) } to be { type: 'attack', …(9) } // Object.is equality

[Killed] EqualityOperator
src/combat/controllers.ts:420:22
   }
   if (command.type === 'attack' && hostile(command.target)) {
     const target = request.visibleState.combatants.find(
-      (candidate) => candidate.id === command.target,
+      (candidate) => candidate.id !== command.target,
     );
     const distance =
killedBy: controller mutation contract: monster ranking prefers the nearest hostile attack, then a move toward the nearest hostile
statusReason: expected { type: 'attack', …(9) } to be { type: 'attack', …(9) } // Object.is equality

[Killed] ConditionalExpression
src/combat/controllers.ts:420:22
   }
   if (command.type === 'attack' && hostile(command.target)) {
     const target = request.visibleState.combatants.find(
-      (candidate) => candidate.id === command.target,
+      (candidate) => false,
     );
     const distance =
killedBy: controller mutation contract: monster ranking prefers the nearest hostile attack, then a move toward the nearest hostile
statusReason: expected { type: 'attack', …(9) } to be { type: 'attack', …(9) } // Object.is equality

[Killed] BlockStatement
src/combat/controllers.ts:428:32
         : gridDistance(actor.position, target.position);
     return [1, distance, 0, commandKey(command)];
   }
-  if (command.type === 'move') {
-    const destination = command.path.at(-1) ?? actor?.position;
-    const nearest = destination === undefined
-      ? Number.POSITIVE_INFINITY
-      : Math.min(
-          ...request.visibleState.combatants
-            .filter((candidate) => hostile(candidate.id))
-            .map((candidate) => gridDistance(destination, candidate.position)),
-        );
-    return [2, nearest, 0, commandKey(command)];
-  }
+  if (command.type === 'move') {}
   if (command.type === 'decline_reaction') return [3, 0, 0, commandKey(command)];
   if (command.type === 'end_turn') return [5, 0, 0, commandKey(command)];
killedBy: player-character AlgorithmController policy room-1-terminates: four algorithm PCs versus the bundled pack reaches an end state within 4 rounds
statusReason: The turn cannot advance while a Reaction offer for this boundary is unresolved.

[Killed] UnaryOperator
src/combat/controllers.ts:429:41
     return [1, distance, 0, commandKey(command)];
   }
   if (command.type === 'move') {
-    const destination = command.path.at(-1) ?? actor?.position;
+    const destination = command.path.at(+1) ?? actor?.position;
     const nearest = destination === undefined
       ? Number.POSITIVE_INFINITY
killedBy: player-character AlgorithmController policy room-1-terminates: four algorithm PCs versus the bundled pack reaches an end state within 4 rounds
statusReason: The turn cannot advance while a Reaction offer for this boundary is unresolved.

[Killed] LogicalOperator
src/combat/controllers.ts:429:25
     return [1, distance, 0, commandKey(command)];
   }
   if (command.type === 'move') {
-    const destination = command.path.at(-1) ?? actor?.position;
+    const destination = command.path.at(-1) && actor?.position;
     const nearest = destination === undefined
       ? Number.POSITIVE_INFINITY
killedBy: player-character AlgorithmController policy room-1-terminates: four algorithm PCs versus the bundled pack reaches an end state within 4 rounds
statusReason: The turn cannot advance while a Reaction offer for this boundary is unresolved.

[Killed] MethodExpression
src/combat/controllers.ts:432:9
     const destination = command.path.at(-1) ?? actor?.position;
     const nearest = destination === undefined
       ? Number.POSITIVE_INFINITY
-      : Math.min(
-          ...request.visibleState.combatants
-            .filter((candidate) => hostile(candidate.id))
-            .map((candidate) => gridDistance(destination, candidate.position)),
-        );
+      : Math.max(...request.visibleState.combatants.filter(candidate => hostile(candidate.id)).map(candidate => gridDistance(destination, candidate.position)));
     return [2, nearest, 0, commandKey(command)];
   }
killedBy: D382 survival package pins the fixed 30-seed final-encounter survival fraction at or above two thirds
statusReason: expected { successes: 30, total: 30 } to deeply equal { successes: 29, total: 30 }

[Killed] MethodExpression
src/combat/controllers.ts:433:14
     const nearest = destination === undefined
       ? Number.POSITIVE_INFINITY
       : Math.min(
-          ...request.visibleState.combatants
-            .filter((candidate) => hostile(candidate.id))
+          ...request.visibleState.combatants
             .map((candidate) => gridDistance(destination, candidate.position)),
         );
killedBy: D382 survival package pins the fixed 30-seed final-encounter survival fraction at or above two thirds
statusReason: expected { successes: 30, total: 30 } to deeply equal { successes: 29, total: 30 }

[Killed] ArrowFunction
src/combat/controllers.ts:434:21
       ? Number.POSITIVE_INFINITY
       : Math.min(
           ...request.visibleState.combatants
-            .filter((candidate) => hostile(candidate.id))
+            .filter(() => undefined)
             .map((candidate) => gridDistance(destination, candidate.position)),
         );
killedBy: D382 survival package pins the fixed 30-seed final-encounter survival fraction at or above two thirds
statusReason: expected { successes: 30, total: 30 } to deeply equal { successes: 29, total: 30 }

[Killed] ConditionalExpression
src/combat/controllers.ts:439:7
         );
     return [2, nearest, 0, commandKey(command)];
   }
-  if (command.type === 'decline_reaction') return [3, 0, 0, commandKey(command)];
+  if (true) return [3, 0, 0, commandKey(command)];
   if (command.type === 'end_turn') return [5, 0, 0, commandKey(command)];
   return [4, 0, 0, commandKey(command)];
killedBy: controller mutation contract: monster ranking ranks decline, fallback, and end-turn in their exact order
statusReason: expected { type: 'activate_action_surge', …(2) } to be { type: 'decline_reaction', …(2) } // Object.is equality

[Killed] ConditionalExpression
src/combat/controllers.ts:439:7
         );
     return [2, nearest, 0, commandKey(command)];
   }
-  if (command.type === 'decline_reaction') return [3, 0, 0, commandKey(command)];
+  if (false) return [3, 0, 0, commandKey(command)];
   if (command.type === 'end_turn') return [5, 0, 0, commandKey(command)];
   return [4, 0, 0, commandKey(command)];
killedBy: controller mutation contract: monster ranking ranks decline, fallback, and end-turn in their exact order
statusReason: expected { type: 'activate_action_surge', …(2) } to be { type: 'decline_reaction', …(2) } // Object.is equality

[Killed] EqualityOperator
src/combat/controllers.ts:440:7
     return [2, nearest, 0, commandKey(command)];
   }
   if (command.type === 'decline_reaction') return [3, 0, 0, commandKey(command)];
-  if (command.type === 'end_turn') return [5, 0, 0, commandKey(command)];
+  if (command.type !== 'end_turn') return [5, 0, 0, commandKey(command)];
   return [4, 0, 0, commandKey(command)];
 }
killedBy: D382 survival package pins the fixed 30-seed final-encounter survival fraction at or above two thirds
statusReason: expected { successes: 28, total: 30 } to deeply equal { successes: 29, total: 30 }

[Survived] ConditionalExpression
src/combat/controllers.ts:440:7
     return [2, nearest, 0, commandKey(command)];
   }
   if (command.type === 'decline_reaction') return [3, 0, 0, commandKey(command)];
-  if (command.type === 'end_turn') return [5, 0, 0, commandKey(command)];
+  if (false) return [5, 0, 0, commandKey(command)];
   return [4, 0, 0, commandKey(command)];
 }

[Killed] BooleanLiteral
src/combat/controllers.ts:458:9
     playerLimit = 64,
   ): readonly AlgorithmTurnCandidate[] {
     const limit = typeof limitOrLegalActions === 'number' ? limitOrLegalActions : playerLimit;
-    if (!Number.isSafeInteger(limit) || limit < 1) {
+    if (Number.isSafeInteger(limit) || limit < 1) {
       throw new RangeError('Algorithm turn candidate limit must be a positive integer.');
     }
killedBy: player-character AlgorithmController policy pc_always_ends_turn + attacks_allies: a bow PC attacks a hostile at range instead of dashing or attacking an ally
statusReason: Algorithm turn candidate limit must be a positive integer.

[Killed] ConditionalExpression
src/combat/controllers.ts:458:9
     playerLimit = 64,
   ): readonly AlgorithmTurnCandidate[] {
     const limit = typeof limitOrLegalActions === 'number' ? limitOrLegalActions : playerLimit;
-    if (!Number.isSafeInteger(limit) || limit < 1) {
+    if (false) {
       throw new RangeError('Algorithm turn candidate limit must be a positive integer.');
     }
killedBy: controller mutation contract: turn-program enumeration rejects invalid candidate limit 0 with the exact contract error
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/combat/controllers.ts:461:56
     if (!Number.isSafeInteger(limit) || limit < 1) {
       throw new RangeError('Algorithm turn candidate limit must be a positive integer.');
     }
-    const actor = state.combatants.find((candidate) => candidate.id === actorId);
+    const actor = state.combatants.find((candidate) => false);
     if (actor === undefined || actor.life !== 'living') {
       throw new TypeError('Algorithm turn candidates require a living combatant in the DM projection.');
killedBy: player-character AlgorithmController policy pc_always_ends_turn + attacks_allies: a bow PC attacks a hostile at range instead of dashing or attacking an ally
statusReason: Algorithm turn candidates require a living combatant in the DM projection.

[Killed] EqualityOperator
src/combat/controllers.ts:461:56
     if (!Number.isSafeInteger(limit) || limit < 1) {
       throw new RangeError('Algorithm turn candidate limit must be a positive integer.');
     }
-    const actor = state.combatants.find((candidate) => candidate.id === actorId);
+    const actor = state.combatants.find((candidate) => candidate.id !== actorId);
     if (actor === undefined || actor.life !== 'living') {
       throw new TypeError('Algorithm turn candidates require a living combatant in the DM projection.');
killedBy: player-character AlgorithmController policy keeps the monster candidate enumeration and ranking unchanged
statusReason: expected [ …(5) ] to deeply equal [ …(5) ]

[Killed] EqualityOperator
src/combat/controllers.ts:462:32
       throw new RangeError('Algorithm turn candidate limit must be a positive integer.');
     }
     const actor = state.combatants.find((candidate) => candidate.id === actorId);
-    if (actor === undefined || actor.life !== 'living') {
+    if (actor === undefined || actor.life === 'living') {
       throw new TypeError('Algorithm turn candidates require a living combatant in the DM projection.');
     }
killedBy: player-character AlgorithmController policy pc_always_ends_turn + attacks_allies: a bow PC attacks a hostile at range instead of dashing or attacking an ally
statusReason: Algorithm turn candidates require a living combatant in the DM projection.

[Killed] ConditionalExpression
src/combat/controllers.ts:462:32
       throw new RangeError('Algorithm turn candidate limit must be a positive integer.');
     }
     const actor = state.combatants.find((candidate) => candidate.id === actorId);
-    if (actor === undefined || actor.life !== 'living') {
+    if (actor === undefined || false) {
       throw new TypeError('Algorithm turn candidates require a living combatant in the DM projection.');
     }
killedBy: controller mutation contract: turn-program enumeration rejects missing and non-living actors with the exact contract error
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/combat/controllers.ts:463:27
     }
     const actor = state.combatants.find((candidate) => candidate.id === actorId);
     if (actor === undefined || actor.life !== 'living') {
-      throw new TypeError('Algorithm turn candidates require a living combatant in the DM projection.');
+      throw new TypeError("");
     }
     const enemies = state.combatants
killedBy: controller mutation contract: turn-program enumeration rejects missing and non-living actors with the exact contract error
statusReason: expected [Function] to throw error including 'Algorithm turn candidates require a l…' but got ''

[Killed] MethodExpression
src/combat/controllers.ts:465:21
     if (actor === undefined || actor.life !== 'living') {
       throw new TypeError('Algorithm turn candidates require a living combatant in the DM projection.');
     }
-    const enemies = state.combatants
-      .filter((candidate) => candidate.kind !== actor.kind && candidate.life !== 'dead')
-      .sort((left, right) => {
-        const distance = gridDistance(actor.position, left.position) - gridDistance(actor.position, right.position);
-        return distance || left.id.localeCompare(right.id);
-      });
+    const enemies = state.combatants.filter(candidate => candidate.kind !== actor.kind && candidate.life !== 'dead');
     const nearest = enemies[0];
     const candidates: { readonly program: DecisionProgram; readonly score: number }[] = [];
killedBy: controller mutation contract: turn-program enumeration enumerates the complete scored PC primitive set and honors a numeric limit
statusReason: expected [ …(7) ] to deeply equal [ …(7) ]

[Killed] EqualityOperator
src/combat/controllers.ts:466:63
       throw new TypeError('Algorithm turn candidates require a living combatant in the DM projection.');
     }
     const enemies = state.combatants
-      .filter((candidate) => candidate.kind !== actor.kind && candidate.life !== 'dead')
+      .filter((candidate) => candidate.kind !== actor.kind && candidate.life === 'dead')
       .sort((left, right) => {
         const distance = gridDistance(actor.position, left.position) - gridDistance(actor.position, right.position);
killedBy: player-character AlgorithmController policy pc_always_ends_turn + attacks_allies: a bow PC attacks a hostile at range instead of dashing or attacking an ally
statusReason: expected { kind: 'action', action: { …(2) } } to deeply equal { kind: 'action', action: { …(3) } }

[Killed] LogicalOperator
src/combat/controllers.ts:466:30
       throw new TypeError('Algorithm turn candidates require a living combatant in the DM projection.');
     }
     const enemies = state.combatants
-      .filter((candidate) => candidate.kind !== actor.kind && candidate.life !== 'dead')
+      .filter((candidate) => candidate.kind !== actor.kind || candidate.life !== 'dead')
       .sort((left, right) => {
         const distance = gridDistance(actor.position, left.position) - gridDistance(actor.position, right.position);
killedBy: player-character AlgorithmController policy pc_always_ends_turn + attacks_allies: a bow PC attacks a hostile at range instead of dashing or attacking an ally
statusReason: expected { kind: 'action', action: { …(3) } } to deeply equal { kind: 'action', action: { …(3) } }

[Killed] ArithmeticOperator
src/combat/controllers.ts:468:26
     const enemies = state.combatants
       .filter((candidate) => candidate.kind !== actor.kind && candidate.life !== 'dead')
       .sort((left, right) => {
-        const distance = gridDistance(actor.position, left.position) - gridDistance(actor.position, right.position);
+        const distance = gridDistance(actor.position, left.position) + gridDistance(actor.position, right.position);
         return distance || left.id.localeCompare(right.id);
       });
killedBy: controller mutation contract: turn-program enumeration enumerates the complete scored PC primitive set and honors a numeric limit
statusReason: expected [ …(7) ] to deeply equal [ …(7) ]

[Killed] LogicalOperator
src/combat/controllers.ts:469:16
       .filter((candidate) => candidate.kind !== actor.kind && candidate.life !== 'dead')
       .sort((left, right) => {
         const distance = gridDistance(actor.position, left.position) - gridDistance(actor.position, right.position);
-        return distance || left.id.localeCompare(right.id);
+        return distance && left.id.localeCompare(right.id);
       });
     const nearest = enemies[0];
killedBy: controller mutation contract: turn-program enumeration enumerates the complete scored PC primitive set and honors a numeric limit
statusReason: expected [ …(7) ] to deeply equal [ …(7) ]

[Killed] EqualityOperator
src/combat/controllers.ts:473:9
       });
     const nearest = enemies[0];
     const candidates: { readonly program: DecisionProgram; readonly score: number }[] = [];
-    if (actor.kind === 'player_character') {
+    if (actor.kind !== 'player_character') {
       const legalActions = typeof limitOrLegalActions === 'number'
         ? null
killedBy: player-character AlgorithmController policy pc_always_ends_turn + attacks_allies: a bow PC attacks a hostile at range instead of dashing or attacking an ally
statusReason: expected { kind: 'action', action: { …(2) } } to deeply equal { kind: 'action', action: { …(3) } }

[Killed] BlockStatement
src/combat/controllers.ts:478:38
         ? null
         : limitOrLegalActions.actions;
       if (legalActions === null) {
-        for (const enemy of enemies) {
-          candidates.push({
-            program: {
-              kind: 'action',
-              action: { kind: 'attack', target: { kind: 'combatant', combatantId: enemy.id } },
-            },
-            score: 1_000 - enemy.hitPoints,
-          });
-          candidates.push({
-            program: {
-              kind: 'action',
-              action: { kind: 'force_save', target: { kind: 'combatant', combatantId: enemy.id } },
-            },
-            score: 990 - enemy.hitPoints,
-          });
-        }
+        for (const enemy of enemies) {}
         if (nearest !== undefined) {
           candidates.push({
killedBy: controller mutation contract: turn-program enumeration enumerates the complete scored PC primitive set and honors a numeric limit
statusReason: expected [ …(3) ] to deeply equal [ …(7) ]

[Killed] ArithmeticOperator
src/combat/controllers.ts:484:20
               kind: 'action',
               action: { kind: 'attack', target: { kind: 'combatant', combatantId: enemy.id } },
             },
-            score: 1_000 - enemy.hitPoints,
+            score: 1_000 + enemy.hitPoints,
           });
           candidates.push({
killedBy: controller mutation contract: turn-program enumeration enumerates the complete scored PC primitive set and honors a numeric limit
statusReason: expected [ …(7) ] to deeply equal [ …(7) ]

[Killed] ArithmeticOperator
src/combat/controllers.ts:491:20
               kind: 'action',
               action: { kind: 'force_save', target: { kind: 'combatant', combatantId: enemy.id } },
             },
-            score: 990 - enemy.hitPoints,
+            score: 990 + enemy.hitPoints,
           });
         }
killedBy: controller mutation contract: turn-program enumeration enumerates the complete scored PC primitive set and honors a numeric limit
statusReason: expected [ …(7) ] to deeply equal [ …(7) ]

[Killed] BlockStatement
src/combat/controllers.ts:494:36
             score: 990 - enemy.hitPoints,
           });
         }
-        if (nearest !== undefined) {
-          candidates.push({
-            program: {
-              kind: 'action',
-              action: { kind: 'move_toward', target: { kind: 'combatant', combatantId: nearest.id } },
-            },
-            score: 50,
-          });
-        }
+        if (nearest !== undefined) {}
         candidates.push({
           program: { kind: 'action', action: { kind: 'use_action', action: 'dash' } },
killedBy: controller mutation contract: turn-program enumeration enumerates the complete scored PC primitive set and honors a numeric limit
statusReason: expected [ …(6) ] to deeply equal [ …(7) ]

[Killed] BlockStatement
src/combat/controllers.ts:509:42
         });
       } else {
         for (const command of legalActions) {
-          if (command.type === 'attack') {
-            const target = enemies.find((enemy) => enemy.id === command.target);
-            if (target === undefined) continue;
-            candidates.push({
-              program: {
-                kind: 'action',
-                action: {
-                  kind: 'attack',
-                  target: { kind: 'combatant', combatantId: target.id },
-                  ...(command.attackId === undefined ? {} : { attackId: command.attackId }),
-                },
-              },
-              score: 1_000 - target.hitPoints,
-            });
-          } else if (command.type === 'force_save') {
+          if (command.type === 'attack') {} else if (command.type === 'force_save') {
             const target = enemies.find((enemy) => enemy.id === command.target);
             if (target === undefined) continue;
killedBy: player-character AlgorithmController policy pc_always_ends_turn + attacks_allies: a bow PC attacks a hostile at range instead of dashing or attacking an ally
statusReason: expected { kind: 'action', action: { …(2) } } to deeply equal { kind: 'action', action: { …(3) } }

[Killed] EqualityOperator
src/combat/controllers.ts:510:52
       } else {
         for (const command of legalActions) {
           if (command.type === 'attack') {
-            const target = enemies.find((enemy) => enemy.id === command.target);
+            const target = enemies.find((enemy) => enemy.id !== command.target);
             if (target === undefined) continue;
             candidates.push({
killedBy: controller mutation contract: turn-program enumeration derives only hostile programs from legal PC actions and preserves attack ids
statusReason: expected [ …(6) ] to deeply equal [ …(6) ]

[Killed] ArrowFunction
src/combat/controllers.ts:510:41
       } else {
         for (const command of legalActions) {
           if (command.type === 'attack') {
-            const target = enemies.find((enemy) => enemy.id === command.target);
+            const target = enemies.find(() => undefined);
             if (target === undefined) continue;
             candidates.push({
killedBy: player-character AlgorithmController policy pc_always_ends_turn + attacks_allies: a bow PC attacks a hostile at range instead of dashing or attacking an ally
statusReason: expected { kind: 'action', action: { …(2) } } to deeply equal { kind: 'action', action: { …(3) } }

[Killed] EqualityOperator
src/combat/controllers.ts:518:23
                 action: {
                   kind: 'attack',
                   target: { kind: 'combatant', combatantId: target.id },
-                  ...(command.attackId === undefined ? {} : { attackId: command.attackId }),
+                  ...(command.attackId !== undefined ? {} : { attackId: command.attackId }),
                 },
               },
killedBy: player-character AlgorithmController policy pc_always_ends_turn + attacks_allies: a bow PC attacks a hostile at range instead of dashing or attacking an ally
statusReason: expected { kind: 'action', action: { …(2) } } to deeply equal { kind: 'action', action: { …(3) } }

[Killed] ConditionalExpression
src/combat/controllers.ts:518:23
                 action: {
                   kind: 'attack',
                   target: { kind: 'combatant', combatantId: target.id },
-                  ...(command.attackId === undefined ? {} : { attackId: command.attackId }),
+                  ...(false ? {} : { attackId: command.attackId }),
                 },
               },
killedBy: controller mutation contract: turn-program enumeration omits an absent attack id and adds neither move nor dash without matching legal commands
statusReason: Value is not JSON serializable: [object Undefined].

[Killed] ArithmeticOperator
src/combat/controllers.ts:521:22
                   ...(command.attackId === undefined ? {} : { attackId: command.attackId }),
                 },
               },
-              score: 1_000 - target.hitPoints,
+              score: 1_000 + target.hitPoints,
             });
           } else if (command.type === 'force_save') {
killedBy: controller mutation contract: turn-program enumeration derives only hostile programs from legal PC actions and preserves attack ids
statusReason: expected [ …(6) ] to deeply equal [ …(6) ]

[Killed] BlockStatement
src/combat/controllers.ts:523:53
               },
               score: 1_000 - target.hitPoints,
             });
-          } else if (command.type === 'force_save') {
-            const target = enemies.find((enemy) => enemy.id === command.target);
-            if (target === undefined) continue;
-            candidates.push({
-              program: {
-                kind: 'action',
-                action: { kind: 'force_save', target: { kind: 'combatant', combatantId: target.id } },
-              },
-              score: 990 - target.hitPoints,
-            });
-          } else if (command.type === 'cast_spell') {
+          } else if (command.type === 'force_save') {} else if (command.type === 'cast_spell') {
             for (const targetId of new Set(command.targets)) {
               const target = enemies.find((enemy) => enemy.id === targetId);
killedBy: controller mutation contract: turn-program enumeration derives only hostile programs from legal PC actions and preserves attack ids
statusReason: expected [ …(5) ] to deeply equal [ …(6) ]

[Killed] ConditionalExpression
src/combat/controllers.ts:524:52
               score: 1_000 - target.hitPoints,
             });
           } else if (command.type === 'force_save') {
-            const target = enemies.find((enemy) => enemy.id === command.target);
+            const target = enemies.find((enemy) => false);
             if (target === undefined) continue;
             candidates.push({
killedBy: controller mutation contract: turn-program enumeration derives only hostile programs from legal PC actions and preserves attack ids
statusReason: expected [ …(5) ] to deeply equal [ …(6) ]

[Killed] ArrowFunction
src/combat/controllers.ts:524:41
               score: 1_000 - target.hitPoints,
             });
           } else if (command.type === 'force_save') {
-            const target = enemies.find((enemy) => enemy.id === command.target);
+            const target = enemies.find(() => undefined);
             if (target === undefined) continue;
             candidates.push({
killedBy: controller mutation contract: turn-program enumeration derives only hostile programs from legal PC actions and preserves attack ids
statusReason: expected [ …(5) ] to deeply equal [ …(6) ]

[Killed] ArithmeticOperator
src/combat/controllers.ts:531:22
                 kind: 'action',
                 action: { kind: 'force_save', target: { kind: 'combatant', combatantId: target.id } },
               },
-              score: 990 - target.hitPoints,
+              score: 990 + target.hitPoints,
             });
           } else if (command.type === 'cast_spell') {
killedBy: controller mutation contract: turn-program enumeration derives only hostile programs from legal PC actions and preserves attack ids
statusReason: expected [ …(6) ] to deeply equal [ …(6) ]

[Killed] BlockStatement
src/combat/controllers.ts:533:53
               },
               score: 990 - target.hitPoints,
             });
-          } else if (command.type === 'cast_spell') {
-            for (const targetId of new Set(command.targets)) {
-              const target = enemies.find((enemy) => enemy.id === targetId);
-              if (target === undefined) continue;
-              candidates.push({
-                program: {
-                  kind: 'action',
-                  action: {
-                    kind: 'cast_spell',
-                    spellId: command.spellId,
-                    target: { kind: 'combatant', combatantId: target.id },
-                  },
-                },
-                score: 1_100 - target.hitPoints,
-              });
-            }
-          }
+          } else if (command.type === 'cast_spell') {}
         }
         if (
killedBy: controller mutation contract: turn-program enumeration derives only hostile programs from legal PC actions and preserves attack ids
statusReason: expected [ …(5) ] to deeply equal [ …(6) ]
