[Killed] BlockStatement
src/combat/controllers.ts:534:62
               score: 990 - target.hitPoints,
             });
           } else if (command.type === 'cast_spell') {
-            for (const targetId of new Set(command.targets)) {
-              const target = enemies.find((enemy) => enemy.id === targetId);
-              if (target === undefined) continue;
-              candidates.push({
-                program: {
-                  kind: 'action',
-                  action: {
-                    kind: 'cast_spell',
-                    spellId: command.spellId,
-                    target: { kind: 'combatant', combatantId: target.id },
-                  },
-                },
-                score: 1_100 - target.hitPoints,
-              });
-            }
+            for (const targetId of new Set(command.targets)) {}
           }
         }
killedBy: controller mutation contract: turn-program enumeration derives only hostile programs from legal PC actions and preserves attack ids
statusReason: expected [ …(5) ] to deeply equal [ …(6) ]

[Killed] EqualityOperator
src/combat/controllers.ts:535:54
             });
           } else if (command.type === 'cast_spell') {
             for (const targetId of new Set(command.targets)) {
-              const target = enemies.find((enemy) => enemy.id === targetId);
+              const target = enemies.find((enemy) => enemy.id !== targetId);
               if (target === undefined) continue;
               candidates.push({
killedBy: controller mutation contract: turn-program enumeration uses the specifically targeted hostile when a different enemy is first
statusReason: expected [ { kind: 'action', …(1) }, …(2) ] to deeply equal [ { kind: 'action', …(1) }, …(2) ]

[Killed] ArrowFunction
src/combat/controllers.ts:535:43
             });
           } else if (command.type === 'cast_spell') {
             for (const targetId of new Set(command.targets)) {
-              const target = enemies.find((enemy) => enemy.id === targetId);
+              const target = enemies.find(() => undefined);
               if (target === undefined) continue;
               candidates.push({
killedBy: controller mutation contract: turn-program enumeration derives only hostile programs from legal PC actions and preserves attack ids
statusReason: expected [ …(5) ] to deeply equal [ …(6) ]

[Killed] ArithmeticOperator
src/combat/controllers.ts:546:24
                     target: { kind: 'combatant', combatantId: target.id },
                   },
                 },
-                score: 1_100 - target.hitPoints,
+                score: 1_100 + target.hitPoints,
               });
             }
killedBy: controller mutation contract: turn-program enumeration derives only hostile programs from legal PC actions and preserves attack ids
statusReason: expected [ …(6) ] to deeply equal [ …(6) ]

[Killed] EqualityOperator
src/combat/controllers.ts:553:42
         }
         if (
           nearest !== undefined &&
-          legalActions.some((command) => command.type === 'move')
+          legalActions.some((command) => command.type !== 'move')
         ) {
           candidates.push({
killedBy: controller mutation contract: turn-program enumeration uses the specifically targeted hostile when a different enemy is first
statusReason: expected [ { kind: 'action', …(1) }, …(3) ] to deeply equal [ { kind: 'action', …(1) }, …(2) ]

[Killed] ArrowFunction
src/combat/controllers.ts:553:29
         }
         if (
           nearest !== undefined &&
-          legalActions.some((command) => command.type === 'move')
+          legalActions.some(() => undefined)
         ) {
           candidates.push({
killedBy: controller mutation contract: turn-program enumeration derives only hostile programs from legal PC actions and preserves attack ids
statusReason: expected [ …(5) ] to deeply equal [ …(6) ]

[Killed] BlockStatement
src/combat/controllers.ts:554:11
         if (
           nearest !== undefined &&
           legalActions.some((command) => command.type === 'move')
-        ) {
-          candidates.push({
-            program: {
-              kind: 'action',
-              action: { kind: 'move_toward', target: { kind: 'combatant', combatantId: nearest.id } },
-            },
-            score: 50,
-          });
-        }
+        ) {}
         if (legalActions.some((command) => command.type === 'dash')) {
           candidates.push({
killedBy: controller mutation contract: turn-program enumeration derives only hostile programs from legal PC actions and preserves attack ids
statusReason: expected [ …(5) ] to deeply equal [ …(6) ]

[Killed] ConditionalExpression
src/combat/controllers.ts:563:44
             score: 50,
           });
         }
-        if (legalActions.some((command) => command.type === 'dash')) {
+        if (legalActions.some((command) => true)) {
           candidates.push({
             program: { kind: 'action', action: { kind: 'use_action', action: 'dash' } },
killedBy: controller mutation contract: turn-program enumeration uses the specifically targeted hostile when a different enemy is first
statusReason: expected [ { kind: 'action', …(1) }, …(3) ] to deeply equal [ { kind: 'action', …(1) }, …(2) ]

[Killed] ConditionalExpression
src/combat/controllers.ts:563:44
             score: 50,
           });
         }
-        if (legalActions.some((command) => command.type === 'dash')) {
+        if (legalActions.some((command) => false)) {
           candidates.push({
             program: { kind: 'action', action: { kind: 'use_action', action: 'dash' } },
killedBy: controller mutation contract: turn-program enumeration derives only hostile programs from legal PC actions and preserves attack ids
statusReason: expected [ …(5) ] to deeply equal [ …(6) ]

[Killed] BlockStatement
src/combat/controllers.ts:575:43
         score: 0,
       });
       const byProgram = new Map<string, AlgorithmTurnCandidate>();
-      for (const candidate of candidates) {
-        const stableSortKey = canonicalJson(candidate.program);
-        const existing = byProgram.get(stableSortKey);
-        if (existing === undefined || candidate.score > existing.score) {
-          byProgram.set(stableSortKey, { ...candidate, stableSortKey });
-        }
-      }
+      for (const candidate of candidates) {}
       return [...byProgram.values()]
         .sort((left, right) =>
killedBy: player-character AlgorithmController policy pc_always_ends_turn + attacks_allies: a bow PC attacks a hostile at range instead of dashing or attacking an ally
statusReason: expected undefined to deeply equal { kind: 'action', action: { …(3) } }

[Killed] BlockStatement
src/combat/controllers.ts:578:73
       for (const candidate of candidates) {
         const stableSortKey = canonicalJson(candidate.program);
         const existing = byProgram.get(stableSortKey);
-        if (existing === undefined || candidate.score > existing.score) {
-          byProgram.set(stableSortKey, { ...candidate, stableSortKey });
-        }
+        if (existing === undefined || candidate.score > existing.score) {}
       }
       return [...byProgram.values()]
killedBy: player-character AlgorithmController policy pc_always_ends_turn + attacks_allies: a bow PC attacks a hostile at range instead of dashing or attacking an ally
statusReason: expected undefined to deeply equal { kind: 'action', action: { …(3) } }

[Killed] ConditionalExpression
src/combat/controllers.ts:578:13
       for (const candidate of candidates) {
         const stableSortKey = canonicalJson(candidate.program);
         const existing = byProgram.get(stableSortKey);
-        if (existing === undefined || candidate.score > existing.score) {
+        if (false) {
           byProgram.set(stableSortKey, { ...candidate, stableSortKey });
         }
killedBy: player-character AlgorithmController policy pc_always_ends_turn + attacks_allies: a bow PC attacks a hostile at range instead of dashing or attacking an ally
statusReason: expected undefined to deeply equal { kind: 'action', action: { …(3) } }

[Killed] MethodExpression
src/combat/controllers.ts:582:14
           byProgram.set(stableSortKey, { ...candidate, stableSortKey });
         }
       }
-      return [...byProgram.values()]
-        .sort((left, right) =>
-          right.score - left.score || left.stableSortKey.localeCompare(right.stableSortKey))
-        .slice(0, limit);
+      return [...byProgram.values()].sort((left, right) => right.score - left.score || left.stableSortKey.localeCompare(right.stableSortKey));
     }
     for (const enemy of enemies) {
killedBy: controller mutation contract: turn-program enumeration enumerates the complete scored PC primitive set and honors a numeric limit
statusReason: expected [ { program: { …(2) }, …(2) }, …(6) ] to deeply equal [ { program: { …(2) }, …(2) }, …(1) ]

[Killed] MethodExpression
src/combat/controllers.ts:582:14
           byProgram.set(stableSortKey, { ...candidate, stableSortKey });
         }
       }
-      return [...byProgram.values()]
-        .sort((left, right) =>
-          right.score - left.score || left.stableSortKey.localeCompare(right.stableSortKey))
+      return [...byProgram.values()]
         .slice(0, limit);
     }
killedBy: controller mutation contract: turn-program enumeration enumerates the complete scored PC primitive set and honors a numeric limit
statusReason: expected [ …(7) ] to deeply equal [ …(7) ]

[Killed] ArithmeticOperator
src/combat/controllers.ts:584:11
       }
       return [...byProgram.values()]
         .sort((left, right) =>
-          right.score - left.score || left.stableSortKey.localeCompare(right.stableSortKey))
+          right.score + left.score || left.stableSortKey.localeCompare(right.stableSortKey))
         .slice(0, limit);
     }
killedBy: controller mutation contract: turn-program enumeration enumerates the complete scored PC primitive set and honors a numeric limit
statusReason: expected [ …(7) ] to deeply equal [ …(7) ]

[Killed] LogicalOperator
src/combat/controllers.ts:584:11
       }
       return [...byProgram.values()]
         .sort((left, right) =>
-          right.score - left.score || left.stableSortKey.localeCompare(right.stableSortKey))
+          right.score - left.score && left.stableSortKey.localeCompare(right.stableSortKey))
         .slice(0, limit);
     }
killedBy: player-character AlgorithmController policy pc_always_ends_turn + attacks_allies: a bow PC attacks a hostile at range instead of dashing or attacking an ally
statusReason: expected { kind: 'action', action: { …(2) } } to deeply equal { kind: 'action', action: { …(3) } }

[Killed] BlockStatement
src/combat/controllers.ts:587:34
           right.score - left.score || left.stableSortKey.localeCompare(right.stableSortKey))
         .slice(0, limit);
     }
-    for (const enemy of enemies) {
-      const distance = gridDistance(actor.position, enemy.position);
-      candidates.push({
-        program: {
-          kind: 'action',
-          action: { kind: 'attack', target: { kind: 'combatant', combatantId: enemy.id } },
-        },
-        score: 100 - distance,
-      });
-      candidates.push({
-        program: {
-          kind: 'action',
-          action: { kind: 'force_save', target: { kind: 'combatant', combatantId: enemy.id } },
-        },
-        score: 96 - distance,
-      });
-    }
+    for (const enemy of enemies) {}
     if (nearest !== undefined) {
       candidates.push({
killedBy: player-character AlgorithmController policy keeps the monster candidate enumeration and ranking unchanged
statusReason: expected [ …(3) ] to deeply equal [ …(5) ]

[Killed] ArithmeticOperator
src/combat/controllers.ts:594:16
           kind: 'action',
           action: { kind: 'attack', target: { kind: 'combatant', combatantId: enemy.id } },
         },
-        score: 100 - distance,
+        score: 100 + distance,
       });
       candidates.push({
killedBy: player-character AlgorithmController policy keeps the monster candidate enumeration and ranking unchanged
statusReason: expected [ …(5) ] to deeply equal [ …(5) ]

[Killed] ArithmeticOperator
src/combat/controllers.ts:601:16
           kind: 'action',
           action: { kind: 'force_save', target: { kind: 'combatant', combatantId: enemy.id } },
         },
-        score: 96 - distance,
+        score: 96 + distance,
       });
     }
killedBy: player-character AlgorithmController policy keeps the monster candidate enumeration and ranking unchanged
statusReason: expected [ …(5) ] to deeply equal [ …(5) ]

[Killed] BlockStatement
src/combat/controllers.ts:604:32
         score: 96 - distance,
       });
     }
-    if (nearest !== undefined) {
-      candidates.push({
-        program: {
-          kind: 'action',
-          action: { kind: 'move_toward', target: { kind: 'combatant', combatantId: nearest.id } },
-        },
-        score: 50 - gridDistance(actor.position, nearest.position),
-      });
-    }
+    if (nearest !== undefined) {}
     candidates.push(
       { program: { kind: 'action', action: { kind: 'use_action', action: 'dodge' } }, score: 20 },
killedBy: player-character AlgorithmController policy keeps the monster candidate enumeration and ranking unchanged
statusReason: expected [ …(4) ] to deeply equal [ …(5) ]

[Killed] ArithmeticOperator
src/combat/controllers.ts:610:16
           kind: 'action',
           action: { kind: 'move_toward', target: { kind: 'combatant', combatantId: nearest.id } },
         },
-        score: 50 - gridDistance(actor.position, nearest.position),
+        score: 50 + gridDistance(actor.position, nearest.position),
       });
     }
killedBy: player-character AlgorithmController policy keeps the monster candidate enumeration and ranking unchanged
statusReason: expected [ …(5) ] to deeply equal [ …(5) ]

[Killed] MethodExpression
src/combat/controllers.ts:617:12
       { program: { kind: 'action', action: { kind: 'use_action', action: 'dodge' } }, score: 20 },
       { program: { kind: 'action', action: { kind: 'use_action', action: 'end_turn' } }, score: 0 },
     );
-    return candidates
-      .map((candidate) => ({
-        ...candidate,
-        stableSortKey: canonicalJson(candidate.program),
-      }))
-      .sort((left, right) =>
-        right.score - left.score || left.stableSortKey.localeCompare(right.stableSortKey))
-      .slice(0, limit);
+    return candidates.map(candidate => ({
+  ...candidate,
+  stableSortKey: canonicalJson(candidate.program)
+})).sort((left, right) => right.score - left.score || left.stableSortKey.localeCompare(right.stableSortKey));
   }
 
killedBy: controller mutation contract: turn-program enumeration enumerates, sorts, and limits the complete monster primitive set
statusReason: expected [ { program: { …(2) }, …(2) }, …(6) ] to deeply equal [ { program: { …(2) }, …(2) }, …(2) ]

[Killed] MethodExpression
src/combat/controllers.ts:617:12
       { program: { kind: 'action', action: { kind: 'use_action', action: 'dodge' } }, score: 20 },
       { program: { kind: 'action', action: { kind: 'use_action', action: 'end_turn' } }, score: 0 },
     );
-    return candidates
-      .map((candidate) => ({
-        ...candidate,
-        stableSortKey: canonicalJson(candidate.program),
-      }))
-      .sort((left, right) =>
-        right.score - left.score || left.stableSortKey.localeCompare(right.stableSortKey))
+    return candidates.map(candidate => ({
+  ...candidate,
+  stableSortKey: canonicalJson(candidate.program)
+}))
       .slice(0, limit);
   }
killedBy: controller mutation contract: turn-program enumeration groups equal-distance monster attacks ahead of saves using score then stable key
statusReason: expected [ { kind: 'action', …(1) }, …(3) ] to deeply equal [ { kind: 'action', …(1) }, …(3) ]

[Killed] EqualityOperator
src/combat/controllers.ts:639:28
         kind: 'priority',
         choices: ranked.map((candidate) => candidate.program),
       },
-      topActionGapPercent: top === 0 ? 0 : Math.abs(top - second) * 100 / Math.abs(top),
+      topActionGapPercent: top !== 0 ? 0 : Math.abs(top - second) * 100 / Math.abs(top),
     };
   }
killedBy: controller mutation contract: turn-program enumeration proposes the ranked priority program and exact top-action gap
statusReason: expected +0 to be close to 0.5020080321285141, received difference is 0.5020080321285141, but expected 5e-13

[Killed] ArithmeticOperator
src/combat/controllers.ts:639:44
         kind: 'priority',
         choices: ranked.map((candidate) => candidate.program),
       },
-      topActionGapPercent: top === 0 ? 0 : Math.abs(top - second) * 100 / Math.abs(top),
+      topActionGapPercent: top === 0 ? 0 : Math.abs(top - second) / 100 / Math.abs(top),
     };
   }
killedBy: controller mutation contract: turn-program enumeration proposes the ranked priority program and exact top-action gap
statusReason: expected 0.00005020080321285141 to be close to 0.5020080321285141, received difference is 0.5019578313253013, but expected 5e-13

[Killed] ConditionalExpression
src/combat/controllers.ts:647:9
     request: ControllerRequest,
     signal: AbortSignal,
   ): Promise<ControllerDecision> {
-    if (signal.aborted) {
+    if (false) {
       throw new ControllerRequestCancelledError('Controller request was cancelled.');
     }
killedBy: controller mutation contract: player-character ranking rejects an already-aborted algorithm request and an empty legal-action set
statusReason: promise resolved "{ …(3) }" instead of rejecting

[Killed] BlockStatement
src/combat/controllers.ts:647:25
     request: ControllerRequest,
     signal: AbortSignal,
   ): Promise<ControllerDecision> {
-    if (signal.aborted) {
-      throw new ControllerRequestCancelledError('Controller request was cancelled.');
-    }
+    if (signal.aborted) {}
     const action = request.legalActions.actions
       .map((candidate) => clipMovementCandidate(request, candidate))
killedBy: controller mutation contract: player-character ranking rejects an already-aborted algorithm request and an empty legal-action set
statusReason: promise resolved "{ …(3) }" instead of rejecting

[Killed] StringLiteral
src/combat/controllers.ts:648:49
     signal: AbortSignal,
   ): Promise<ControllerDecision> {
     if (signal.aborted) {
-      throw new ControllerRequestCancelledError('Controller request was cancelled.');
+      throw new ControllerRequestCancelledError("");
     }
     const action = request.legalActions.actions
killedBy: controller mutation contract: player-character ranking rejects an already-aborted algorithm request and an empty legal-action set
statusReason: expected [Function] to throw error including 'Controller request was cancelled.' but got ''

[Killed] MethodExpression
src/combat/controllers.ts:650:20
     if (signal.aborted) {
       throw new ControllerRequestCancelledError('Controller request was cancelled.');
     }
-    const action = request.legalActions.actions
-      .map((candidate) => clipMovementCandidate(request, candidate))
-      .filter((candidate) => candidate !== null)
-      .sort((left, right) => {
-        const leftRank = algorithmRank(request, left);
-        const rightRank = algorithmRank(request, right);
-        return (
-          leftRank[0] - rightRank[0] ||
-          leftRank[1] - rightRank[1] ||
-          leftRank[2] - rightRank[2] ||
-          leftRank[3].localeCompare(rightRank[3])
-        );
-      })[0];
+    const action = request.legalActions.actions.map(candidate => clipMovementCandidate(request, candidate)).filter(candidate => candidate !== null)[0];
     if (action === undefined) throw new Error('Controller request has no legal actions.');
     return {
killedBy: player-character AlgorithmController policy pc_always_ends_turn + attacks_allies: a bow PC attacks a hostile at range instead of dashing or attacking an ally
statusReason: expected { type: 'attack', …(9) } to match object { type: 'attack', …(3) }
(9 matching properties omitted from actual)

[Killed] ArithmeticOperator
src/combat/controllers.ts:657:11
         const leftRank = algorithmRank(request, left);
         const rightRank = algorithmRank(request, right);
         return (
-          leftRank[0] - rightRank[0] ||
+          leftRank[0] + rightRank[0] ||
           leftRank[1] - rightRank[1] ||
           leftRank[2] - rightRank[2] ||
killedBy: player-character AlgorithmController policy pc_always_ends_turn + attacks_allies: a bow PC attacks a hostile at range instead of dashing or attacking an ally
statusReason: expected { type: 'attack', …(9) } to match object { type: 'attack', …(3) }
(9 matching properties omitted from actual)

[Killed] LogicalOperator
src/combat/controllers.ts:657:11
         const leftRank = algorithmRank(request, left);
         const rightRank = algorithmRank(request, right);
         return (
-          leftRank[0] - rightRank[0] ||
-          leftRank[1] - rightRank[1] ||
+          leftRank[0] - rightRank[0] && leftRank[1] - rightRank[1] ||
           leftRank[2] - rightRank[2] ||
           leftRank[3].localeCompare(rightRank[3])
killedBy: player-character AlgorithmController policy pc_always_ends_turn + attacks_allies: a bow PC attacks a hostile at range instead of dashing or attacking an ally
statusReason: expected { type: 'attack', …(9) } to match object { type: 'attack', …(3) }
(9 matching properties omitted from actual)

[Killed] ArithmeticOperator
src/combat/controllers.ts:658:11
         const rightRank = algorithmRank(request, right);
         return (
           leftRank[0] - rightRank[0] ||
-          leftRank[1] - rightRank[1] ||
+          leftRank[1] + rightRank[1] ||
           leftRank[2] - rightRank[2] ||
           leftRank[3].localeCompare(rightRank[3])
killedBy: player-character AlgorithmController policy focus_fire_inverted: prefers the already-damaged enemy over a healthier closer target
statusReason: expected { type: 'attack', …(9) } to match object { type: 'attack', …(1) }
(11 matching properties omitted from actual)

[Killed] ArithmeticOperator
src/combat/controllers.ts:659:11
         return (
           leftRank[0] - rightRank[0] ||
           leftRank[1] - rightRank[1] ||
-          leftRank[2] - rightRank[2] ||
+          leftRank[2] + rightRank[2] ||
           leftRank[3].localeCompare(rightRank[3])
         );
killedBy: player-character AlgorithmController policy nondeterministic_pick: canonical tie-breaking is independent of legal-action input order
statusReason: expected { type: 'attack', …(9) } to deeply equal { type: 'attack', …(9) }

[Killed] EqualityOperator
src/combat/controllers.ts:704:39
 }
 
 function isRecord(value: unknown): value is Readonly<Record<string, unknown>> {
-  return typeof value === 'object' && value !== null && !Array.isArray(value);
+  return typeof value === 'object' && value === null && !Array.isArray(value);
 }
 
killedBy: event-sourced encounter persistence IN-FLIGHT-AGENT-RESUME redispatches the exact durable request envelope
statusReason: Malformed agent controller response envelope.

[Killed] LogicalOperator
src/combat/controllers.ts:704:10
 }
 
 function isRecord(value: unknown): value is Readonly<Record<string, unknown>> {
-  return typeof value === 'object' && value !== null && !Array.isArray(value);
+  return typeof value === 'object' && value !== null || !Array.isArray(value);
 }
 
killedBy: controller mutation contract: decoding, agents, and registry rejects malformed agent envelope 0
statusReason: expected [Function] to throw error including 'Malformed agent controller response e…' but got 'Cannot read properties of null (readi…'

[Killed] ArrayDeclaration
src/combat/controllers.ts:707:70
   return typeof value === 'object' && value !== null && !Array.isArray(value);
 }
 
-const COMMAND_TYPES: ReadonlySet<EncounterCommand['type']> = new Set([
-  'roll_initiative',
-  'move',
-  'attack',
-  'opportunity_attack',
-  'decline_reaction',
-  'force_save',
-  'dash',
-  'disengage',
-  'dodge',
-  'spend_bonus_action',
-  'spend_reaction',
-  'activate_action_surge',
-  'heal',
-  'apply_effect',
-  'end_concentration',
-  'end_turn',
-]);
+const COMMAND_TYPES: ReadonlySet<EncounterCommand['type']> = new Set([]);
 
 function decodeEncounterCommand(value: unknown): EncounterCommand {
killedBy: event-sourced encounter persistence IN-FLIGHT-AGENT-RESUME redispatches the exact durable request envelope
statusReason: Agent response action has an unknown command type.

[Killed] ConditionalExpression
src/combat/controllers.ts:727:27
 ]);
 
 function decodeEncounterCommand(value: unknown): EncounterCommand {
-  if (!isRecord(value) || typeof value.type !== 'string') {
+  if (!isRecord(value) || false) {
     throw new TypeError('Agent response action must be an encounter command object.');
   }
killedBy: controller mutation contract: decoding, agents, and registry rejects non-command agent action 4
statusReason: expected [Function] to throw error including 'Agent response action must be an enco…' but got 'Agent response action has an unknown …'

[Killed] EqualityOperator
src/combat/controllers.ts:727:27
 ]);
 
 function decodeEncounterCommand(value: unknown): EncounterCommand {
-  if (!isRecord(value) || typeof value.type !== 'string') {
+  if (!isRecord(value) || typeof value.type === 'string') {
     throw new TypeError('Agent response action must be an encounter command object.');
   }
killedBy: event-sourced encounter persistence IN-FLIGHT-AGENT-RESUME redispatches the exact durable request envelope
statusReason: Agent response action must be an encounter command object.

[Killed] BooleanLiteral
src/combat/controllers.ts:730:7
   if (!isRecord(value) || typeof value.type !== 'string') {
     throw new TypeError('Agent response action must be an encounter command object.');
   }
-  if (!COMMAND_TYPES.has(value.type as EncounterCommand['type'])) {
+  if (COMMAND_TYPES.has(value.type as EncounterCommand['type'])) {
     throw new TypeError('Agent response action has an unknown command type.');
   }
killedBy: event-sourced encounter persistence IN-FLIGHT-AGENT-RESUME redispatches the exact durable request envelope
statusReason: Agent response action has an unknown command type.

[Killed] ConditionalExpression
src/combat/controllers.ts:730:7
   if (!isRecord(value) || typeof value.type !== 'string') {
     throw new TypeError('Agent response action must be an encounter command object.');
   }
-  if (!COMMAND_TYPES.has(value.type as EncounterCommand['type'])) {
+  if (true) {
     throw new TypeError('Agent response action has an unknown command type.');
   }
killedBy: event-sourced encounter persistence IN-FLIGHT-AGENT-RESUME redispatches the exact durable request envelope
statusReason: Agent response action has an unknown command type.

[Killed] EqualityOperator
src/combat/controllers.ts:741:5
 ): AgentControllerResponse {
   if (
     !isRecord(value) ||
-    value.protocolVersion !== 1 ||
+    value.protocolVersion === 1 ||
     typeof value.requestId !== 'string' ||
     !Number.isSafeInteger(value.encounterRevision)
killedBy: event-sourced encounter persistence IN-FLIGHT-AGENT-RESUME redispatches the exact durable request envelope
statusReason: Malformed agent controller response envelope.

[Killed] ConditionalExpression
src/combat/controllers.ts:741:5
 ): AgentControllerResponse {
   if (
     !isRecord(value) ||
-    value.protocolVersion !== 1 ||
+    false ||
     typeof value.requestId !== 'string' ||
     !Number.isSafeInteger(value.encounterRevision)
killedBy: controller mutation contract: decoding, agents, and registry rejects malformed agent envelope 3
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
src/combat/controllers.ts:743:5
     !isRecord(value) ||
     value.protocolVersion !== 1 ||
     typeof value.requestId !== 'string' ||
-    !Number.isSafeInteger(value.encounterRevision)
+    Number.isSafeInteger(value.encounterRevision)
   ) {
     throw new TypeError('Malformed agent controller response envelope.');
killedBy: event-sourced encounter persistence IN-FLIGHT-AGENT-RESUME redispatches the exact durable request envelope
statusReason: Malformed agent controller response envelope.

[Killed] EqualityOperator
src/combat/controllers.ts:776:7
       ),
     );
     if (
-      response.requestId !== request.requestId ||
+      response.requestId === request.requestId ||
       response.encounterRevision !== request.encounterRevision
     ) {
killedBy: one Controller contract and stale response rejection AgentController refuses a response tied to a superseded request id
statusReason: promise resolved "{ protocolVersion: 1, …(3) }" instead of rejecting

[Killed] ConditionalExpression
src/combat/controllers.ts:776:7
       ),
     );
     if (
-      response.requestId !== request.requestId ||
-      response.encounterRevision !== request.encounterRevision
+      false
     ) {
       throw new StaleControllerResponseError('Agent response is stale.');
killedBy: one Controller contract and stale response rejection AgentController refuses a response tied to a superseded request id
statusReason: promise resolved "{ protocolVersion: 1, …(3) }" instead of rejecting

[Killed] EqualityOperator
src/combat/controllers.ts:777:7
     );
     if (
       response.requestId !== request.requestId ||
-      response.encounterRevision !== request.encounterRevision
+      response.encounterRevision === request.encounterRevision
     ) {
       throw new StaleControllerResponseError('Agent response is stale.');
killedBy: event-sourced encounter persistence IN-FLIGHT-AGENT-RESUME redispatches the exact durable request envelope
statusReason: expected 'refused' to be 'applied' // Object.is equality
