[Killed] ConditionalExpression
src/combat/controllers.ts:777:7
     );
     if (
       response.requestId !== request.requestId ||
-      response.encounterRevision !== request.encounterRevision
+      false
     ) {
       throw new StaleControllerResponseError('Agent response is stale.');
killedBy: controller mutation contract: decoding, agents, and registry rejects a stale agent revision with the exact typed error
statusReason: promise resolved "{ protocolVersion: 1, …(3) }" instead of rejecting

[Killed] BlockStatement
src/combat/controllers.ts:778:7
     if (
       response.requestId !== request.requestId ||
       response.encounterRevision !== request.encounterRevision
-    ) {
-      throw new StaleControllerResponseError('Agent response is stale.');
-    }
+    ) {}
     return response;
   }
killedBy: one Controller contract and stale response rejection AgentController refuses a response tied to a superseded request id
statusReason: promise resolved "{ protocolVersion: 1, …(3) }" instead of rejecting

[Killed] StringLiteral
src/combat/controllers.ts:779:46
       response.requestId !== request.requestId ||
       response.encounterRevision !== request.encounterRevision
     ) {
-      throw new StaleControllerResponseError('Agent response is stale.');
+      throw new StaleControllerResponseError("");
     }
     return response;
killedBy: controller mutation contract: decoding, agents, and registry rejects a stale agent request with the exact typed error
statusReason: expected [Function] to throw error including 'Agent response is stale.' but got ''

[Killed] ConditionalExpression
src/combat/controllers.ts:809:7
 
 function controllerKind(controller: Controller): ControllerKind {
   if (controller.controllerKind !== undefined) return controller.controllerKind;
-  if (controller instanceof HumanController) return 'human';
+  if (false) return 'human';
   if (controller instanceof AlgorithmController) return 'algorithm';
   if (controller instanceof AgentController) return 'agent';
killedBy: controller mutation contract: decoding, agents, and registry exposes exact sorted identities, controller kinds, generations, replacement events, and removal
statusReason: expected [ { …(4) }, { …(4) } ] to deeply equal [ { …(4) }, { …(4) } ]

[Killed] ConditionalExpression
src/combat/controllers.ts:809:7
 
 function controllerKind(controller: Controller): ControllerKind {
   if (controller.controllerKind !== undefined) return controller.controllerKind;
-  if (controller instanceof HumanController) return 'human';
+  if (true) return 'human';
   if (controller instanceof AlgorithmController) return 'algorithm';
   if (controller instanceof AgentController) return 'agent';
killedBy: controller mutation contract: decoding, agents, and registry exposes exact sorted identities, controller kinds, generations, replacement events, and removal
statusReason: expected [ { …(4) }, { …(4) } ] to deeply equal [ { …(4) }, { …(4) } ]

[Killed] ConditionalExpression
src/combat/controllers.ts:810:7
 function controllerKind(controller: Controller): ControllerKind {
   if (controller.controllerKind !== undefined) return controller.controllerKind;
   if (controller instanceof HumanController) return 'human';
-  if (controller instanceof AlgorithmController) return 'algorithm';
+  if (false) return 'algorithm';
   if (controller instanceof AgentController) return 'agent';
   return 'custom';
killedBy: controller mutation contract: decoding, agents, and registry exposes exact sorted identities, controller kinds, generations, replacement events, and removal
statusReason: expected [ { …(4) }, { …(4) } ] to deeply equal [ { …(4) }, { …(4) } ]

[Killed] ConditionalExpression
src/combat/controllers.ts:810:7
 function controllerKind(controller: Controller): ControllerKind {
   if (controller.controllerKind !== undefined) return controller.controllerKind;
   if (controller instanceof HumanController) return 'human';
-  if (controller instanceof AlgorithmController) return 'algorithm';
+  if (true) return 'algorithm';
   if (controller instanceof AgentController) return 'agent';
   return 'custom';
killedBy: controller mutation contract: decoding, agents, and registry exposes exact sorted identities, controller kinds, generations, replacement events, and removal
statusReason: expected 'algorithm' to be 'agent' // Object.is equality

[Killed] ConditionalExpression
src/combat/controllers.ts:811:7
   if (controller.controllerKind !== undefined) return controller.controllerKind;
   if (controller instanceof HumanController) return 'human';
   if (controller instanceof AlgorithmController) return 'algorithm';
-  if (controller instanceof AgentController) return 'agent';
+  if (false) return 'agent';
   return 'custom';
 }
killedBy: controller mutation contract: decoding, agents, and registry exposes exact sorted identities, controller kinds, generations, replacement events, and removal
statusReason: expected 'custom' to be 'agent' // Object.is equality

[Killed] ConditionalExpression
src/combat/controllers.ts:811:7
   if (controller.controllerKind !== undefined) return controller.controllerKind;
   if (controller instanceof HumanController) return 'human';
   if (controller instanceof AlgorithmController) return 'algorithm';
-  if (controller instanceof AgentController) return 'agent';
+  if (true) return 'agent';
   return 'custom';
 }
killedBy: controller mutation contract: decoding, agents, and registry uses an explicit controllerKind before class inference and identifies an untagged controller as custom
statusReason: expected 'agent' to be 'custom' // Object.is equality

[Killed] BlockStatement
src/combat/controllers.ts:827:61
   readonly #entries = new Map<CombatantId, RegistryEntry>();
   readonly #replaceListeners = new Set<(id: CombatantId) => void>();
 
-  constructor(assignments: readonly ControllerAssignment[]) {
-    for (const assignment of assignments) {
-      if (this.#entries.has(assignment.combatantId)) {
-        throw new Error(`Duplicate controller assignment for ${assignment.combatantId}.`);
-      }
-      this.#entries.set(assignment.combatantId, {
-        controller: assignment.controller,
-        generation: 0,
-        controllerId:
-          assignment.controllerId ??
-          defaultControllerId(
-            assignment.combatantId,
-            controllerKind(assignment.controller),
-            0,
-          ),
-        kind: controllerKind(assignment.controller),
-      });
-    }
-  }
+  constructor(assignments: readonly ControllerAssignment[]) {}
 
   controllerFor(combatantId: CombatantId): Controller {
killedBy: controller mutation contract: decoding, agents, and registry exposes exact sorted identities, controller kinds, generations, replacement events, and removal
statusReason: expected [] to deeply equal [ { …(4) }, { …(4) } ]

[Killed] BlockStatement
src/combat/controllers.ts:828:43
   readonly #replaceListeners = new Set<(id: CombatantId) => void>();
 
   constructor(assignments: readonly ControllerAssignment[]) {
-    for (const assignment of assignments) {
-      if (this.#entries.has(assignment.combatantId)) {
-        throw new Error(`Duplicate controller assignment for ${assignment.combatantId}.`);
-      }
-      this.#entries.set(assignment.combatantId, {
-        controller: assignment.controller,
-        generation: 0,
-        controllerId:
-          assignment.controllerId ??
-          defaultControllerId(
-            assignment.combatantId,
-            controllerKind(assignment.controller),
-            0,
-          ),
-        kind: controllerKind(assignment.controller),
-      });
-    }
+    for (const assignment of assignments) {}
   }
 
killedBy: controller mutation contract: decoding, agents, and registry exposes exact sorted identities, controller kinds, generations, replacement events, and removal
statusReason: expected [] to deeply equal [ { …(4) }, { …(4) } ]

[Killed] BlockStatement
src/combat/controllers.ts:829:54
 
   constructor(assignments: readonly ControllerAssignment[]) {
     for (const assignment of assignments) {
-      if (this.#entries.has(assignment.combatantId)) {
-        throw new Error(`Duplicate controller assignment for ${assignment.combatantId}.`);
-      }
+      if (this.#entries.has(assignment.combatantId)) {}
       this.#entries.set(assignment.combatantId, {
         controller: assignment.controller,
killedBy: controller mutation contract: decoding, agents, and registry rejects duplicate constructor assignments with the exact combatant id
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/combat/controllers.ts:829:11
 
   constructor(assignments: readonly ControllerAssignment[]) {
     for (const assignment of assignments) {
-      if (this.#entries.has(assignment.combatantId)) {
+      if (false) {
         throw new Error(`Duplicate controller assignment for ${assignment.combatantId}.`);
       }
killedBy: controller mutation contract: decoding, agents, and registry rejects duplicate constructor assignments with the exact combatant id
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/combat/controllers.ts:830:25
   constructor(assignments: readonly ControllerAssignment[]) {
     for (const assignment of assignments) {
       if (this.#entries.has(assignment.combatantId)) {
-        throw new Error(`Duplicate controller assignment for ${assignment.combatantId}.`);
+        throw new Error(``);
       }
       this.#entries.set(assignment.combatantId, {
killedBy: controller mutation contract: decoding, agents, and registry rejects duplicate constructor assignments with the exact combatant id
statusReason: expected [Function] to throw error including 'Duplicate controller assignment for c…' but got ''

[Killed] StringLiteral
src/combat/controllers.ts:861:46
 
   kindFor(combatantId: CombatantId): ControllerKind {
     const entry = this.#entries.get(combatantId);
-    if (entry === undefined) throw new Error(`No controller assigned to ${combatantId}.`);
+    if (entry === undefined) throw new Error(``);
     return entry.kind;
   }
killedBy: controller mutation contract: decoding, agents, and registry assigns a summoned combatant from the exact source seam and rejects every invalid registry target
statusReason: expected [Function] to throw error including 'No controller assigned to combatant:r…' but got ''

[Killed] MethodExpression
src/combat/controllers.ts:866:12
   }
 
   identities(): readonly ControllerIdentity[] {
-    return [...this.#entries.entries()]
-      .map(([combatantId, entry]) => ({
-        combatantId,
-        controllerId: entry.controllerId,
-        kind: entry.kind,
-        generation: entry.generation,
-      }))
-      .sort((left, right) => left.combatantId.localeCompare(right.combatantId));
+    return [...this.#entries.entries()].map(([combatantId, entry]) => ({
+  combatantId,
+  controllerId: entry.controllerId,
+  kind: entry.kind,
+  generation: entry.generation
+}));
   }
 
killedBy: controller mutation contract: decoding, agents, and registry exposes exact sorted identities, controller kinds, generations, replacement events, and removal
statusReason: expected [ { …(4) }, { …(4) } ] to deeply equal [ { …(4) }, { …(4) } ]

[Killed] BlockStatement
src/combat/controllers.ts:877:67
   }
 
   /** Assigns a newly summoned combatant to the summoner's exact controller seam. */
-  assignFrom(combatantId: CombatantId, source: CombatantId): void {
-    if (this.#entries.has(combatantId)) {
-      throw new Error(`Controller already assigned to ${combatantId}.`);
-    }
-    const sourceEntry = this.#entries.get(source);
-    if (sourceEntry === undefined) throw new Error(`No controller assigned to ${source}.`);
-    this.#entries.set(combatantId, {
-      controller: sourceEntry.controller,
-      generation: sourceEntry.generation,
-      controllerId: sourceEntry.controllerId,
-      kind: sourceEntry.kind,
-    });
-  }
+  assignFrom(combatantId: CombatantId, source: CombatantId): void {}
 
   remove(combatantId: CombatantId): void {
killedBy: controller mutation contract: decoding, agents, and registry assigns a summoned combatant from the exact source seam and rejects every invalid registry target
statusReason: No controller assigned to combatant:registry-summoned.

[Killed] BlockStatement
src/combat/controllers.ts:878:41
 
   /** Assigns a newly summoned combatant to the summoner's exact controller seam. */
   assignFrom(combatantId: CombatantId, source: CombatantId): void {
-    if (this.#entries.has(combatantId)) {
-      throw new Error(`Controller already assigned to ${combatantId}.`);
-    }
+    if (this.#entries.has(combatantId)) {}
     const sourceEntry = this.#entries.get(source);
     if (sourceEntry === undefined) throw new Error(`No controller assigned to ${source}.`);
killedBy: controller mutation contract: decoding, agents, and registry assigns a summoned combatant from the exact source seam and rejects every invalid registry target
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/combat/controllers.ts:878:9
 
   /** Assigns a newly summoned combatant to the summoner's exact controller seam. */
   assignFrom(combatantId: CombatantId, source: CombatantId): void {
-    if (this.#entries.has(combatantId)) {
+    if (false) {
       throw new Error(`Controller already assigned to ${combatantId}.`);
     }
killedBy: controller mutation contract: decoding, agents, and registry assigns a summoned combatant from the exact source seam and rejects every invalid registry target
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/combat/controllers.ts:891:42
     });
   }
 
-  remove(combatantId: CombatantId): void {
-    if (!this.#entries.delete(combatantId)) {
-      throw new Error(`No controller assigned to ${combatantId}.`);
-    }
-  }
+  remove(combatantId: CombatantId): void {}
 
   replace(
killedBy: controller mutation contract: decoding, agents, and registry exposes exact sorted identities, controller kinds, generations, replacement events, and removal
statusReason: expected [ { …(4) }, { …(4) } ] to have a length of 1 but got 2

[Killed] ConditionalExpression
src/combat/controllers.ts:892:9
   }
 
   remove(combatantId: CombatantId): void {
-    if (!this.#entries.delete(combatantId)) {
+    if (true) {
       throw new Error(`No controller assigned to ${combatantId}.`);
     }
killedBy: controller mutation contract: decoding, agents, and registry exposes exact sorted identities, controller kinds, generations, replacement events, and removal
statusReason: No controller assigned to combatant:registry-beta.

[Killed] ConditionalExpression
src/combat/controllers.ts:892:9
   }
 
   remove(combatantId: CombatantId): void {
-    if (!this.#entries.delete(combatantId)) {
+    if (false) {
       throw new Error(`No controller assigned to ${combatantId}.`);
     }
killedBy: controller mutation contract: decoding, agents, and registry exposes exact sorted identities, controller kinds, generations, replacement events, and removal
statusReason: expected [ { …(4) }, { …(4) } ] to have a length of 1 but got 2

[Killed] StringLiteral
src/combat/controllers.ts:893:23
 
   remove(combatantId: CombatantId): void {
     if (!this.#entries.delete(combatantId)) {
-      throw new Error(`No controller assigned to ${combatantId}.`);
+      throw new Error(``);
     }
   }
killedBy: controller mutation contract: decoding, agents, and registry exposes exact sorted identities, controller kinds, generations, replacement events, and removal
statusReason: expected [Function] to throw error including 'No controller assigned to combatant:r…' but got ''

[Killed] BlockStatement
src/combat/controllers.ts:901:11
     combatantId: CombatantId,
     controller: Controller,
     controllerId?: string,
-  ): void {
-    const current = this.#entries.get(combatantId);
-    if (current === undefined) throw new Error(`No controller assigned to ${combatantId}.`);
-    const generation = current.generation + 1;
-    const kind = controllerKind(controller);
-    this.#entries.set(combatantId, {
-      controller,
-      generation,
-      controllerId:
-        controllerId ?? defaultControllerId(combatantId, kind, generation),
-      kind,
-    });
-    for (const listener of this.#replaceListeners) listener(combatantId);
-  }
+  ): void {}
 
   onReplace(listener: (id: CombatantId) => void): () => void {
killedBy: Vane Warren loader, chaining, seats, and end-session export carries controller assignments across a fight boundary and accepts the new roster member assignment
statusReason: expected [] to have a length of 5 but got +0

[Killed] ArithmeticOperator
src/combat/controllers.ts:904:24
   ): void {
     const current = this.#entries.get(combatantId);
     if (current === undefined) throw new Error(`No controller assigned to ${combatantId}.`);
-    const generation = current.generation + 1;
+    const generation = current.generation - 1;
     const kind = controllerKind(controller);
     this.#entries.set(combatantId, {
killedBy: Vane Warren loader, chaining, seats, and end-session export carries controller assignments across a fight boundary and accepts the new roster member assignment
statusReason: Resumed controller identities do not match the durable revision.

[Killed] ArrowFunction
src/combat/controllers.ts:918:12
 
   onReplace(listener: (id: CombatantId) => void): () => void {
     this.#replaceListeners.add(listener);
-    return () => this.#replaceListeners.delete(listener);
+    return () => undefined;
   }
 }
killedBy: controller mutation contract: decoding, agents, and registry exposes exact sorted identities, controller kinds, generations, replacement events, and removal
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] ConditionalExpression
src/combat/controllers.ts:934:5
 ): ReactionPolicyDecision {
   if (policy === null) return 'prompt';
   switch (policy.opportunityAttack) {
-    case 'use':
-      return 'use';
+    case 'use':
     case 'decline':
       return 'decline';
killedBy: one Controller contract and stale response rejection evaluates standing policy {"opportunityAttack":"use"} as use
statusReason: expected 'decline' to be 'use' // Object.is equality
