[Killed] StringLiteral
src/vtt/local-session-store.ts:17:31
 
 const DATABASE_VERSION = 1;
 
-const LEGACY_SESSION_PREFIX = 'srd55:vtt-session:';
+const LEGACY_SESSION_PREFIX = "";
 const LEGACY_METADATA_PREFIX = 'srd55:vtt-session-metadata:';
 const LEGACY_TRUNCATED_PREFIX = 'srd55:vtt-session-truncated:';
killedBy: IndexedDB durable VTT session adapter renames, exports, restores, and removes one autosave without touching another session
statusReason: Browser session storage failed. This revision was not saved; export a copy before continuing.

[Killed] StringLiteral
src/vtt/local-session-store.ts:18:32
 const DATABASE_VERSION = 1;
 
 const LEGACY_SESSION_PREFIX = 'srd55:vtt-session:';
-const LEGACY_METADATA_PREFIX = 'srd55:vtt-session-metadata:';
+const LEGACY_METADATA_PREFIX = "";
 const LEGACY_TRUNCATED_PREFIX = 'srd55:vtt-session-truncated:';
 const LIKELY_LOCAL_STORAGE_LIMIT_BYTES = 4 * 1024 * 1024;
killedBy: IndexedDB durable VTT session adapter decodes legacy retention 0 as 0
statusReason: expected { kind: 'autosave', pool: 'per_round' } to deeply equal { kind: 'named' }

[Killed] StringLiteral
src/vtt/local-session-store.ts:19:33
 
 const LEGACY_SESSION_PREFIX = 'srd55:vtt-session:';
 const LEGACY_METADATA_PREFIX = 'srd55:vtt-session-metadata:';
-const LEGACY_TRUNCATED_PREFIX = 'srd55:vtt-session-truncated:';
+const LEGACY_TRUNCATED_PREFIX = "";
 const LIKELY_LOCAL_STORAGE_LIMIT_BYTES = 4 * 1024 * 1024;
 
killedBy: IndexedDB durable VTT session adapter truncated_marked_complete preserves a quota-truncated prefix and flags it
statusReason: expected [ { …(11) } ] to deeply equal [ ObjectContaining{…} ]

[Killed] ArithmeticOperator
src/vtt/local-session-store.ts:20:42
 const LEGACY_SESSION_PREFIX = 'srd55:vtt-session:';
 const LEGACY_METADATA_PREFIX = 'srd55:vtt-session-metadata:';
 const LEGACY_TRUNCATED_PREFIX = 'srd55:vtt-session-truncated:';
-const LIKELY_LOCAL_STORAGE_LIMIT_BYTES = 4 * 1024 * 1024;
+const LIKELY_LOCAL_STORAGE_LIMIT_BYTES = 4 * 1024 / 1024;
 
 function defaultDatabaseName(): string {
killedBy: IndexedDB durable VTT session adapter MIGRATION-COPY-BEFORE-DELETE moves legacy localStorage and is idempotent
statusReason: expected [ { …(11) } ] to deeply equal [ ObjectContaining{…} ]

[Killed] ArithmeticOperator
src/vtt/local-session-store.ts:20:42
 const LEGACY_SESSION_PREFIX = 'srd55:vtt-session:';
 const LEGACY_METADATA_PREFIX = 'srd55:vtt-session-metadata:';
 const LEGACY_TRUNCATED_PREFIX = 'srd55:vtt-session-truncated:';
-const LIKELY_LOCAL_STORAGE_LIMIT_BYTES = 4 * 1024 * 1024;
+const LIKELY_LOCAL_STORAGE_LIMIT_BYTES = 4 / 1024 * 1024;
 
 function defaultDatabaseName(): string {
killedBy: IndexedDB durable VTT session adapter MIGRATION-COPY-BEFORE-DELETE moves legacy localStorage and is idempotent
statusReason: expected [ { …(11) } ] to deeply equal [ ObjectContaining{…} ]

[Killed] StringLiteral
src/vtt/local-session-store.ts:23:10
 const LIKELY_LOCAL_STORAGE_LIMIT_BYTES = 4 * 1024 * 1024;
 
 function defaultDatabaseName(): string {
-  return 'srd55-vtt-sessions';
+  return "";
 }
 
killedBy: IndexedDB durable VTT session adapter opens the exact default database and stores, and close delegates to IndexedDB
statusReason: expected [ { name: '', version: 1 } ] to deeply equal [ Array(1) ]

[Killed] StringLiteral
src/vtt/local-session-store.ts:27:10
 }
 
 function revisionStoreName(): string {
-  return 'revisions';
+  return "";
 }
 
killedBy: IndexedDB durable VTT session adapter opens the exact default database and stores, and close delegates to IndexedDB
statusReason: expected [ …(2) ] to deeply equal [ …(2) ]

[Killed] StringLiteral
src/vtt/local-session-store.ts:95:11
     super(
       quotaExceeded
         ? 'Browser session storage is full. This revision was not saved; export a copy before continuing.'
-        : 'Browser session storage failed. This revision was not saved; export a copy before continuing.',
+        : "",
       options,
     );
killedBy: IndexedDB durable VTT session adapter preserves an exact non-quota open failure for Error: ordinary open failure
statusReason: expected BrowserSessionWriteError { …(3) } to match object { …(6) }

[Killed] LogicalOperator
src/vtt/local-session-store.ts:103:10
 }
 
 function isRecord(value: unknown): value is Readonly<Record<string, unknown>> {
-  return typeof value === 'object' && value !== null && !Array.isArray(value);
+  return typeof value === 'object' || value !== null && !Array.isArray(value);
 }
 
killedBy: IndexedDB durable VTT session adapter falls back safely for malformed legacy metadata 0
statusReason: Browser session storage failed. This revision was not saved; export a copy before continuing.

[Killed] ConditionalExpression
src/vtt/local-session-store.ts:107:10
 }
 
 function isQuotaError(error: unknown): boolean {
-  return error instanceof DOMException && error.name === 'QuotaExceededError';
+  return false;
 }
 
killedBy: IndexedDB durable VTT session adapter turns direct IndexedDB failures into a sticky typed operation failure
statusReason: expected BrowserSessionWriteError: Browser session… { …(3) } to match object { …(4) }
(1 matching property omitted from actual)

[Killed] ConditionalExpression
src/vtt/local-session-store.ts:107:10
 }
 
 function isQuotaError(error: unknown): boolean {
-  return error instanceof DOMException && error.name === 'QuotaExceededError';
+  return true;
 }
 
killedBy: IndexedDB durable VTT session adapter settles the open_error event path as an exact open failure
statusReason: expected BrowserSessionWriteError: Browser session… { …(3) } to match object { …(3) }
(1 matching property omitted from actual)

[Killed] ObjectLiteral
src/vtt/local-session-store.ts:116:68
 ): BrowserSessionWriteError {
   return error instanceof BrowserSessionWriteError
     ? error
-    : new BrowserSessionWriteError(operation, isQuotaError(error), { cause: error });
+    : new BrowserSessionWriteError(operation, isQuotaError(error), {});
 }
 
killedBy: IndexedDB durable VTT session adapter turns direct IndexedDB failures into a sticky typed operation failure
statusReason: expected BrowserSessionWriteError: Browser session… { …(3) } to match object { …(4) }
(1 matching property omitted from actual)

[Killed] BlockStatement
src/vtt/local-session-store.ts:120:43
 }
 
 function transactionComplete(transaction: IDBTransaction): Promise<void> {
-  return new Promise((resolve, reject) => {
-    transaction.addEventListener('complete', () => resolve(), { once: true });
-    transaction.addEventListener('abort', () => reject(transaction.error), { once: true });
-    transaction.addEventListener('error', () => reject(transaction.error), { once: true });
-  });
+  return new Promise((resolve, reject) => {});
 }
 
killedBy: IndexedDB durable VTT session adapter opens the exact default database and stores, and close delegates to IndexedDB
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BooleanLiteral
src/vtt/local-session-store.ts:121:71
 
 function transactionComplete(transaction: IDBTransaction): Promise<void> {
   return new Promise((resolve, reject) => {
-    transaction.addEventListener('complete', () => resolve(), { once: true });
+    transaction.addEventListener('complete', () => resolve(), { once: false });
     transaction.addEventListener('abort', () => reject(transaction.error), { once: true });
     transaction.addEventListener('error', () => reject(transaction.error), { once: true });
killedBy: IndexedDB durable VTT session adapter registers exact one-shot success and failure listeners for opening, requests, and transactions
statusReason: expected [ { target: 'opening', …(2) }, …(11) ] to deeply equal [ { target: 'opening', …(2) }, …(11) ]

[Killed] ArrowFunction
src/vtt/local-session-store.ts:121:46
 
 function transactionComplete(transaction: IDBTransaction): Promise<void> {
   return new Promise((resolve, reject) => {
-    transaction.addEventListener('complete', () => resolve(), { once: true });
+    transaction.addEventListener('complete', () => undefined, { once: true });
     transaction.addEventListener('abort', () => reject(transaction.error), { once: true });
     transaction.addEventListener('error', () => reject(transaction.error), { once: true });
killedBy: typed encounter conclusion drives to victory, stops turns, renders the outcome, autosaves once, and closes the record
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ArrowFunction
src/vtt/local-session-store.ts:122:43
 function transactionComplete(transaction: IDBTransaction): Promise<void> {
   return new Promise((resolve, reject) => {
     transaction.addEventListener('complete', () => resolve(), { once: true });
-    transaction.addEventListener('abort', () => reject(transaction.error), { once: true });
+    transaction.addEventListener('abort', () => undefined, { once: true });
     transaction.addEventListener('error', () => reject(transaction.error), { once: true });
   });
killedBy: IndexedDB durable VTT session adapter settles the transaction_abort event path as an exact migration failure
statusReason: Test timed out in 1000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BooleanLiteral
src/vtt/local-session-store.ts:122:84
 function transactionComplete(transaction: IDBTransaction): Promise<void> {
   return new Promise((resolve, reject) => {
     transaction.addEventListener('complete', () => resolve(), { once: true });
-    transaction.addEventListener('abort', () => reject(transaction.error), { once: true });
+    transaction.addEventListener('abort', () => reject(transaction.error), { once: false });
     transaction.addEventListener('error', () => reject(transaction.error), { once: true });
   });
killedBy: IndexedDB durable VTT session adapter registers exact one-shot success and failure listeners for opening, requests, and transactions
statusReason: expected [ { target: 'opening', …(2) }, …(11) ] to deeply equal [ { target: 'opening', …(2) }, …(11) ]

[Killed] BooleanLiteral
src/vtt/local-session-store.ts:123:84
   return new Promise((resolve, reject) => {
     transaction.addEventListener('complete', () => resolve(), { once: true });
     transaction.addEventListener('abort', () => reject(transaction.error), { once: true });
-    transaction.addEventListener('error', () => reject(transaction.error), { once: true });
+    transaction.addEventListener('error', () => reject(transaction.error), { once: false });
   });
 }
killedBy: IndexedDB durable VTT session adapter registers exact one-shot success and failure listeners for opening, requests, and transactions
statusReason: expected [ { target: 'opening', …(2) }, …(11) ] to deeply equal [ { target: 'opening', …(2) }, …(11) ]

[Killed] ArrowFunction
src/vtt/local-session-store.ts:123:43
   return new Promise((resolve, reject) => {
     transaction.addEventListener('complete', () => resolve(), { once: true });
     transaction.addEventListener('abort', () => reject(transaction.error), { once: true });
-    transaction.addEventListener('error', () => reject(transaction.error), { once: true });
+    transaction.addEventListener('error', () => undefined, { once: true });
   });
 }
killedBy: IndexedDB durable VTT session adapter settles the transaction_error event path as an exact migration failure
statusReason: Test timed out in 1000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/vtt/local-session-store.ts:128:43
 }
 
 function requestResult<T>(request: IDBRequest<T>): Promise<T> {
-  return new Promise((resolve, reject) => {
-    request.addEventListener('success', () => resolve(request.result), { once: true });
-    request.addEventListener('error', () => reject(request.error), { once: true });
-  });
+  return new Promise((resolve, reject) => {});
 }
 
killedBy: IndexedDB durable VTT session adapter opens the exact default database and stores, and close delegates to IndexedDB
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BooleanLiteral
src/vtt/local-session-store.ts:129:80
 
 function requestResult<T>(request: IDBRequest<T>): Promise<T> {
   return new Promise((resolve, reject) => {
-    request.addEventListener('success', () => resolve(request.result), { once: true });
+    request.addEventListener('success', () => resolve(request.result), { once: false });
     request.addEventListener('error', () => reject(request.error), { once: true });
   });
killedBy: IndexedDB durable VTT session adapter registers exact one-shot success and failure listeners for opening, requests, and transactions
statusReason: expected [ { target: 'opening', …(2) }, …(11) ] to deeply equal [ { target: 'opening', …(2) }, …(11) ]

[Killed] ArrowFunction
src/vtt/local-session-store.ts:129:41
 
 function requestResult<T>(request: IDBRequest<T>): Promise<T> {
   return new Promise((resolve, reject) => {
-    request.addEventListener('success', () => resolve(request.result), { once: true });
+    request.addEventListener('success', () => undefined, { once: true });
     request.addEventListener('error', () => reject(request.error), { once: true });
   });
killedBy: IndexedDB durable VTT session adapter opens the exact default database and stores, and close delegates to IndexedDB
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ArrowFunction
src/vtt/local-session-store.ts:130:39
 function requestResult<T>(request: IDBRequest<T>): Promise<T> {
   return new Promise((resolve, reject) => {
     request.addEventListener('success', () => resolve(request.result), { once: true });
-    request.addEventListener('error', () => reject(request.error), { once: true });
+    request.addEventListener('error', () => undefined, { once: true });
   });
 }
killedBy: IndexedDB durable VTT session adapter settles the request_error event path as an exact migration failure
statusReason: Test timed out in 1000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BooleanLiteral
src/vtt/local-session-store.ts:130:76
 function requestResult<T>(request: IDBRequest<T>): Promise<T> {
   return new Promise((resolve, reject) => {
     request.addEventListener('success', () => resolve(request.result), { once: true });
-    request.addEventListener('error', () => reject(request.error), { once: true });
+    request.addEventListener('error', () => reject(request.error), { once: false });
   });
 }
killedBy: IndexedDB durable VTT session adapter registers exact one-shot success and failure listeners for opening, requests, and transactions
statusReason: expected [ { target: 'opening', …(2) }, …(11) ] to deeply equal [ { target: 'opening', …(2) }, …(11) ]

[Killed] BlockStatement
src/vtt/local-session-store.ts:135:43
 }
 
 function openDatabase(indexedDb: IDBFactory, databaseName: string): Promise<IDBDatabase> {
-  return new Promise((resolve, reject) => {
-    const opening = indexedDb.open(databaseName, DATABASE_VERSION);
-    opening.addEventListener('upgradeneeded', () => {
-      for (const storeName of [revisionStoreName(), sessionStoreName(), snapshotStoreName()]) {
-        if (!opening.result.objectStoreNames.contains(storeName)) {
-          opening.result.createObjectStore(storeName);
-        }
-      }
-    });
-    opening.addEventListener('success', () => resolve(opening.result), { once: true });
-    opening.addEventListener('error', () => reject(opening.error), { once: true });
-  });
+  return new Promise((resolve, reject) => {});
 }
 
killedBy: IndexedDB durable VTT session adapter opens the exact default database and stores, and close delegates to IndexedDB
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/vtt/local-session-store.ts:137:53
 function openDatabase(indexedDb: IDBFactory, databaseName: string): Promise<IDBDatabase> {
   return new Promise((resolve, reject) => {
     const opening = indexedDb.open(databaseName, DATABASE_VERSION);
-    opening.addEventListener('upgradeneeded', () => {
-      for (const storeName of [revisionStoreName(), sessionStoreName(), snapshotStoreName()]) {
-        if (!opening.result.objectStoreNames.contains(storeName)) {
-          opening.result.createObjectStore(storeName);
-        }
-      }
-    });
+    opening.addEventListener('upgradeneeded', () => {});
     opening.addEventListener('success', () => resolve(opening.result), { once: true });
     opening.addEventListener('error', () => reject(opening.error), { once: true });
killedBy: IndexedDB durable VTT session adapter opens the exact default database and stores, and close delegates to IndexedDB
statusReason: Browser session storage failed. This revision was not saved; export a copy before continuing.

[Killed] BlockStatement
src/vtt/local-session-store.ts:138:95
   return new Promise((resolve, reject) => {
     const opening = indexedDb.open(databaseName, DATABASE_VERSION);
     opening.addEventListener('upgradeneeded', () => {
-      for (const storeName of [revisionStoreName(), sessionStoreName(), snapshotStoreName()]) {
-        if (!opening.result.objectStoreNames.contains(storeName)) {
-          opening.result.createObjectStore(storeName);
-        }
-      }
+      for (const storeName of [revisionStoreName(), sessionStoreName(), snapshotStoreName()]) {}
     });
     opening.addEventListener('success', () => resolve(opening.result), { once: true });
killedBy: IndexedDB durable VTT session adapter opens the exact default database and stores, and close delegates to IndexedDB
statusReason: Browser session storage failed. This revision was not saved; export a copy before continuing.

[Killed] ConditionalExpression
src/vtt/local-session-store.ts:139:13
     const opening = indexedDb.open(databaseName, DATABASE_VERSION);
     opening.addEventListener('upgradeneeded', () => {
       for (const storeName of [revisionStoreName(), sessionStoreName(), snapshotStoreName()]) {
-        if (!opening.result.objectStoreNames.contains(storeName)) {
+        if (false) {
           opening.result.createObjectStore(storeName);
         }
killedBy: IndexedDB durable VTT session adapter opens the exact default database and stores, and close delegates to IndexedDB
statusReason: Browser session storage failed. This revision was not saved; export a copy before continuing.

[Killed] BlockStatement
src/vtt/local-session-store.ts:139:67
     const opening = indexedDb.open(databaseName, DATABASE_VERSION);
     opening.addEventListener('upgradeneeded', () => {
       for (const storeName of [revisionStoreName(), sessionStoreName(), snapshotStoreName()]) {
-        if (!opening.result.objectStoreNames.contains(storeName)) {
-          opening.result.createObjectStore(storeName);
-        }
+        if (!opening.result.objectStoreNames.contains(storeName)) {}
       }
     });
killedBy: IndexedDB durable VTT session adapter opens the exact default database and stores, and close delegates to IndexedDB
statusReason: Browser session storage failed. This revision was not saved; export a copy before continuing.

[Killed] ArrowFunction
src/vtt/local-session-store.ts:144:41
         }
       }
     });
-    opening.addEventListener('success', () => resolve(opening.result), { once: true });
+    opening.addEventListener('success', () => undefined, { once: true });
     opening.addEventListener('error', () => reject(opening.error), { once: true });
   });
killedBy: IndexedDB durable VTT session adapter opens the exact default database and stores, and close delegates to IndexedDB
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BooleanLiteral
src/vtt/local-session-store.ts:144:80
         }
       }
     });
-    opening.addEventListener('success', () => resolve(opening.result), { once: true });
+    opening.addEventListener('success', () => resolve(opening.result), { once: false });
     opening.addEventListener('error', () => reject(opening.error), { once: true });
   });
killedBy: IndexedDB durable VTT session adapter registers exact one-shot success and failure listeners for opening, requests, and transactions
statusReason: expected [ { target: 'opening', …(2) }, …(11) ] to deeply equal [ { target: 'opening', …(2) }, …(11) ]

[Killed] ArrowFunction
src/vtt/local-session-store.ts:145:39
       }
     });
     opening.addEventListener('success', () => resolve(opening.result), { once: true });
-    opening.addEventListener('error', () => reject(opening.error), { once: true });
+    opening.addEventListener('error', () => undefined, { once: true });
   });
 }
killedBy: IndexedDB durable VTT session adapter settles the open_error event path as an exact open failure
statusReason: Test timed out in 1000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BooleanLiteral
src/vtt/local-session-store.ts:145:76
       }
     });
     opening.addEventListener('success', () => resolve(opening.result), { once: true });
-    opening.addEventListener('error', () => reject(opening.error), { once: true });
+    opening.addEventListener('error', () => reject(opening.error), { once: false });
   });
 }
killedBy: IndexedDB durable VTT session adapter registers exact one-shot success and failure listeners for opening, requests, and transactions
statusReason: expected [ { target: 'opening', …(2) }, …(11) ] to deeply equal [ { target: 'opening', …(2) }, …(11) ]

[Killed] StringLiteral
src/vtt/local-session-store.ts:150:61
 }
 
 function revisionKey(sessionId: EncounterSessionId, revision: number): string {
-  return `${sessionId}\u0000${String(revision).padStart(12, '0')}`;
+  return `${sessionId}\u0000${String(revision).padStart(12, "")}`;
 }
 
killedBy: IndexedDB durable VTT session adapter bulk-imports every revision, persists exact keys, and reloads the export
statusReason: expected [ …(2) ] to deeply equal [ …(2) ]

[Killed] ConditionalExpression
src/vtt/local-session-store.ts:166:7
         new Blob([value]).stream().pipeThrough(new DecompressionStream('gzip')),
       ).text())
     : value;
-  if (!isRecord(decoded) || typeof decoded.sessionId !== 'string' ||
-    !Number.isSafeInteger(decoded.revision) || typeof decoded.checksum !== 'string') {
+  if (true) {
     throw new TypeError('Stored VTT session revision is malformed.');
   }
killedBy: IndexedDB durable VTT session adapter bulk-imports every revision, persists exact keys, and reloads the export
statusReason: Browser session storage failed. This revision was not saved; export a copy before continuing.

[Killed] ConditionalExpression
src/vtt/local-session-store.ts:166:7
         new Blob([value]).stream().pipeThrough(new DecompressionStream('gzip')),
       ).text())
     : value;
-  if (!isRecord(decoded) || typeof decoded.sessionId !== 'string' ||
-    !Number.isSafeInteger(decoded.revision) || typeof decoded.checksum !== 'string') {
+  if (false) {
     throw new TypeError('Stored VTT session revision is malformed.');
   }
killedBy: IndexedDB durable VTT session adapter rejects malformed preloaded revisions 0 with the exact decoder error
statusReason: expected BrowserSessionWriteError: Browser session… { …(3) } to match object { operation: 'migration', …(1) }
(3 matching properties omitted from actual)

[Killed] BooleanLiteral
src/vtt/local-session-store.ts:167:5
       ).text())
     : value;
   if (!isRecord(decoded) || typeof decoded.sessionId !== 'string' ||
-    !Number.isSafeInteger(decoded.revision) || typeof decoded.checksum !== 'string') {
+    Number.isSafeInteger(decoded.revision) || typeof decoded.checksum !== 'string') {
     throw new TypeError('Stored VTT session revision is malformed.');
   }
killedBy: IndexedDB durable VTT session adapter bulk-imports every revision, persists exact keys, and reloads the export
statusReason: Browser session storage failed. This revision was not saved; export a copy before continuing.

[Killed] BlockStatement
src/vtt/local-session-store.ts:167:86
       ).text())
     : value;
   if (!isRecord(decoded) || typeof decoded.sessionId !== 'string' ||
-    !Number.isSafeInteger(decoded.revision) || typeof decoded.checksum !== 'string') {
-    throw new TypeError('Stored VTT session revision is malformed.');
-  }
+    !Number.isSafeInteger(decoded.revision) || typeof decoded.checksum !== 'string') {}
   return decoded as unknown as SessionRevision;
 }
killedBy: IndexedDB durable VTT session adapter rejects malformed preloaded revisions 0 with the exact decoder error
statusReason: expected BrowserSessionWriteError: Browser session… { …(3) } to match object { operation: 'migration', …(1) }
(3 matching properties omitted from actual)

[Killed] EqualityOperator
src/vtt/local-session-store.ts:174:26
 }
 
 function retention(value: unknown): SaveRetention {
-  if (isRecord(value) && value.kind === 'named') return { kind: 'named' };
+  if (isRecord(value) && value.kind !== 'named') return { kind: 'named' };
   if (isRecord(value) && value.kind === 'autosave' &&
     (value.pool === 'per_round' || value.pool === 'encounter_boundary')) {
killedBy: IndexedDB durable VTT session adapter decodes legacy retention 0 as 0
statusReason: expected { kind: 'autosave', pool: 'per_round' } to deeply equal { kind: 'named' }

[Killed] ConditionalExpression
src/vtt/local-session-store.ts:174:7
 }
 
 function retention(value: unknown): SaveRetention {
-  if (isRecord(value) && value.kind === 'named') return { kind: 'named' };
+  if (false) return { kind: 'named' };
   if (isRecord(value) && value.kind === 'autosave' &&
     (value.pool === 'per_round' || value.pool === 'encounter_boundary')) {
killedBy: IndexedDB durable VTT session adapter decodes legacy retention 0 as 0
statusReason: expected { kind: 'autosave', pool: 'per_round' } to deeply equal { kind: 'named' }

[Killed] EqualityOperator
src/vtt/local-session-store.ts:175:26
 
 function retention(value: unknown): SaveRetention {
   if (isRecord(value) && value.kind === 'named') return { kind: 'named' };
-  if (isRecord(value) && value.kind === 'autosave' &&
+  if (isRecord(value) && value.kind !== 'autosave' &&
     (value.pool === 'per_round' || value.pool === 'encounter_boundary')) {
     return { kind: 'autosave', pool: value.pool };
killedBy: IndexedDB durable VTT session adapter decodes legacy retention 2 as 2
statusReason: expected { kind: 'autosave', pool: 'per_round' } to deeply equal { kind: 'autosave', …(1) }

[Survived] ConditionalExpression
src/vtt/local-session-store.ts:175:26
 
 function retention(value: unknown): SaveRetention {
   if (isRecord(value) && value.kind === 'named') return { kind: 'named' };
-  if (isRecord(value) && value.kind === 'autosave' &&
+  if (isRecord(value) && true &&
     (value.pool === 'per_round' || value.pool === 'encounter_boundary')) {
     return { kind: 'autosave', pool: value.pool };

[Killed] ConditionalExpression
src/vtt/local-session-store.ts:176:36
 function retention(value: unknown): SaveRetention {
   if (isRecord(value) && value.kind === 'named') return { kind: 'named' };
   if (isRecord(value) && value.kind === 'autosave' &&
-    (value.pool === 'per_round' || value.pool === 'encounter_boundary')) {
+    (value.pool === 'per_round' || false)) {
     return { kind: 'autosave', pool: value.pool };
   }
killedBy: IndexedDB durable VTT session adapter decodes legacy retention 2 as 2
statusReason: expected { kind: 'autosave', pool: 'per_round' } to deeply equal { kind: 'autosave', …(1) }

[Killed] BlockStatement
src/vtt/local-session-store.ts:176:74
 function retention(value: unknown): SaveRetention {
   if (isRecord(value) && value.kind === 'named') return { kind: 'named' };
   if (isRecord(value) && value.kind === 'autosave' &&
-    (value.pool === 'per_round' || value.pool === 'encounter_boundary')) {
-    return { kind: 'autosave', pool: value.pool };
-  }
+    (value.pool === 'per_round' || value.pool === 'encounter_boundary')) {}
   return { kind: 'autosave', pool: 'per_round' };
 }
killedBy: IndexedDB durable VTT session adapter decodes legacy retention 2 as 2
statusReason: expected { kind: 'autosave', pool: 'per_round' } to deeply equal { kind: 'autosave', …(1) }

[Killed] EqualityOperator
src/vtt/local-session-store.ts:200:45
 function legacySnapshot(value: string): LegacyAutosaveSnapshot | null {
   const parsed: unknown = JSON.parse(value);
   if (!isRecord(parsed) || typeof parsed.storageId !== 'string' ||
-    typeof parsed.sessionId !== 'string' || typeof parsed.trigger !== 'string' ||
+    typeof parsed.sessionId !== 'string' || typeof parsed.trigger === 'string' ||
     typeof parsed.pool !== 'string' || typeof parsed.name !== 'string' ||
     typeof parsed.updatedAt !== 'string' || typeof parsed.bytes !== 'string') return null;
killedBy: IndexedDB durable VTT session adapter renames, exports, restores, and removes one autosave without touching another session
statusReason: Browser session storage failed. This revision was not saved; export a copy before continuing.
