[Killed] EqualityOperator
src/vtt/local-session-store.ts:200:5
 function legacySnapshot(value: string): LegacyAutosaveSnapshot | null {
   const parsed: unknown = JSON.parse(value);
   if (!isRecord(parsed) || typeof parsed.storageId !== 'string' ||
-    typeof parsed.sessionId !== 'string' || typeof parsed.trigger !== 'string' ||
+    typeof parsed.sessionId === 'string' || typeof parsed.trigger !== 'string' ||
     typeof parsed.pool !== 'string' || typeof parsed.name !== 'string' ||
     typeof parsed.updatedAt !== 'string' || typeof parsed.bytes !== 'string') return null;
killedBy: IndexedDB durable VTT session adapter renames, exports, restores, and removes one autosave without touching another session
statusReason: Browser session storage failed. This revision was not saved; export a copy before continuing.

[Killed] EqualityOperator
src/vtt/local-session-store.ts:201:5
   const parsed: unknown = JSON.parse(value);
   if (!isRecord(parsed) || typeof parsed.storageId !== 'string' ||
     typeof parsed.sessionId !== 'string' || typeof parsed.trigger !== 'string' ||
-    typeof parsed.pool !== 'string' || typeof parsed.name !== 'string' ||
+    typeof parsed.pool === 'string' || typeof parsed.name !== 'string' ||
     typeof parsed.updatedAt !== 'string' || typeof parsed.bytes !== 'string') return null;
   const trigger: AutosaveTrigger | null = (() => {
killedBy: IndexedDB durable VTT session adapter renames, exports, restores, and removes one autosave without touching another session
statusReason: Browser session storage failed. This revision was not saved; export a copy before continuing.

[Survived] ConditionalExpression
src/vtt/local-session-store.ts:201:5
   const parsed: unknown = JSON.parse(value);
   if (!isRecord(parsed) || typeof parsed.storageId !== 'string' ||
     typeof parsed.sessionId !== 'string' || typeof parsed.trigger !== 'string' ||
-    typeof parsed.pool !== 'string' || typeof parsed.name !== 'string' ||
+    false || typeof parsed.name !== 'string' ||
     typeof parsed.updatedAt !== 'string' || typeof parsed.bytes !== 'string') return null;
   const trigger: AutosaveTrigger | null = (() => {

[Killed] ConditionalExpression
src/vtt/local-session-store.ts:209:7
       case 'encounter_start':
       case 'encounter_end':
       case 'rest_boundary':
-      case 'rest_interruption': return parsed.trigger;
+      case 'rest_interruption':
       case 'short_rest_boundary':
       case 'long_rest_boundary': return 'rest_boundary';
killedBy: IndexedDB durable VTT session adapter normalizes both historical rest triggers and retains the direct trigger variants
statusReason: expected [ { …(2) }, { …(2) }, { …(2) }, …(4) ] to deeply equal [ { …(2) }, { …(2) }, { …(2) }, …(4) ]

[Killed] StringLiteral
src/vtt/local-session-store.ts:210:12
       case 'encounter_end':
       case 'rest_boundary':
       case 'rest_interruption': return parsed.trigger;
-      case 'short_rest_boundary':
+      case "":
       case 'long_rest_boundary': return 'rest_boundary';
       default: return null;
killedBy: IndexedDB durable VTT session adapter normalizes both historical rest triggers and retains the direct trigger variants
statusReason: Browser session storage failed. This revision was not saved; export a copy before continuing.

[Killed] ConditionalExpression
src/vtt/local-session-store.ts:211:7
       case 'rest_boundary':
       case 'rest_interruption': return parsed.trigger;
       case 'short_rest_boundary':
-      case 'long_rest_boundary': return 'rest_boundary';
+      case 'long_rest_boundary':
       default: return null;
     }
killedBy: IndexedDB durable VTT session adapter normalizes both historical rest triggers and retains the direct trigger variants
statusReason: Browser session storage failed. This revision was not saved; export a copy before continuing.

[Killed] ConditionalExpression
src/vtt/local-session-store.ts:216:38
     }
   })();
   if (trigger === null) return null;
-  if (parsed.pool !== 'per_round' && parsed.pool !== 'encounter_boundary') return null;
+  if (parsed.pool !== 'per_round' && true) return null;
   const decodedRetention = retention(parsed.retention);
   if (decodedRetention.kind !== 'named' &&
killedBy: IndexedDB durable VTT session adapter keeps the first autosave metadata when later snapshots share its session
statusReason: Browser session storage failed. This revision was not saved; export a copy before continuing.

[Killed] ConditionalExpression
src/vtt/local-session-store.ts:216:7
     }
   })();
   if (trigger === null) return null;
-  if (parsed.pool !== 'per_round' && parsed.pool !== 'encounter_boundary') return null;
+  if (true && parsed.pool !== 'encounter_boundary') return null;
   const decodedRetention = retention(parsed.retention);
   if (decodedRetention.kind !== 'named' &&
killedBy: IndexedDB durable VTT session adapter renames, exports, restores, and removes one autosave without touching another session
statusReason: Browser session storage failed. This revision was not saved; export a copy before continuing.

[Killed] ConditionalExpression
src/vtt/local-session-store.ts:218:7
   if (trigger === null) return null;
   if (parsed.pool !== 'per_round' && parsed.pool !== 'encounter_boundary') return null;
   const decodedRetention = retention(parsed.retention);
-  if (decodedRetention.kind !== 'named' &&
-    (decodedRetention.kind !== 'autosave' || decodedRetention.pool !== parsed.pool)) return null;
+  if (false) return null;
   return {
     storageId: parsed.storageId,
killedBy: IndexedDB durable VTT session adapter rejects every malformed legacy autosave field with the exact migration cause
statusReason: promise resolved "IndexedDbBrowserSessionStore{ …(2) }" instead of rejecting

[Killed] ConditionalExpression
src/vtt/local-session-store.ts:218:7
   if (trigger === null) return null;
   if (parsed.pool !== 'per_round' && parsed.pool !== 'encounter_boundary') return null;
   const decodedRetention = retention(parsed.retention);
-  if (decodedRetention.kind !== 'named' &&
+  if (true &&
     (decodedRetention.kind !== 'autosave' || decodedRetention.pool !== parsed.pool)) return null;
   return {
killedBy: IndexedDB durable VTT session adapter preserves a valid named legacy autosave retention
statusReason: Browser session storage failed. This revision was not saved; export a copy before continuing.

[Killed] EqualityOperator
src/vtt/local-session-store.ts:219:46
   if (parsed.pool !== 'per_round' && parsed.pool !== 'encounter_boundary') return null;
   const decodedRetention = retention(parsed.retention);
   if (decodedRetention.kind !== 'named' &&
-    (decodedRetention.kind !== 'autosave' || decodedRetention.pool !== parsed.pool)) return null;
+    (decodedRetention.kind !== 'autosave' || decodedRetention.pool === parsed.pool)) return null;
   return {
     storageId: parsed.storageId,
killedBy: IndexedDB durable VTT session adapter renames, exports, restores, and removes one autosave without touching another session
statusReason: Browser session storage failed. This revision was not saved; export a copy before continuing.

[Killed] ConditionalExpression
src/vtt/local-session-store.ts:219:6
   if (parsed.pool !== 'per_round' && parsed.pool !== 'encounter_boundary') return null;
   const decodedRetention = retention(parsed.retention);
   if (decodedRetention.kind !== 'named' &&
-    (decodedRetention.kind !== 'autosave' || decodedRetention.pool !== parsed.pool)) return null;
+    (true)) return null;
   return {
     storageId: parsed.storageId,
killedBy: IndexedDB durable VTT session adapter renames, exports, restores, and removes one autosave without touching another session
statusReason: Browser session storage failed. This revision was not saved; export a copy before continuing.

[Killed] EqualityOperator
src/vtt/local-session-store.ts:266:11
       await store.#migrateLegacy();
       await store.#preload();
       const removed = store.#pruneAutosaves();
-      if (removed.length > 0) {
+      if (removed.length <= 0) {
         const transaction = database.transaction(snapshotStoreName(), 'readwrite');
         for (const storageId of removed) transaction.objectStore(snapshotStoreName()).delete(storageId);
killedBy: IndexedDB durable VTT session adapter opens the exact default database and stores, and close delegates to IndexedDB
statusReason: expected "transaction" to be called 2 times, but got 3 times

[Killed] BlockStatement
src/vtt/local-session-store.ts:266:31
       await store.#migrateLegacy();
       await store.#preload();
       const removed = store.#pruneAutosaves();
-      if (removed.length > 0) {
-        const transaction = database.transaction(snapshotStoreName(), 'readwrite');
-        for (const storageId of removed) transaction.objectStore(snapshotStoreName()).delete(storageId);
-        await transactionComplete(transaction);
-      }
+      if (removed.length > 0) {}
       return store;
     } catch (error: unknown) {
killedBy: IndexedDB durable VTT session adapter prune_cross_pool retains exactly 10 snapshots in each IndexedDB autosave pool
statusReason: expected [ { …(12) }, { …(12) }, …(48) ] to have a length of 20 but got 50

[Killed] UnaryOperator
src/vtt/local-session-store.ts:280:68
 
   append(revision: SessionRevision): void {
     this.#requireWritable();
-    const previous = this.#memory.revisions(revision.sessionId).at(-1);
+    const previous = this.#memory.revisions(revision.sessionId).at(+1);
     this.#memory.append(revision);
     const current = this.#metadata.get(revision.sessionId);
killedBy: IndexedDB durable VTT session adapter emits exact start, short-rest, room, long-rest, and interruption autosave labels
statusReason: expected [ …(10) ] to deeply equal [ …(6) ]

[Killed] BlockStatement
src/vtt/local-session-store.ts:293:71
     this.#metadata.set(revision.sessionId, metadata);
 
     const added: StoredAutosaveSnapshot[] = [];
-    for (const trigger of this.#autosaveTriggers(previous, revision)) {
-      const snapshot = this.#captureAutosave(revision, trigger);
-      this.#snapshots.set(snapshot.storageId, snapshot);
-      added.push(snapshot);
-    }
+    for (const trigger of this.#autosaveTriggers(previous, revision)) {}
     const removed = this.#pruneAutosaves();
     this.#enqueue('write', async () => {
killedBy: IndexedDB durable VTT session adapter emits exact start, short-rest, room, long-rest, and interruption autosave labels
statusReason: expected [ 'session:autosave-trigger-contract' ] to deeply equal [ Array(1) ]

[Killed] BlockStatement
src/vtt/local-session-store.ts:301:31
     const removed = this.#pruneAutosaves();
     this.#enqueue('write', async () => {
       const stored = await encodedStoredRevision(revision);
-      return (transaction) => {
-        transaction.objectStore(revisionStoreName()).put(stored, revisionKey(revision.sessionId, revision.revision));
-        transaction.objectStore(sessionStoreName()).put(metadata, revision.sessionId);
-        for (const snapshot of added) transaction.objectStore(snapshotStoreName()).put(snapshot, snapshot.storageId);
-        for (const storageId of removed) transaction.objectStore(snapshotStoreName()).delete(storageId);
-      };
+      return (transaction) => {};
     });
   }
killedBy: IndexedDB durable VTT session adapter RELOAD-REHYDRATES-INCREMENT-5-STORE restores committed coordinator state
statusReason: expected null to deeply equal { kind: 'interrupted' }

[Killed] BlockStatement
src/vtt/local-session-store.ts:329:31
         bytes: await encodedStoredRevision(revision),
         key: revisionKey(revision.sessionId, revision.revision),
       })));
-      return (transaction) => {
-        for (const revision of stored) {
-          transaction.objectStore(revisionStoreName()).put(revision.bytes, revision.key);
-        }
-        transaction.objectStore(sessionStoreName()).put(metadata, first.sessionId);
-      };
+      return (transaction) => {};
     });
   }
killedBy: IndexedDB durable VTT session adapter bulk-imports every revision, persists exact keys, and reloads the export
statusReason: expected [] to deeply equal [ …(2) ]

[Killed] BlockStatement
src/vtt/local-session-store.ts:330:40
         key: revisionKey(revision.sessionId, revision.revision),
       })));
       return (transaction) => {
-        for (const revision of stored) {
-          transaction.objectStore(revisionStoreName()).put(revision.bytes, revision.key);
-        }
+        for (const revision of stored) {}
         transaction.objectStore(sessionStoreName()).put(metadata, first.sessionId);
       };
killedBy: IndexedDB durable VTT session adapter bulk-imports every revision, persists exact keys, and reloads the export
statusReason: expected [] to deeply equal [ …(2) ]

[Killed] BlockStatement
src/vtt/local-session-store.ts:342:32
     return this.#memory.revisions(sessionId);
   }
 
-  async flush(): Promise<void> {
-    // Acknowledge the durable high-water mark captured by this call. Writes
-    // published later must not turn one render acknowledgement into an
-    // unbounded drain of a still-moving controller stream.
-    await this.#latestAcknowledgement;
-    if (this.#failure !== null) throw this.#failure;
-  }
+  async flush(): Promise<void> {}
 
   close(): void {
killedBy: IndexedDB durable VTT session adapter bulk-imports every revision, persists exact keys, and reloads the export
statusReason: expected [] to deeply equal [ …(2) ]

[Killed] ConditionalExpression
src/vtt/local-session-store.ts:347:9
     // published later must not turn one render acknowledgement into an
     // unbounded drain of a still-moving controller stream.
     await this.#latestAcknowledgement;
-    if (this.#failure !== null) throw this.#failure;
+    if (true) throw this.#failure;
   }
 
killedBy: IndexedDB durable VTT session adapter bulk-imports every revision, persists exact keys, and reloads the export
statusReason: null

[Killed] EqualityOperator
src/vtt/local-session-store.ts:347:9
     // published later must not turn one render acknowledgement into an
     // unbounded drain of a still-moving controller stream.
     await this.#latestAcknowledgement;
-    if (this.#failure !== null) throw this.#failure;
+    if (this.#failure === null) throw this.#failure;
   }
 
killedBy: IndexedDB durable VTT session adapter bulk-imports every revision, persists exact keys, and reloads the export
statusReason: null

[Killed] BlockStatement
src/vtt/local-session-store.ts:350:17
     if (this.#failure !== null) throw this.#failure;
   }
 
-  close(): void {
-    this.database.close();
-  }
+  close(): void {}
 
   async remove(sessionId: EncounterSessionId): Promise<void> {
killedBy: IndexedDB durable VTT session adapter opens the exact default database and stores, and close delegates to IndexedDB
statusReason: expected "close" to be called once, but got 0 times

[Killed] BlockStatement
src/vtt/local-session-store.ts:354:62
     this.database.close();
   }
 
-  async remove(sessionId: EncounterSessionId): Promise<void> {
-    this.#requireWritable();
-    const revisionCount = this.#memory.revisions(sessionId).length;
-    const snapshotIds = [...this.#snapshots.values()]
-      .filter((snapshot) => snapshot.sessionId === sessionId)
-      .map((snapshot) => snapshot.storageId);
-    await this.#directWrite('delete', async () => {
-      const transaction = this.database.transaction(
-        [revisionStoreName(), sessionStoreName(), snapshotStoreName()],
-        'readwrite',
-      );
-      for (let revision = 1; revision <= revisionCount; revision += 1) {
-        transaction.objectStore(revisionStoreName()).delete(revisionKey(sessionId, revision));
-      }
-      transaction.objectStore(sessionStoreName()).delete(sessionId);
-      for (const storageId of snapshotIds) transaction.objectStore(snapshotStoreName()).delete(storageId);
-      await transactionComplete(transaction);
-    });
-    await this.#preload();
-  }
+  async remove(sessionId: EncounterSessionId): Promise<void> {}
 
   async removeStored(storageId: string, sessionId: EncounterSessionId): Promise<void> {
killedBy: IndexedDB durable VTT session adapter renames, exports, restores, and removes session saves through exact session ids
statusReason: expected [ …(2) ] to deeply equal []

[Killed] MethodExpression
src/vtt/local-session-store.ts:357:25
   async remove(sessionId: EncounterSessionId): Promise<void> {
     this.#requireWritable();
     const revisionCount = this.#memory.revisions(sessionId).length;
-    const snapshotIds = [...this.#snapshots.values()]
-      .filter((snapshot) => snapshot.sessionId === sessionId)
+    const snapshotIds = [...this.#snapshots.values()]
       .map((snapshot) => snapshot.storageId);
     await this.#directWrite('delete', async () => {
killedBy: IndexedDB durable VTT session adapter removes only the selected session snapshots from durable storage
statusReason: expected [] to deeply equal [ ObjectContaining{…} ]

[Killed] EqualityOperator
src/vtt/local-session-store.ts:358:29
     this.#requireWritable();
     const revisionCount = this.#memory.revisions(sessionId).length;
     const snapshotIds = [...this.#snapshots.values()]
-      .filter((snapshot) => snapshot.sessionId === sessionId)
+      .filter((snapshot) => snapshot.sessionId !== sessionId)
       .map((snapshot) => snapshot.storageId);
     await this.#directWrite('delete', async () => {
killedBy: IndexedDB durable VTT session adapter removes only the selected session snapshots from durable storage
statusReason: expected [ { …(12) }, { …(12) } ] to deeply equal [ ObjectContaining{…} ]

[Killed] ConditionalExpression
src/vtt/local-session-store.ts:358:29
     this.#requireWritable();
     const revisionCount = this.#memory.revisions(sessionId).length;
     const snapshotIds = [...this.#snapshots.values()]
-      .filter((snapshot) => snapshot.sessionId === sessionId)
+      .filter((snapshot) => true)
       .map((snapshot) => snapshot.storageId);
     await this.#directWrite('delete', async () => {
killedBy: IndexedDB durable VTT session adapter removes only the selected session snapshots from durable storage
statusReason: expected [] to deeply equal [ ObjectContaining{…} ]

[Killed] BlockStatement
src/vtt/local-session-store.ts:360:51
     const snapshotIds = [...this.#snapshots.values()]
       .filter((snapshot) => snapshot.sessionId === sessionId)
       .map((snapshot) => snapshot.storageId);
-    await this.#directWrite('delete', async () => {
-      const transaction = this.database.transaction(
-        [revisionStoreName(), sessionStoreName(), snapshotStoreName()],
-        'readwrite',
-      );
-      for (let revision = 1; revision <= revisionCount; revision += 1) {
-        transaction.objectStore(revisionStoreName()).delete(revisionKey(sessionId, revision));
-      }
-      transaction.objectStore(sessionStoreName()).delete(sessionId);
-      for (const storageId of snapshotIds) transaction.objectStore(snapshotStoreName()).delete(storageId);
-      await transactionComplete(transaction);
-    });
+    await this.#directWrite('delete', async () => {});
     await this.#preload();
   }
killedBy: IndexedDB durable VTT session adapter renames, exports, restores, and removes session saves through exact session ids
statusReason: expected [ …(2) ] to deeply equal []

[Killed] ConditionalExpression
src/vtt/local-session-store.ts:365:30
         [revisionStoreName(), sessionStoreName(), snapshotStoreName()],
         'readwrite',
       );
-      for (let revision = 1; revision <= revisionCount; revision += 1) {
+      for (let revision = 1; false; revision += 1) {
         transaction.objectStore(revisionStoreName()).delete(revisionKey(sessionId, revision));
       }
killedBy: IndexedDB durable VTT session adapter renames, exports, restores, and removes session saves through exact session ids
statusReason: expected [ …(2) ] to deeply equal []

[Killed] EqualityOperator
src/vtt/local-session-store.ts:365:30
         [revisionStoreName(), sessionStoreName(), snapshotStoreName()],
         'readwrite',
       );
-      for (let revision = 1; revision <= revisionCount; revision += 1) {
+      for (let revision = 1; revision > revisionCount; revision += 1) {
         transaction.objectStore(revisionStoreName()).delete(revisionKey(sessionId, revision));
       }
killedBy: IndexedDB durable VTT session adapter renames, exports, restores, and removes session saves through exact session ids
statusReason: expected [ …(2) ] to deeply equal []

[Killed] BlockStatement
src/vtt/local-session-store.ts:375:87
     await this.#preload();
   }
 
-  async removeStored(storageId: string, sessionId: EncounterSessionId): Promise<void> {
-    if (storageId.startsWith('session:')) {
-      await this.remove(sessionId);
-      return;
-    }
-    await this.#directWrite('delete', async () => {
-      const transaction = this.database.transaction(snapshotStoreName(), 'readwrite');
-      transaction.objectStore(snapshotStoreName()).delete(storageId);
-      await transactionComplete(transaction);
-    });
-    this.#snapshots.delete(storageId);
-  }
+  async removeStored(storageId: string, sessionId: EncounterSessionId): Promise<void> {}
 
   async renameStored(storageId: string, sessionId: EncounterSessionId, name: string): Promise<void> {
killedBy: IndexedDB durable VTT session adapter renames, exports, restores, and removes session saves through exact session ids
statusReason: expected [ …(2) ] to deeply equal []

[Killed] ConditionalExpression
src/vtt/local-session-store.ts:376:9
   }
 
   async removeStored(storageId: string, sessionId: EncounterSessionId): Promise<void> {
-    if (storageId.startsWith('session:')) {
+    if (false) {
       await this.remove(sessionId);
       return;
killedBy: IndexedDB durable VTT session adapter renames, exports, restores, and removes session saves through exact session ids
statusReason: expected [ …(2) ] to deeply equal []

[Killed] BlockStatement
src/vtt/local-session-store.ts:376:43
   }
 
   async removeStored(storageId: string, sessionId: EncounterSessionId): Promise<void> {
-    if (storageId.startsWith('session:')) {
-      await this.remove(sessionId);
-      return;
-    }
+    if (storageId.startsWith('session:')) {}
     await this.#directWrite('delete', async () => {
       const transaction = this.database.transaction(snapshotStoreName(), 'readwrite');
killedBy: IndexedDB durable VTT session adapter renames, exports, restores, and removes session saves through exact session ids
statusReason: expected [ …(2) ] to deeply equal []

[Killed] BlockStatement
src/vtt/local-session-store.ts:380:51
       await this.remove(sessionId);
       return;
     }
-    await this.#directWrite('delete', async () => {
-      const transaction = this.database.transaction(snapshotStoreName(), 'readwrite');
-      transaction.objectStore(snapshotStoreName()).delete(storageId);
-      await transactionComplete(transaction);
-    });
+    await this.#directWrite('delete', async () => {});
     this.#snapshots.delete(storageId);
   }
killedBy: IndexedDB durable VTT session adapter persists snapshot removal and both rename paths across reopen
statusReason: expected true to be false // Object.is equality

[Killed] MethodExpression
src/vtt/local-session-store.ts:389:21
   }
 
   async renameStored(storageId: string, sessionId: EncounterSessionId, name: string): Promise<void> {
-    const trimmed = name.trim();
+    const trimmed = name;
     if (trimmed.length === 0) throw new Error('A save name cannot be empty.');
     if (storageId.startsWith('session:')) {
killedBy: IndexedDB durable VTT session adapter renames, exports, restores, and removes session saves through exact session ids
statusReason: promise resolved "undefined" instead of rejecting

[Killed] EqualityOperator
src/vtt/local-session-store.ts:390:9
 
   async renameStored(storageId: string, sessionId: EncounterSessionId, name: string): Promise<void> {
     const trimmed = name.trim();
-    if (trimmed.length === 0) throw new Error('A save name cannot be empty.');
+    if (trimmed.length !== 0) throw new Error('A save name cannot be empty.');
     if (storageId.startsWith('session:')) {
       const existing = this.#metadata.get(sessionId);
killedBy: IndexedDB durable VTT session adapter renames, exports, restores, and removes session saves through exact session ids
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
src/vtt/local-session-store.ts:390:9
 
   async renameStored(storageId: string, sessionId: EncounterSessionId, name: string): Promise<void> {
     const trimmed = name.trim();
-    if (trimmed.length === 0) throw new Error('A save name cannot be empty.');
+    if (false) throw new Error('A save name cannot be empty.');
     if (storageId.startsWith('session:')) {
       const existing = this.#metadata.get(sessionId);
killedBy: IndexedDB durable VTT session adapter renames, exports, restores, and removes session saves through exact session ids
statusReason: promise resolved "undefined" instead of rejecting

[Killed] MethodExpression
src/vtt/local-session-store.ts:391:9
   async renameStored(storageId: string, sessionId: EncounterSessionId, name: string): Promise<void> {
     const trimmed = name.trim();
     if (trimmed.length === 0) throw new Error('A save name cannot be empty.');
-    if (storageId.startsWith('session:')) {
+    if (storageId.endsWith('session:')) {
       const existing = this.#metadata.get(sessionId);
       if (existing === undefined) throw new Error('Browser save does not exist.');
killedBy: IndexedDB durable VTT session adapter renames, exports, restores, and removes session saves through exact session ids
statusReason: expected [Function] to throw error including 'Browser save does not exist.' but got 'Browser autosave does not exist.'

[Killed] BlockStatement
src/vtt/local-session-store.ts:391:43
   async renameStored(storageId: string, sessionId: EncounterSessionId, name: string): Promise<void> {
     const trimmed = name.trim();
     if (trimmed.length === 0) throw new Error('A save name cannot be empty.');
-    if (storageId.startsWith('session:')) {
-      const existing = this.#metadata.get(sessionId);
-      if (existing === undefined) throw new Error('Browser save does not exist.');
-      const metadata: BrowserSaveMetadata = { ...existing, name: trimmed, retention: { kind: 'named' } };
-      await this.#directWrite('rename', async () => {
-        const transaction = this.database.transaction(sessionStoreName(), 'readwrite');
-        transaction.objectStore(sessionStoreName()).put(metadata, sessionId);
-        await transactionComplete(transaction);
-      });
-      this.#metadata.set(sessionId, metadata);
-      return;
-    }
+    if (storageId.startsWith('session:')) {}
     const existing = this.#snapshots.get(storageId);
     if (existing === undefined || existing.sessionId !== sessionId) {
killedBy: IndexedDB durable VTT session adapter renames, exports, restores, and removes session saves through exact session ids
statusReason: expected [Function] to throw error including 'Browser save does not exist.' but got 'Browser autosave does not exist.'

[Killed] BlockStatement
src/vtt/local-session-store.ts:395:53
       const existing = this.#metadata.get(sessionId);
       if (existing === undefined) throw new Error('Browser save does not exist.');
       const metadata: BrowserSaveMetadata = { ...existing, name: trimmed, retention: { kind: 'named' } };
-      await this.#directWrite('rename', async () => {
-        const transaction = this.database.transaction(sessionStoreName(), 'readwrite');
-        transaction.objectStore(sessionStoreName()).put(metadata, sessionId);
-        await transactionComplete(transaction);
-      });
+      await this.#directWrite('rename', async () => {});
       this.#metadata.set(sessionId, metadata);
       return;
killedBy: IndexedDB durable VTT session adapter persists snapshot removal and both rename paths across reopen
statusReason: expected [ { …(13) }, { …(11) } ] to deeply equal ArrayContaining{…}

[Killed] ConditionalExpression
src/vtt/local-session-store.ts:404:35
       return;
     }
     const existing = this.#snapshots.get(storageId);
-    if (existing === undefined || existing.sessionId !== sessionId) {
+    if (existing === undefined || false) {
       throw new Error('Browser autosave does not exist.');
     }
killedBy: IndexedDB durable VTT session adapter renames, exports, restores, and removes one autosave without touching another session
statusReason: promise resolved "undefined" instead of rejecting

[Killed] EqualityOperator
src/vtt/local-session-store.ts:404:35
       return;
     }
     const existing = this.#snapshots.get(storageId);
-    if (existing === undefined || existing.sessionId !== sessionId) {
+    if (existing === undefined || existing.sessionId === sessionId) {
       throw new Error('Browser autosave does not exist.');
     }
killedBy: IndexedDB durable VTT session adapter renames, exports, restores, and removes one autosave without touching another session
statusReason: promise resolved "undefined" instead of rejecting

[Killed] StringLiteral
src/vtt/local-session-store.ts:405:23
     }
     const existing = this.#snapshots.get(storageId);
     if (existing === undefined || existing.sessionId !== sessionId) {
-      throw new Error('Browser autosave does not exist.');
+      throw new Error("");
     }
     const snapshot: StoredAutosaveSnapshot = { ...existing, name: trimmed, retention: { kind: 'named' } };
killedBy: IndexedDB durable VTT session adapter renames, exports, restores, and removes one autosave without touching another session
statusReason: expected [Function] to throw error including 'Browser autosave does not exist.' but got ''
