[Killed] BlockStatement
src/vtt/local-session-store.ts:408:51
       throw new Error('Browser autosave does not exist.');
     }
     const snapshot: StoredAutosaveSnapshot = { ...existing, name: trimmed, retention: { kind: 'named' } };
-    await this.#directWrite('rename', async () => {
-      const transaction = this.database.transaction(snapshotStoreName(), 'readwrite');
-      transaction.objectStore(snapshotStoreName()).put(snapshot, storageId);
-      await transactionComplete(transaction);
-    });
+    await this.#directWrite('rename', async () => {});
     this.#snapshots.set(storageId, snapshot);
   }
killedBy: IndexedDB durable VTT session adapter persists snapshot removal and both rename paths across reopen
statusReason: expected [ { …(13) }, { …(11) }, { …(11) } ] to deeply equal ArrayContaining{…}

[Killed] BlockStatement
src/vtt/local-session-store.ts:416:88
     this.#snapshots.set(storageId, snapshot);
   }
 
-  async restoreStored(storageId: string, sessionId: EncounterSessionId): Promise<void> {
-    if (storageId.startsWith('session:')) return;
-    const snapshot = this.#snapshots.get(storageId);
-    if (snapshot === undefined || snapshot.sessionId !== sessionId) {
-      throw new Error('Browser autosave does not exist.');
-    }
-    const currentCount = this.#memory.revisions(sessionId).length;
-    const metadata: BrowserSaveMetadata = {
-      sessionId,
-      name: sessionId,
-      updatedAt: snapshot.updatedAt,
-      retention: { kind: 'autosave', pool: snapshot.pool },
-      migrationStatus: this.#metadata.get(sessionId)?.migrationStatus ?? 'native',
-    };
-    await this.#directWrite('restore', async () => {
-      const transaction = this.database.transaction([revisionStoreName(), sessionStoreName()], 'readwrite');
-      for (let revision = snapshot.revisionCount + 1; revision <= currentCount; revision += 1) {
-        transaction.objectStore(revisionStoreName()).delete(revisionKey(sessionId, revision));
-      }
-      transaction.objectStore(sessionStoreName()).put(metadata, sessionId);
-      await transactionComplete(transaction);
-    });
-    await this.#preload();
-  }
+  async restoreStored(storageId: string, sessionId: EncounterSessionId): Promise<void> {}
 
   savedSessions(): readonly StoredBrowserSave[] {
killedBy: IndexedDB durable VTT session adapter renames, exports, restores, and removes one autosave without touching another session
statusReason: expected [ …(3) ] to have a length of 2 but got 3

[Killed] ConditionalExpression
src/vtt/local-session-store.ts:417:9
   }
 
   async restoreStored(storageId: string, sessionId: EncounterSessionId): Promise<void> {
-    if (storageId.startsWith('session:')) return;
+    if (false) return;
     const snapshot = this.#snapshots.get(storageId);
     if (snapshot === undefined || snapshot.sessionId !== sessionId) {
killedBy: IndexedDB durable VTT session adapter renames, exports, restores, and removes session saves through exact session ids
statusReason: Browser autosave does not exist.

[Killed] MethodExpression
src/vtt/local-session-store.ts:417:9
   }
 
   async restoreStored(storageId: string, sessionId: EncounterSessionId): Promise<void> {
-    if (storageId.startsWith('session:')) return;
+    if (storageId.endsWith('session:')) return;
     const snapshot = this.#snapshots.get(storageId);
     if (snapshot === undefined || snapshot.sessionId !== sessionId) {
killedBy: IndexedDB durable VTT session adapter renames, exports, restores, and removes session saves through exact session ids
statusReason: Browser autosave does not exist.

[Killed] ConditionalExpression
src/vtt/local-session-store.ts:419:35
   async restoreStored(storageId: string, sessionId: EncounterSessionId): Promise<void> {
     if (storageId.startsWith('session:')) return;
     const snapshot = this.#snapshots.get(storageId);
-    if (snapshot === undefined || snapshot.sessionId !== sessionId) {
+    if (snapshot === undefined || false) {
       throw new Error('Browser autosave does not exist.');
     }
killedBy: IndexedDB durable VTT session adapter renames, exports, restores, and removes one autosave without touching another session
statusReason: promise resolved "undefined" instead of rejecting

[Killed] EqualityOperator
src/vtt/local-session-store.ts:419:35
   async restoreStored(storageId: string, sessionId: EncounterSessionId): Promise<void> {
     if (storageId.startsWith('session:')) return;
     const snapshot = this.#snapshots.get(storageId);
-    if (snapshot === undefined || snapshot.sessionId !== sessionId) {
+    if (snapshot === undefined || snapshot.sessionId === sessionId) {
       throw new Error('Browser autosave does not exist.');
     }
killedBy: IndexedDB durable VTT session adapter renames, exports, restores, and removes one autosave without touching another session
statusReason: Browser autosave does not exist.

[Killed] BlockStatement
src/vtt/local-session-store.ts:430:52
       retention: { kind: 'autosave', pool: snapshot.pool },
       migrationStatus: this.#metadata.get(sessionId)?.migrationStatus ?? 'native',
     };
-    await this.#directWrite('restore', async () => {
-      const transaction = this.database.transaction([revisionStoreName(), sessionStoreName()], 'readwrite');
-      for (let revision = snapshot.revisionCount + 1; revision <= currentCount; revision += 1) {
-        transaction.objectStore(revisionStoreName()).delete(revisionKey(sessionId, revision));
-      }
-      transaction.objectStore(sessionStoreName()).put(metadata, sessionId);
-      await transactionComplete(transaction);
-    });
+    await this.#directWrite('restore', async () => {});
     await this.#preload();
   }
killedBy: IndexedDB durable VTT session adapter renames, exports, restores, and removes one autosave without touching another session
statusReason: expected [ …(3) ] to have a length of 2 but got 3

[Killed] ArrayDeclaration
src/vtt/local-session-store.ts:431:53
       migrationStatus: this.#metadata.get(sessionId)?.migrationStatus ?? 'native',
     };
     await this.#directWrite('restore', async () => {
-      const transaction = this.database.transaction([revisionStoreName(), sessionStoreName()], 'readwrite');
+      const transaction = this.database.transaction([], 'readwrite');
       for (let revision = snapshot.revisionCount + 1; revision <= currentCount; revision += 1) {
         transaction.objectStore(revisionStoreName()).delete(revisionKey(sessionId, revision));
killedBy: IndexedDB durable VTT session adapter renames, exports, restores, and removes one autosave without touching another session
statusReason: Browser session storage failed. This revision was not saved; export a copy before continuing.

[Killed] ArithmeticOperator
src/vtt/local-session-store.ts:432:27
     };
     await this.#directWrite('restore', async () => {
       const transaction = this.database.transaction([revisionStoreName(), sessionStoreName()], 'readwrite');
-      for (let revision = snapshot.revisionCount + 1; revision <= currentCount; revision += 1) {
+      for (let revision = snapshot.revisionCount - 1; revision <= currentCount; revision += 1) {
         transaction.objectStore(revisionStoreName()).delete(revisionKey(sessionId, revision));
       }
killedBy: IndexedDB durable VTT session adapter renames, exports, restores, and removes one autosave without touching another session
statusReason: expected [] to have a length of 2 but got +0

[Killed] EqualityOperator
src/vtt/local-session-store.ts:432:55
     };
     await this.#directWrite('restore', async () => {
       const transaction = this.database.transaction([revisionStoreName(), sessionStoreName()], 'readwrite');
-      for (let revision = snapshot.revisionCount + 1; revision <= currentCount; revision += 1) {
+      for (let revision = snapshot.revisionCount + 1; revision < currentCount; revision += 1) {
         transaction.objectStore(revisionStoreName()).delete(revisionKey(sessionId, revision));
       }
killedBy: IndexedDB durable VTT session adapter renames, exports, restores, and removes one autosave without touching another session
statusReason: expected [ …(3) ] to have a length of 2 but got 3

[Killed] BlockStatement
src/vtt/local-session-store.ts:443:54
 
   savedSessions(): readonly StoredBrowserSave[] {
     const saves: StoredBrowserSave[] = [];
-    for (const snapshot of this.#snapshots.values()) {
-      saves.push({
-        ...snapshot,
-        migrationStatus: this.#metadata.get(snapshot.sessionId)?.migrationStatus ?? 'native',
-      });
-    }
+    for (const snapshot of this.#snapshots.values()) {}
     const sessionsWithSnapshots = new Set([...this.#snapshots.values()].map((snapshot) => snapshot.sessionId));
     for (const [sessionId, metadata] of this.#metadata) {
killedBy: IndexedDB durable VTT session adapter renames, exports, restores, and removes one autosave without touching another session
statusReason: Expected migrated autosave snapshot.

[Killed] BlockStatement
src/vtt/local-session-store.ts:450:57
       });
     }
     const sessionsWithSnapshots = new Set([...this.#snapshots.values()].map((snapshot) => snapshot.sessionId));
-    for (const [sessionId, metadata] of this.#metadata) {
-      if (sessionsWithSnapshots.has(sessionId) && metadata.retention.kind !== 'named') continue;
-      const bytes = this.exported(sessionId);
-      saves.push({
-        ...decodeSavedSessionFingerprint(bytes),
-        storageId: `session:${sessionId}`,
-        name: metadata.name,
-        updatedAt: metadata.updatedAt,
-        retention: metadata.retention,
-        migrationStatus: metadata.migrationStatus,
-      });
-    }
+    for (const [sessionId, metadata] of this.#metadata) {}
     return saves;
   }
killedBy: IndexedDB durable VTT session adapter renames, exports, restores, and removes session saves through exact session ids
statusReason: expected [] to deeply equal [ ObjectContaining{…} ]

[Killed] ConditionalExpression
src/vtt/local-session-store.ts:451:51
     }
     const sessionsWithSnapshots = new Set([...this.#snapshots.values()].map((snapshot) => snapshot.sessionId));
     for (const [sessionId, metadata] of this.#metadata) {
-      if (sessionsWithSnapshots.has(sessionId) && metadata.retention.kind !== 'named') continue;
+      if (sessionsWithSnapshots.has(sessionId) && true) continue;
       const bytes = this.exported(sessionId);
       saves.push({
killedBy: IndexedDB durable VTT session adapter persists snapshot removal and both rename paths across reopen
statusReason: expected [ { …(13) }, { …(11) } ] to deeply equal ArrayContaining{…}

[Killed] ConditionalExpression
src/vtt/local-session-store.ts:451:11
     }
     const sessionsWithSnapshots = new Set([...this.#snapshots.values()].map((snapshot) => snapshot.sessionId));
     for (const [sessionId, metadata] of this.#metadata) {
-      if (sessionsWithSnapshots.has(sessionId) && metadata.retention.kind !== 'named') continue;
+      if (false) continue;
       const bytes = this.exported(sessionId);
       saves.push({
killedBy: IndexedDB durable VTT session adapter normalizes both historical rest triggers and retains the direct trigger variants
statusReason: expected [ { …(2) }, { …(2) }, { …(2) }, …(11) ] to deeply equal [ { …(2) }, { …(2) }, { …(2) }, …(4) ]

[Killed] StringLiteral
src/vtt/local-session-store.ts:455:20
       const bytes = this.exported(sessionId);
       saves.push({
         ...decodeSavedSessionFingerprint(bytes),
-        storageId: `session:${sessionId}`,
+        storageId: ``,
         name: metadata.name,
         updatedAt: metadata.updatedAt,
killedBy: IndexedDB durable VTT session adapter renames, exports, restores, and removes session saves through exact session ids
statusReason: expected [ { …(11) } ] to deeply equal [ ObjectContaining{…} ]

[Killed] MethodExpression
src/vtt/local-session-store.ts:474:9
   }
 
   exportedStored(storageId: string, sessionId: EncounterSessionId): string {
-    if (storageId.startsWith('session:')) return this.exported(sessionId);
+    if (storageId.endsWith('session:')) return this.exported(sessionId);
     const snapshot = this.#snapshots.get(storageId);
     if (snapshot === undefined || snapshot.sessionId !== sessionId) {
killedBy: IndexedDB durable VTT session adapter renames, exports, restores, and removes session saves through exact session ids
statusReason: Browser autosave does not exist.

[Killed] ConditionalExpression
src/vtt/local-session-store.ts:474:9
   }
 
   exportedStored(storageId: string, sessionId: EncounterSessionId): string {
-    if (storageId.startsWith('session:')) return this.exported(sessionId);
+    if (false) return this.exported(sessionId);
     const snapshot = this.#snapshots.get(storageId);
     if (snapshot === undefined || snapshot.sessionId !== sessionId) {
killedBy: IndexedDB durable VTT session adapter renames, exports, restores, and removes session saves through exact session ids
statusReason: Browser autosave does not exist.

[Killed] StringLiteral
src/vtt/local-session-store.ts:477:23
     if (storageId.startsWith('session:')) return this.exported(sessionId);
     const snapshot = this.#snapshots.get(storageId);
     if (snapshot === undefined || snapshot.sessionId !== sessionId) {
-      throw new Error('Browser autosave does not exist.');
+      throw new Error("");
     }
     return this.#exportPrefix(sessionId, snapshot.revisionCount);
killedBy: IndexedDB durable VTT session adapter renames, exports, restores, and removes one autosave without touching another session
statusReason: expected [Function] to throw error including 'Browser autosave does not exist.' but got ''

[Killed] StringLiteral
src/vtt/local-session-store.ts:484:23
 
   #captureAutosave(revision: SessionRevision, trigger: AutosaveTrigger): StoredAutosaveSnapshot {
     const pool = autosavePoolForTrigger(trigger);
-    const storageId = `${pool}:${revision.sessionId}:${String(revision.revision).padStart(12, '0')}:${trigger}`;
+    const storageId = ``;
     const decoded = decodeSavedSessionFingerprint(this.#exportPrefix(revision.sessionId, revision.revision));
     return {
killedBy: IndexedDB durable VTT session adapter emits exact start, short-rest, room, long-rest, and interruption autosave labels
statusReason: expected [ Array(1) ] to deeply equal [ …(6) ]

[Killed] StringLiteral
src/vtt/local-session-store.ts:484:95
 
   #captureAutosave(revision: SessionRevision, trigger: AutosaveTrigger): StoredAutosaveSnapshot {
     const pool = autosavePoolForTrigger(trigger);
-    const storageId = `${pool}:${revision.sessionId}:${String(revision.revision).padStart(12, '0')}:${trigger}`;
+    const storageId = `${pool}:${revision.sessionId}:${String(revision.revision).padStart(12, "")}:${trigger}`;
     const decoded = decodeSavedSessionFingerprint(this.#exportPrefix(revision.sessionId, revision.revision));
     return {
killedBy: IndexedDB durable VTT session adapter creates one round-boundary snapshot and does not repeat it within the new round
statusReason: expected 'per_round:session:round-boundary-trig…' to contain ':0000000000'

[Killed] EqualityOperator
src/vtt/local-session-store.ts:491:16
       storageId,
       trigger,
       pool,
-      name: `${pool === 'per_round' ? 'Round' : 'Encounter boundary'} — ${trigger.replaceAll('_', ' ')} — r${String(revision.encounterState.round)}`,
+      name: `${pool !== 'per_round' ? 'Round' : 'Encounter boundary'} — ${trigger.replaceAll('_', ' ')} — r${String(revision.encounterState.round)}`,
       updatedAt: new Date().toISOString(),
       retention: { kind: 'autosave', pool },
killedBy: IndexedDB durable VTT session adapter emits exact start, short-rest, room, long-rest, and interruption autosave labels
statusReason: expected [ 'Round — encounter start — r0' ] to deeply equal [ Array(1) ]

[Killed] ConditionalExpression
src/vtt/local-session-store.ts:491:16
       storageId,
       trigger,
       pool,
-      name: `${pool === 'per_round' ? 'Round' : 'Encounter boundary'} — ${trigger.replaceAll('_', ' ')} — r${String(revision.encounterState.round)}`,
+      name: `${false ? 'Round' : 'Encounter boundary'} — ${trigger.replaceAll('_', ' ')} — r${String(revision.encounterState.round)}`,
       updatedAt: new Date().toISOString(),
       retention: { kind: 'autosave', pool },
killedBy: IndexedDB durable VTT session adapter emits exact start, short-rest, room, long-rest, and interruption autosave labels
statusReason: expected [ …(6) ] to deeply equal [ …(6) ]

[Killed] MethodExpression
src/vtt/local-session-store.ts:499:22
 
   #exportPrefix(sessionId: EncounterSessionId, revisionCount: number): string {
     const prefix = new MemoryBrowserSessionStore();
-    prefix.appendAll(this.#memory.revisions(sessionId).slice(0, revisionCount));
+    prefix.appendAll(this.#memory.revisions(sessionId));
     return exportSavedSession(prefix, sessionId);
   }
killedBy: IndexedDB durable VTT session adapter exports only the snapshot prefix after later revisions exist
statusReason: expected '{"fingerprint":"d5854a81d54ea62d5ed04…' to be '{"fingerprint":"8c11095c148124a66d34a…' // Object.is equality

[Killed] BlockStatement
src/vtt/local-session-store.ts:505:70
 
   #pruneAutosaves(): readonly string[] {
     const removed: string[] = [];
-    for (const pool of ['per_round', 'encounter_boundary'] as const) {
-      const expired = [...this.#snapshots.values()]
-        .filter((snapshot) => snapshot.retention.kind === 'autosave' && snapshot.pool === pool)
-        .sort((left, right) => {
-          const newest = Date.parse(right.updatedAt) - Date.parse(left.updatedAt);
-          return newest === 0 ? right.storageId.localeCompare(left.storageId) : newest;
-        })
-        .slice(10);
-      for (const snapshot of expired) {
-        this.#snapshots.delete(snapshot.storageId);
-        removed.push(snapshot.storageId);
-      }
-    }
+    for (const pool of ['per_round', 'encounter_boundary'] as const) {}
     return removed;
   }
killedBy: IndexedDB durable VTT session adapter prunes by timestamp even when storage-id order points the other way
statusReason: expected [ 'timestamp-0', 'timestamp-1', …(10) ] to deeply equal [ Array(10) ]

[Killed] MethodExpression
src/vtt/local-session-store.ts:506:23
   #pruneAutosaves(): readonly string[] {
     const removed: string[] = [];
     for (const pool of ['per_round', 'encounter_boundary'] as const) {
-      const expired = [...this.#snapshots.values()]
-        .filter((snapshot) => snapshot.retention.kind === 'autosave' && snapshot.pool === pool)
-        .sort((left, right) => {
-          const newest = Date.parse(right.updatedAt) - Date.parse(left.updatedAt);
-          return newest === 0 ? right.storageId.localeCompare(left.storageId) : newest;
-        })
-        .slice(10);
+      const expired = [...this.#snapshots.values()].filter(snapshot => snapshot.retention.kind === 'autosave' && snapshot.pool === pool).sort((left, right) => {
+  const newest = Date.parse(right.updatedAt) - Date.parse(left.updatedAt);
+  return newest === 0 ? right.storageId.localeCompare(left.storageId) : newest;
+});
       for (const snapshot of expired) {
         this.#snapshots.delete(snapshot.storageId);
killedBy: IndexedDB durable VTT session adapter renames, exports, restores, and removes one autosave without touching another session
statusReason: promise resolved "undefined" instead of rejecting

[Killed] MethodExpression
src/vtt/local-session-store.ts:506:23
   #pruneAutosaves(): readonly string[] {
     const removed: string[] = [];
     for (const pool of ['per_round', 'encounter_boundary'] as const) {
-      const expired = [...this.#snapshots.values()]
-        .filter((snapshot) => snapshot.retention.kind === 'autosave' && snapshot.pool === pool)
-        .sort((left, right) => {
-          const newest = Date.parse(right.updatedAt) - Date.parse(left.updatedAt);
-          return newest === 0 ? right.storageId.localeCompare(left.storageId) : newest;
-        })
+      const expired = [...this.#snapshots.values()].filter(snapshot => snapshot.retention.kind === 'autosave' && snapshot.pool === pool)
         .slice(10);
       for (const snapshot of expired) {
killedBy: IndexedDB durable VTT session adapter breaks equal-timestamp pruning ties by descending storage id
statusReason: expected [ 'tie-00', 'tie-01', 'tie-02', …(7) ] to deeply equal [ 'tie-02', 'tie-03', 'tie-04', …(7) ]

[Killed] ConditionalExpression
src/vtt/local-session-store.ts:507:31
     const removed: string[] = [];
     for (const pool of ['per_round', 'encounter_boundary'] as const) {
       const expired = [...this.#snapshots.values()]
-        .filter((snapshot) => snapshot.retention.kind === 'autosave' && snapshot.pool === pool)
+        .filter((snapshot) => false)
         .sort((left, right) => {
           const newest = Date.parse(right.updatedAt) - Date.parse(left.updatedAt);
killedBy: IndexedDB durable VTT session adapter prunes by timestamp even when storage-id order points the other way
statusReason: expected [ 'timestamp-0', 'timestamp-1', …(10) ] to deeply equal [ Array(10) ]

[Killed] EqualityOperator
src/vtt/local-session-store.ts:507:31
     const removed: string[] = [];
     for (const pool of ['per_round', 'encounter_boundary'] as const) {
       const expired = [...this.#snapshots.values()]
-        .filter((snapshot) => snapshot.retention.kind === 'autosave' && snapshot.pool === pool)
+        .filter((snapshot) => snapshot.retention.kind !== 'autosave' && snapshot.pool === pool)
         .sort((left, right) => {
           const newest = Date.parse(right.updatedAt) - Date.parse(left.updatedAt);
killedBy: IndexedDB durable VTT session adapter prunes by timestamp even when storage-id order points the other way
statusReason: expected [ 'timestamp-0', 'timestamp-1', …(10) ] to deeply equal [ Array(10) ]

[Killed] ArithmeticOperator
src/vtt/local-session-store.ts:509:26
       const expired = [...this.#snapshots.values()]
         .filter((snapshot) => snapshot.retention.kind === 'autosave' && snapshot.pool === pool)
         .sort((left, right) => {
-          const newest = Date.parse(right.updatedAt) - Date.parse(left.updatedAt);
+          const newest = Date.parse(right.updatedAt) + Date.parse(left.updatedAt);
           return newest === 0 ? right.storageId.localeCompare(left.storageId) : newest;
         })
killedBy: IndexedDB durable VTT session adapter breaks equal-timestamp pruning ties by descending storage id
statusReason: expected [ 'tie-00', 'tie-01', 'tie-02', …(7) ] to deeply equal [ 'tie-02', 'tie-03', 'tie-04', …(7) ]

[Killed] ConditionalExpression
src/vtt/local-session-store.ts:510:18
         .filter((snapshot) => snapshot.retention.kind === 'autosave' && snapshot.pool === pool)
         .sort((left, right) => {
           const newest = Date.parse(right.updatedAt) - Date.parse(left.updatedAt);
-          return newest === 0 ? right.storageId.localeCompare(left.storageId) : newest;
+          return true ? right.storageId.localeCompare(left.storageId) : newest;
         })
         .slice(10);
killedBy: IndexedDB durable VTT session adapter prunes by timestamp even when storage-id order points the other way
statusReason: expected [ 'timestamp-0', 'timestamp-1', …(8) ] to deeply equal [ Array(10) ]

[Killed] ConditionalExpression
src/vtt/local-session-store.ts:510:18
         .filter((snapshot) => snapshot.retention.kind === 'autosave' && snapshot.pool === pool)
         .sort((left, right) => {
           const newest = Date.parse(right.updatedAt) - Date.parse(left.updatedAt);
-          return newest === 0 ? right.storageId.localeCompare(left.storageId) : newest;
+          return false ? right.storageId.localeCompare(left.storageId) : newest;
         })
         .slice(10);
killedBy: IndexedDB durable VTT session adapter breaks equal-timestamp pruning ties by descending storage id
statusReason: expected [ 'tie-00', 'tie-01', 'tie-02', …(7) ] to deeply equal [ 'tie-02', 'tie-03', 'tie-04', …(7) ]

[Killed] BlockStatement
src/vtt/local-session-store.ts:513:39
           return newest === 0 ? right.storageId.localeCompare(left.storageId) : newest;
         })
         .slice(10);
-      for (const snapshot of expired) {
-        this.#snapshots.delete(snapshot.storageId);
-        removed.push(snapshot.storageId);
-      }
+      for (const snapshot of expired) {}
     }
     return removed;
killedBy: IndexedDB durable VTT session adapter prunes by timestamp even when storage-id order points the other way
statusReason: expected [ 'timestamp-0', 'timestamp-1', …(10) ] to deeply equal [ Array(10) ]

[Killed] ConditionalExpression
src/vtt/local-session-store.ts:523:9
 
   #autosaveTriggers(previous: SessionRevision | undefined, revision: SessionRevision): readonly AutosaveTrigger[] {
     const triggers: AutosaveTrigger[] = [];
-    if (revision.transition.kind === 'session_started') triggers.push('encounter_start');
+    if (false) triggers.push('encounter_start');
     if (previous !== undefined && revision.encounterState.round > previous.encounterState.round) {
       triggers.push('round_boundary');
killedBy: IndexedDB durable VTT session adapter emits exact start, short-rest, room, long-rest, and interruption autosave labels
statusReason: expected [ 'session:autosave-trigger-contract' ] to deeply equal [ Array(1) ]

[Killed] EqualityOperator
src/vtt/local-session-store.ts:523:9
 
   #autosaveTriggers(previous: SessionRevision | undefined, revision: SessionRevision): readonly AutosaveTrigger[] {
     const triggers: AutosaveTrigger[] = [];
-    if (revision.transition.kind === 'session_started') triggers.push('encounter_start');
+    if (revision.transition.kind !== 'session_started') triggers.push('encounter_start');
     if (previous !== undefined && revision.encounterState.round > previous.encounterState.round) {
       triggers.push('round_boundary');
killedBy: IndexedDB durable VTT session adapter emits exact start, short-rest, room, long-rest, and interruption autosave labels
statusReason: expected [ 'session:autosave-trigger-contract' ] to deeply equal [ Array(1) ]

[Killed] BlockStatement
src/vtt/local-session-store.ts:524:98
   #autosaveTriggers(previous: SessionRevision | undefined, revision: SessionRevision): readonly AutosaveTrigger[] {
     const triggers: AutosaveTrigger[] = [];
     if (revision.transition.kind === 'session_started') triggers.push('encounter_start');
-    if (previous !== undefined && revision.encounterState.round > previous.encounterState.round) {
-      triggers.push('round_boundary');
-    }
+    if (previous !== undefined && revision.encounterState.round > previous.encounterState.round) {}
     if (revision.transition.kind === 'room_composed') triggers.push('encounter_start');
     if (revision.transition.kind === 'short_rest_completed' || revision.transition.kind === 'long_rest_completed') {
killedBy: IndexedDB durable VTT session adapter emits exact start, short-rest, room, long-rest, and interruption autosave labels
statusReason: expected [ …(5) ] to deeply equal [ …(6) ]

[Killed] ConditionalExpression
src/vtt/local-session-store.ts:524:9
   #autosaveTriggers(previous: SessionRevision | undefined, revision: SessionRevision): readonly AutosaveTrigger[] {
     const triggers: AutosaveTrigger[] = [];
     if (revision.transition.kind === 'session_started') triggers.push('encounter_start');
-    if (previous !== undefined && revision.encounterState.round > previous.encounterState.round) {
+    if (false) {
       triggers.push('round_boundary');
     }
killedBy: IndexedDB durable VTT session adapter emits exact start, short-rest, room, long-rest, and interruption autosave labels
statusReason: expected [ …(5) ] to deeply equal [ …(6) ]

[Killed] ConditionalExpression
src/vtt/local-session-store.ts:527:9
     if (previous !== undefined && revision.encounterState.round > previous.encounterState.round) {
       triggers.push('round_boundary');
     }
-    if (revision.transition.kind === 'room_composed') triggers.push('encounter_start');
+    if (false) triggers.push('encounter_start');
     if (revision.transition.kind === 'short_rest_completed' || revision.transition.kind === 'long_rest_completed') {
       triggers.push('rest_boundary');
killedBy: IndexedDB durable VTT session adapter emits exact start, short-rest, room, long-rest, and interruption autosave labels
statusReason: expected [ …(5) ] to deeply equal [ …(6) ]

[Killed] ConditionalExpression
src/vtt/local-session-store.ts:527:9
     if (previous !== undefined && revision.encounterState.round > previous.encounterState.round) {
       triggers.push('round_boundary');
     }
-    if (revision.transition.kind === 'room_composed') triggers.push('encounter_start');
+    if (true) triggers.push('encounter_start');
     if (revision.transition.kind === 'short_rest_completed' || revision.transition.kind === 'long_rest_completed') {
       triggers.push('rest_boundary');
killedBy: IndexedDB durable VTT session adapter emits exact start, short-rest, room, long-rest, and interruption autosave labels
statusReason: expected [ …(11) ] to deeply equal [ …(6) ]

[Killed] ConditionalExpression
src/vtt/local-session-store.ts:528:9
       triggers.push('round_boundary');
     }
     if (revision.transition.kind === 'room_composed') triggers.push('encounter_start');
-    if (revision.transition.kind === 'short_rest_completed' || revision.transition.kind === 'long_rest_completed') {
+    if (true) {
       triggers.push('rest_boundary');
     }
killedBy: IndexedDB durable VTT session adapter emits exact start, short-rest, room, long-rest, and interruption autosave labels
statusReason: expected [ …(2) ] to deeply equal [ Array(1) ]
