[Killed] EqualityOperator
src/vtt/local-session-store.ts:528:64
       triggers.push('round_boundary');
     }
     if (revision.transition.kind === 'room_composed') triggers.push('encounter_start');
-    if (revision.transition.kind === 'short_rest_completed' || revision.transition.kind === 'long_rest_completed') {
+    if (revision.transition.kind === 'short_rest_completed' || revision.transition.kind !== 'long_rest_completed') {
       triggers.push('rest_boundary');
     }
killedBy: IndexedDB durable VTT session adapter emits exact start, short-rest, room, long-rest, and interruption autosave labels
statusReason: expected [ …(2) ] to deeply equal [ Array(1) ]

[Killed] EqualityOperator
src/vtt/local-session-store.ts:531:64
     if (revision.transition.kind === 'short_rest_completed' || revision.transition.kind === 'long_rest_completed') {
       triggers.push('rest_boundary');
     }
-    if (revision.transition.kind === 'party_state_captured' && revision.transition.restInterruption !== undefined) {
+    if (revision.transition.kind === 'party_state_captured' && revision.transition.restInterruption === undefined) {
       triggers.push('rest_interruption');
     }
killedBy: IndexedDB durable VTT session adapter emits exact start, short-rest, room, long-rest, and interruption autosave labels
statusReason: expected [ …(7) ] to deeply equal [ …(6) ]

[Killed] ConditionalExpression
src/vtt/local-session-store.ts:531:9
     if (revision.transition.kind === 'short_rest_completed' || revision.transition.kind === 'long_rest_completed') {
       triggers.push('rest_boundary');
     }
-    if (revision.transition.kind === 'party_state_captured' && revision.transition.restInterruption !== undefined) {
+    if (false) {
       triggers.push('rest_interruption');
     }
killedBy: IndexedDB durable VTT session adapter emits exact start, short-rest, room, long-rest, and interruption autosave labels
statusReason: expected [ …(5) ] to deeply equal [ …(6) ]

[Killed] BlockStatement
src/vtt/local-session-store.ts:534:33
     if (revision.transition.kind === 'party_state_captured' && revision.transition.restInterruption !== undefined) {
       triggers.push('rest_interruption');
     }
-    if (previous !== undefined) {
-      if (encounterConclusionAfter(previous.encounterState, revision.encounterState) !== null) {
-        triggers.push('encounter_end');
-      }
-    }
+    if (previous !== undefined) {}
     return [...new Set(triggers)];
   }
killedBy: IndexedDB durable VTT session adapter rest interruption mid-fight has its own boundary label and only actual victory ends the encounter
statusReason: expected [ …(2) ] to include 'Encounter boundary — encounter end — …'

[Killed] BlockStatement
src/vtt/local-session-store.ts:535:96
       triggers.push('rest_interruption');
     }
     if (previous !== undefined) {
-      if (encounterConclusionAfter(previous.encounterState, revision.encounterState) !== null) {
-        triggers.push('encounter_end');
-      }
+      if (encounterConclusionAfter(previous.encounterState, revision.encounterState) !== null) {}
     }
     return [...new Set(triggers)];
killedBy: IndexedDB durable VTT session adapter rest interruption mid-fight has its own boundary label and only actual victory ends the encounter
statusReason: expected [ …(2) ] to include 'Encounter boundary — encounter end — …'

[Killed] EqualityOperator
src/vtt/local-session-store.ts:535:11
       triggers.push('rest_interruption');
     }
     if (previous !== undefined) {
-      if (encounterConclusionAfter(previous.encounterState, revision.encounterState) !== null) {
+      if (encounterConclusionAfter(previous.encounterState, revision.encounterState) === null) {
         triggers.push('encounter_end');
       }
killedBy: IndexedDB durable VTT session adapter emits exact start, short-rest, room, long-rest, and interruption autosave labels
statusReason: expected [ …(11) ] to deeply equal [ …(6) ]

[Killed] ArrayDeclaration
src/vtt/local-session-store.ts:539:12
         triggers.push('encounter_end');
       }
     }
-    return [...new Set(triggers)];
+    return [];
   }
 
killedBy: IndexedDB durable VTT session adapter emits exact start, short-rest, room, long-rest, and interruption autosave labels
statusReason: expected [ 'session:autosave-trigger-contract' ] to deeply equal [ Array(1) ]

[Killed] BlockStatement
src/vtt/local-session-store.ts:545:11
   #enqueue(
     operation: BrowserSessionWriteError['operation'],
     prepare: () => Promise<(transaction: IDBTransaction) => void>,
-  ): void {
-    let acknowledge = (): void => undefined;
-    const acknowledgement = new Promise<void>((resolve) => {
-      acknowledge = resolve;
-    });
-    this.#latestAcknowledgement = acknowledgement;
-    this.#queuedWrites.push({ operation, prepare, acknowledge });
-    this.#scheduleQueuedWrite();
-  }
+  ): void {}
 
   #scheduleQueuedWrite(): void {
killedBy: IndexedDB durable VTT session adapter bulk-imports every revision, persists exact keys, and reloads the export
statusReason: expected [] to deeply equal [ …(2) ]

[Killed] BlockStatement
src/vtt/local-session-store.ts:547:60
     prepare: () => Promise<(transaction: IDBTransaction) => void>,
   ): void {
     let acknowledge = (): void => undefined;
-    const acknowledgement = new Promise<void>((resolve) => {
-      acknowledge = resolve;
-    });
+    const acknowledgement = new Promise<void>((resolve) => {});
     this.#latestAcknowledgement = acknowledgement;
     this.#queuedWrites.push({ operation, prepare, acknowledge });
killedBy: IndexedDB durable VTT session adapter bulk-imports every revision, persists exact keys, and reloads the export
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/vtt/local-session-store.ts:556:9
   }
 
   #scheduleQueuedWrite(): void {
-    if (this.#scheduledWrite !== null) return;
+    if (true) return;
     let writes: QueuedBrowserWrite[] = [];
     const pending = new Promise<void>((resolve) => {
killedBy: IndexedDB durable VTT session adapter bulk-imports every revision, persists exact keys, and reloads the export
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] EqualityOperator
src/vtt/local-session-store.ts:556:9
   }
 
   #scheduleQueuedWrite(): void {
-    if (this.#scheduledWrite !== null) return;
+    if (this.#scheduledWrite === null) return;
     let writes: QueuedBrowserWrite[] = [];
     const pending = new Promise<void>((resolve) => {
killedBy: IndexedDB durable VTT session adapter bulk-imports every revision, persists exact keys, and reloads the export
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/vtt/local-session-store.ts:558:52
   #scheduleQueuedWrite(): void {
     if (this.#scheduledWrite !== null) return;
     let writes: QueuedBrowserWrite[] = [];
-    const pending = new Promise<void>((resolve) => {
-      globalThis.setTimeout(resolve, 0);
-    }).then(async () => {
+    const pending = new Promise<void>((resolve) => {}).then(async () => {
       writes = this.#queuedWrites.splice(0);
       const prepared = await Promise.all(writes.map(async (queued) => queued.prepare()));
killedBy: IndexedDB durable VTT session adapter bulk-imports every revision, persists exact keys, and reloads the export
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/vtt/local-session-store.ts:560:25
     let writes: QueuedBrowserWrite[] = [];
     const pending = new Promise<void>((resolve) => {
       globalThis.setTimeout(resolve, 0);
-    }).then(async () => {
-      writes = this.#queuedWrites.splice(0);
-      const prepared = await Promise.all(writes.map(async (queued) => queued.prepare()));
-      const transaction = this.database.transaction(
-        [revisionStoreName(), sessionStoreName(), snapshotStoreName()],
-        'readwrite',
-      );
-      for (const write of prepared) write(transaction);
-      await transactionComplete(transaction);
-      for (const queued of writes) queued.acknowledge();
-    }).catch((error: unknown) => {
+    }).then(async () => {}).catch((error: unknown) => {
       const operation = writes[0]?.operation ?? this.#queuedWrites[0]?.operation ?? 'write';
       this.#failure ??= storageError(operation, error);
killedBy: IndexedDB durable VTT session adapter bulk-imports every revision, persists exact keys, and reloads the export
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/vtt/local-session-store.ts:570:34
       for (const write of prepared) write(transaction);
       await transactionComplete(transaction);
       for (const queued of writes) queued.acknowledge();
-    }).catch((error: unknown) => {
-      const operation = writes[0]?.operation ?? this.#queuedWrites[0]?.operation ?? 'write';
-      this.#failure ??= storageError(operation, error);
-      for (const queued of writes) queued.acknowledge();
-      for (const queued of this.#queuedWrites.splice(0)) queued.acknowledge();
-    });
+    }).catch((error: unknown) => {});
     this.#scheduledWrite = pending;
     void pending.finally(() => {
killedBy: IndexedDB durable VTT session adapter write_error_swallowed returns a typed quota failure from the flush acknowledgement
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] AssignmentOperator
src/vtt/local-session-store.ts:572:7
       for (const queued of writes) queued.acknowledge();
     }).catch((error: unknown) => {
       const operation = writes[0]?.operation ?? this.#queuedWrites[0]?.operation ?? 'write';
-      this.#failure ??= storageError(operation, error);
+      this.#failure &&= storageError(operation, error);
       for (const queued of writes) queued.acknowledge();
       for (const queued of this.#queuedWrites.splice(0)) queued.acknowledge();
killedBy: IndexedDB durable VTT session adapter write_error_swallowed returns a typed quota failure from the flush acknowledgement
statusReason: expected undefined to match object { …(5) }

[Killed] BlockStatement
src/vtt/local-session-store.ts:577:32
       for (const queued of this.#queuedWrites.splice(0)) queued.acknowledge();
     });
     this.#scheduledWrite = pending;
-    void pending.finally(() => {
-      this.#scheduledWrite = null;
-      if (this.#queuedWrites.length > 0 && this.#failure === null) {
-        this.#scheduleQueuedWrite();
-      }
-    });
+    void pending.finally(() => {});
   }
 
killedBy: IndexedDB durable VTT session adapter emits exact start, short-rest, room, long-rest, and interruption autosave labels
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] EqualityOperator
src/vtt/local-session-store.ts:579:11
     this.#scheduledWrite = pending;
     void pending.finally(() => {
       this.#scheduledWrite = null;
-      if (this.#queuedWrites.length > 0 && this.#failure === null) {
+      if (this.#queuedWrites.length >= 0 && this.#failure === null) {
         this.#scheduleQueuedWrite();
       }
killedBy: IndexedDB durable VTT session adapter batches synchronous journal appends into one IndexedDB transaction before flush acknowledgement
statusReason: expected "transaction" to be called 1 times, but got 9 times

[Killed] BlockStatement
src/vtt/local-session-store.ts:579:68
     this.#scheduledWrite = pending;
     void pending.finally(() => {
       this.#scheduledWrite = null;
-      if (this.#queuedWrites.length > 0 && this.#failure === null) {
-        this.#scheduleQueuedWrite();
-      }
+      if (this.#queuedWrites.length > 0 && this.#failure === null) {}
     });
   }
killedBy: IndexedDB durable VTT session adapter creates one round-boundary snapshot and does not repeat it within the new round
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/vtt/local-session-store.ts:585:115
     });
   }
 
-  async #directWrite(operation: BrowserSessionWriteError['operation'], write: () => Promise<void>): Promise<void> {
-    await this.flush();
-    try {
-      await write();
-    } catch (error: unknown) {
-      this.#failure ??= storageError(operation, error);
-      throw this.#failure;
-    }
-  }
+  async #directWrite(operation: BrowserSessionWriteError['operation'], write: () => Promise<void>): Promise<void> {}
 
   #requireWritable(): void {
killedBy: IndexedDB durable VTT session adapter renames, exports, restores, and removes session saves through exact session ids
statusReason: expected [ …(2) ] to deeply equal []

[Killed] BlockStatement
src/vtt/local-session-store.ts:587:9
 
   async #directWrite(operation: BrowserSessionWriteError['operation'], write: () => Promise<void>): Promise<void> {
     await this.flush();
-    try {
-      await write();
-    } catch (error: unknown) {
+    try {} catch (error: unknown) {
       this.#failure ??= storageError(operation, error);
       throw this.#failure;
killedBy: IndexedDB durable VTT session adapter renames, exports, restores, and removes session saves through exact session ids
statusReason: expected [ …(2) ] to deeply equal []

[Killed] BlockStatement
src/vtt/local-session-store.ts:589:30
     await this.flush();
     try {
       await write();
-    } catch (error: unknown) {
-      this.#failure ??= storageError(operation, error);
-      throw this.#failure;
-    }
+    } catch (error: unknown) {}
   }
 
killedBy: IndexedDB durable VTT session adapter turns direct IndexedDB failures into a sticky typed operation failure
statusReason: promise resolved "undefined" instead of rejecting

[Killed] AssignmentOperator
src/vtt/local-session-store.ts:590:7
     try {
       await write();
     } catch (error: unknown) {
-      this.#failure ??= storageError(operation, error);
+      this.#failure &&= storageError(operation, error);
       throw this.#failure;
     }
killedBy: IndexedDB durable VTT session adapter turns direct IndexedDB failures into a sticky typed operation failure
statusReason: expected null to match object { …(4) }

[Killed] BlockStatement
src/vtt/local-session-store.ts:595:28
     }
   }
 
-  #requireWritable(): void {
-    if (this.#failure !== null) throw this.#failure;
-  }
+  #requireWritable(): void {}
 
   async #preload(): Promise<void> {
killedBy: IndexedDB durable VTT session adapter write_error_swallowed returns a typed quota failure from the flush acknowledgement
statusReason: expected function to throw an error, but it didn't

[Killed] ConditionalExpression
src/vtt/local-session-store.ts:596:9
   }
 
   #requireWritable(): void {
-    if (this.#failure !== null) throw this.#failure;
+    if (true) throw this.#failure;
   }
 
killedBy: IndexedDB durable VTT session adapter bulk-imports every revision, persists exact keys, and reloads the export
statusReason: null

[Killed] EqualityOperator
src/vtt/local-session-store.ts:596:9
   }
 
   #requireWritable(): void {
-    if (this.#failure !== null) throw this.#failure;
+    if (this.#failure === null) throw this.#failure;
   }
 
killedBy: IndexedDB durable VTT session adapter bulk-imports every revision, persists exact keys, and reloads the export
statusReason: null

[Killed] BlockStatement
src/vtt/local-session-store.ts:614:8
     const bySession = new Map<EncounterSessionId, SessionRevision[]>();
     for (const revision of await Promise.all(
       (revisions as unknown[]).map(async (value) => decodedStoredRevision(value)),
-    )) {
-      const current = bySession.get(revision.sessionId) ?? [];
-      current.push(revision);
-      bySession.set(revision.sessionId, current);
-    }
+    )) {}
     for (const stream of bySession.values()) {
       stream.sort((left, right) => left.revision - right.revision);
killedBy: IndexedDB durable VTT session adapter bulk-imports every revision, persists exact keys, and reloads the export
statusReason: expected [] to deeply equal [ 1, 2 ]

[Killed] BlockStatement
src/vtt/local-session-store.ts:619:46
       current.push(revision);
       bySession.set(revision.sessionId, current);
     }
-    for (const stream of bySession.values()) {
-      stream.sort((left, right) => left.revision - right.revision);
-      nextMemory.appendAll(stream);
-    }
+    for (const stream of bySession.values()) {}
     this.#memory = nextMemory;
     this.#metadata.clear();
killedBy: IndexedDB durable VTT session adapter bulk-imports every revision, persists exact keys, and reloads the export
statusReason: expected [] to deeply equal [ 1, 2 ]

[Killed] MethodExpression
src/vtt/local-session-store.ts:620:7
       bySession.set(revision.sessionId, current);
     }
     for (const stream of bySession.values()) {
-      stream.sort((left, right) => left.revision - right.revision);
+      stream;
       nextMemory.appendAll(stream);
     }
killedBy: IndexedDB durable VTT session adapter sorts preloaded revisions by revision number rather than IndexedDB key order
statusReason: Browser session storage failed. This revision was not saved; export a copy before continuing.

[Killed] ArithmeticOperator
src/vtt/local-session-store.ts:620:36
       bySession.set(revision.sessionId, current);
     }
     for (const stream of bySession.values()) {
-      stream.sort((left, right) => left.revision - right.revision);
+      stream.sort((left, right) => left.revision + right.revision);
       nextMemory.appendAll(stream);
     }
killedBy: IndexedDB durable VTT session adapter sorts preloaded revisions by revision number rather than IndexedDB key order
statusReason: Browser session storage failed. This revision was not saved; export a copy before continuing.

[Killed] ConditionalExpression
src/vtt/local-session-store.ts:632:39
 
   async #migrateLegacy(): Promise<void> {
     const keys = Array.from({ length: this.legacyStorage.length }, (_unused, index) => this.legacyStorage.key(index))
-      .filter((key): key is string => key !== null);
+      .filter((key): key is string => true);
     for (const key of keys.filter((candidate) => candidate.startsWith(LEGACY_SESSION_PREFIX))) {
       const bytes = this.legacyStorage.getItem(key);
killedBy: IndexedDB durable VTT session adapter ignores sparse and unrelated legacy-storage keys
statusReason: Browser session storage failed. This revision was not saved; export a copy before continuing.

[Killed] EqualityOperator
src/vtt/local-session-store.ts:632:39
 
   async #migrateLegacy(): Promise<void> {
     const keys = Array.from({ length: this.legacyStorage.length }, (_unused, index) => this.legacyStorage.key(index))
-      .filter((key): key is string => key !== null);
+      .filter((key): key is string => key === null);
     for (const key of keys.filter((candidate) => candidate.startsWith(LEGACY_SESSION_PREFIX))) {
       const bytes = this.legacyStorage.getItem(key);
killedBy: IndexedDB durable VTT session adapter renames, exports, restores, and removes one autosave without touching another session
statusReason: Expected migrated autosave snapshot.

[Killed] ArrowFunction
src/vtt/local-session-store.ts:633:35
   async #migrateLegacy(): Promise<void> {
     const keys = Array.from({ length: this.legacyStorage.length }, (_unused, index) => this.legacyStorage.key(index))
       .filter((key): key is string => key !== null);
-    for (const key of keys.filter((candidate) => candidate.startsWith(LEGACY_SESSION_PREFIX))) {
+    for (const key of keys.filter(() => undefined)) {
       const bytes = this.legacyStorage.getItem(key);
       if (bytes === null) continue;
killedBy: IndexedDB durable VTT session adapter falls back safely for malformed legacy metadata 0
statusReason: expected [] to deeply equal [ ObjectContaining{…} ]

[Killed] MethodExpression
src/vtt/local-session-store.ts:633:50
   async #migrateLegacy(): Promise<void> {
     const keys = Array.from({ length: this.legacyStorage.length }, (_unused, index) => this.legacyStorage.key(index))
       .filter((key): key is string => key !== null);
-    for (const key of keys.filter((candidate) => candidate.startsWith(LEGACY_SESSION_PREFIX))) {
+    for (const key of keys.filter((candidate) => candidate.endsWith(LEGACY_SESSION_PREFIX))) {
       const bytes = this.legacyStorage.getItem(key);
       if (bytes === null) continue;
killedBy: IndexedDB durable VTT session adapter falls back safely for malformed legacy metadata 0
statusReason: expected [] to deeply equal [ ObjectContaining{…} ]

[Killed] ConditionalExpression
src/vtt/local-session-store.ts:639:11
       const sessionId = key.slice(LEGACY_SESSION_PREFIX.length) as EncounterSessionId;
       const imported = new MemoryBrowserSessionStore();
       const decodedSessionId = importSavedSession(imported, bytes);
-      if (decodedSessionId !== sessionId) throw new Error('Stored VTT session identity does not match its storage key.');
+      if (false) throw new Error('Stored VTT session identity does not match its storage key.');
       const storedMetadata = legacyMetadata(
         this.legacyStorage.getItem(`${LEGACY_METADATA_PREFIX}${sessionId}`),
killedBy: IndexedDB durable VTT session adapter rejects a legacy session whose embedded identity differs from its storage key
statusReason: promise resolved "IndexedDbBrowserSessionStore{ …(2) }" instead of rejecting

[Killed] EqualityOperator
src/vtt/local-session-store.ts:639:11
       const sessionId = key.slice(LEGACY_SESSION_PREFIX.length) as EncounterSessionId;
       const imported = new MemoryBrowserSessionStore();
       const decodedSessionId = importSavedSession(imported, bytes);
-      if (decodedSessionId !== sessionId) throw new Error('Stored VTT session identity does not match its storage key.');
+      if (decodedSessionId === sessionId) throw new Error('Stored VTT session identity does not match its storage key.');
       const storedMetadata = legacyMetadata(
         this.legacyStorage.getItem(`${LEGACY_METADATA_PREFIX}${sessionId}`),
killedBy: IndexedDB durable VTT session adapter falls back safely for malformed legacy metadata 0
statusReason: Browser session storage failed. This revision was not saved; export a copy before continuing.

[Killed] StringLiteral
src/vtt/local-session-store.ts:641:36
       const decodedSessionId = importSavedSession(imported, bytes);
       if (decodedSessionId !== sessionId) throw new Error('Stored VTT session identity does not match its storage key.');
       const storedMetadata = legacyMetadata(
-        this.legacyStorage.getItem(`${LEGACY_METADATA_PREFIX}${sessionId}`),
+        this.legacyStorage.getItem(``),
         sessionId,
       );
killedBy: IndexedDB durable VTT session adapter decodes legacy retention 0 as 0
statusReason: expected { kind: 'autosave', pool: 'per_round' } to deeply equal { kind: 'named' }

[Killed] ConditionalExpression
src/vtt/local-session-store.ts:644:35
         this.legacyStorage.getItem(`${LEGACY_METADATA_PREFIX}${sessionId}`),
         sessionId,
       );
-      const explicitlyTruncated = this.legacyStorage.getItem(`${LEGACY_TRUNCATED_PREFIX}${sessionId}`) !== null;
+      const explicitlyTruncated = false;
       const metadata: BrowserSaveMetadata = {
         sessionId,
killedBy: IndexedDB durable VTT session adapter truncated_marked_complete preserves a quota-truncated prefix and flags it
statusReason: expected [ { …(11) } ] to deeply equal [ ObjectContaining{…} ]

[Killed] EqualityOperator
src/vtt/local-session-store.ts:644:35
         this.legacyStorage.getItem(`${LEGACY_METADATA_PREFIX}${sessionId}`),
         sessionId,
       );
-      const explicitlyTruncated = this.legacyStorage.getItem(`${LEGACY_TRUNCATED_PREFIX}${sessionId}`) !== null;
+      const explicitlyTruncated = this.legacyStorage.getItem(`${LEGACY_TRUNCATED_PREFIX}${sessionId}`) === null;
       const metadata: BrowserSaveMetadata = {
         sessionId,
killedBy: IndexedDB durable VTT session adapter MIGRATION-COPY-BEFORE-DELETE moves legacy localStorage and is idempotent
statusReason: expected [ { …(11) } ] to deeply equal [ ObjectContaining{…} ]

[Killed] LogicalOperator
src/vtt/local-session-store.ts:650:26
         name: storedMetadata?.name ?? sessionId,
         updatedAt: storedMetadata?.updatedAt ?? new Date(0).toISOString(),
         retention: storedMetadata?.retention ?? { kind: 'autosave', pool: 'per_round' },
-        migrationStatus: explicitlyTruncated || bytes.length >= LIKELY_LOCAL_STORAGE_LIMIT_BYTES
+        migrationStatus: explicitlyTruncated && bytes.length >= LIKELY_LOCAL_STORAGE_LIMIT_BYTES
           ? 'truncated'
           : 'complete',
killedBy: IndexedDB durable VTT session adapter truncated_marked_complete preserves a quota-truncated prefix and flags it
statusReason: expected [ { …(11) } ] to deeply equal [ ObjectContaining{…} ]

[Killed] EqualityOperator
src/vtt/local-session-store.ts:650:49
         name: storedMetadata?.name ?? sessionId,
         updatedAt: storedMetadata?.updatedAt ?? new Date(0).toISOString(),
         retention: storedMetadata?.retention ?? { kind: 'autosave', pool: 'per_round' },
-        migrationStatus: explicitlyTruncated || bytes.length >= LIKELY_LOCAL_STORAGE_LIMIT_BYTES
+        migrationStatus: explicitlyTruncated || bytes.length < LIKELY_LOCAL_STORAGE_LIMIT_BYTES
           ? 'truncated'
           : 'complete',
killedBy: IndexedDB durable VTT session adapter MIGRATION-COPY-BEFORE-DELETE moves legacy localStorage and is idempotent
statusReason: expected [ { …(11) } ] to deeply equal [ ObjectContaining{…} ]

[Killed] ArrayDeclaration
src/vtt/local-session-store.ts:658:53
         bytes: await encodedStoredRevision(revision),
         key: revisionKey(sessionId, revision.revision),
       })));
-      const transaction = this.database.transaction([revisionStoreName(), sessionStoreName()], 'readwrite');
+      const transaction = this.database.transaction([], 'readwrite');
       for (const revision of storedRevisions) {
         transaction.objectStore(revisionStoreName()).put(revision.bytes, revision.key);
killedBy: IndexedDB durable VTT session adapter falls back safely for malformed legacy metadata 0
statusReason: Browser session storage failed. This revision was not saved; export a copy before continuing.

[Killed] BlockStatement
src/vtt/local-session-store.ts:659:47
         key: revisionKey(sessionId, revision.revision),
       })));
       const transaction = this.database.transaction([revisionStoreName(), sessionStoreName()], 'readwrite');
-      for (const revision of storedRevisions) {
-        transaction.objectStore(revisionStoreName()).put(revision.bytes, revision.key);
-      }
+      for (const revision of storedRevisions) {}
       transaction.objectStore(sessionStoreName()).put(metadata, sessionId);
       await transactionComplete(transaction);
killedBy: IndexedDB durable VTT session adapter falls back safely for malformed legacy metadata 0
statusReason: Encounter session does not exist.

[Killed] StringLiteral
src/vtt/local-session-store.ts:666:37
       await transactionComplete(transaction);
       this.legacyStorage.removeItem(key);
       this.legacyStorage.removeItem(`${LEGACY_METADATA_PREFIX}${sessionId}`);
-      this.legacyStorage.removeItem(`${LEGACY_TRUNCATED_PREFIX}${sessionId}`);
+      this.legacyStorage.removeItem(``);
     }
 
killedBy: IndexedDB durable VTT session adapter truncated_marked_complete preserves a quota-truncated prefix and flags it
statusReason: expected 'quota-exceeded' to be null

[Killed] MethodExpression
src/vtt/local-session-store.ts:669:50
       this.legacyStorage.removeItem(`${LEGACY_TRUNCATED_PREFIX}${sessionId}`);
     }
 
-    for (const key of keys.filter((candidate) => candidate.startsWith(legacyAutosavePrefix()))) {
+    for (const key of keys.filter((candidate) => candidate.endsWith(legacyAutosavePrefix()))) {
       const raw = this.legacyStorage.getItem(key);
       if (raw === null) continue;
killedBy: IndexedDB durable VTT session adapter renames, exports, restores, and removes one autosave without touching another session
statusReason: Expected migrated autosave snapshot.

[Killed] ArrowFunction
src/vtt/local-session-store.ts:669:35
       this.legacyStorage.removeItem(`${LEGACY_TRUNCATED_PREFIX}${sessionId}`);
     }
 
-    for (const key of keys.filter((candidate) => candidate.startsWith(legacyAutosavePrefix()))) {
+    for (const key of keys.filter(() => undefined)) {
       const raw = this.legacyStorage.getItem(key);
       if (raw === null) continue;
killedBy: IndexedDB durable VTT session adapter renames, exports, restores, and removes one autosave without touching another session
statusReason: Expected migrated autosave snapshot.
