[Killed] BlockStatement
src/vtt/local-session-store.ts:695:47
         [revisionStoreName(), sessionStoreName(), snapshotStoreName()],
         'readwrite',
       );
-      for (const revision of storedRevisions) {
-        transaction.objectStore(revisionStoreName()).put(revision.bytes, revision.key);
-      }
+      for (const revision of storedRevisions) {}
       if (existingMetadata === null) {
         transaction.objectStore(sessionStoreName()).put({
killedBy: IndexedDB durable VTT session adapter renames, exports, restores, and removes one autosave without touching another session
statusReason: Encounter session does not exist.

[Killed] BlockStatement
src/vtt/local-session-store.ts:698:38
       for (const revision of storedRevisions) {
         transaction.objectStore(revisionStoreName()).put(revision.bytes, revision.key);
       }
-      if (existingMetadata === null) {
-        transaction.objectStore(sessionStoreName()).put({
-          sessionId: legacy.sessionId,
-          name: legacy.sessionId,
-          updatedAt: legacy.updatedAt,
-          retention: { kind: 'autosave', pool: legacy.pool },
-          migrationStatus: legacy.bytes.length >= LIKELY_LOCAL_STORAGE_LIMIT_BYTES ? 'truncated' : 'complete',
-        } satisfies BrowserSaveMetadata, legacy.sessionId);
-      }
+      if (existingMetadata === null) {}
       transaction.objectStore(snapshotStoreName()).put(snapshot, snapshot.storageId);
       await transactionComplete(transaction);
killedBy: IndexedDB durable VTT session adapter persists snapshot removal and both rename paths across reopen
statusReason: Browser save does not exist.

[Killed] EqualityOperator
src/vtt/local-session-store.ts:698:11
       for (const revision of storedRevisions) {
         transaction.objectStore(revisionStoreName()).put(revision.bytes, revision.key);
       }
-      if (existingMetadata === null) {
+      if (existingMetadata !== null) {
         transaction.objectStore(sessionStoreName()).put({
           sessionId: legacy.sessionId,
killedBy: IndexedDB durable VTT session adapter persists snapshot removal and both rename paths across reopen
statusReason: Browser save does not exist.

[Killed] ConditionalExpression
src/vtt/local-session-store.ts:704:28
           name: legacy.sessionId,
           updatedAt: legacy.updatedAt,
           retention: { kind: 'autosave', pool: legacy.pool },
-          migrationStatus: legacy.bytes.length >= LIKELY_LOCAL_STORAGE_LIMIT_BYTES ? 'truncated' : 'complete',
+          migrationStatus: true ? 'truncated' : 'complete',
         } satisfies BrowserSaveMetadata, legacy.sessionId);
       }
killedBy: IndexedDB durable VTT session adapter flags legacy autosaves at the localStorage truncation boundary but not just below it
statusReason: expected [ { …(13) }, { …(13) } ] to deeply equal ArrayContaining{…}

[Killed] EqualityOperator
src/vtt/local-session-store.ts:704:28
           name: legacy.sessionId,
           updatedAt: legacy.updatedAt,
           retention: { kind: 'autosave', pool: legacy.pool },
-          migrationStatus: legacy.bytes.length >= LIKELY_LOCAL_STORAGE_LIMIT_BYTES ? 'truncated' : 'complete',
+          migrationStatus: legacy.bytes.length < LIKELY_LOCAL_STORAGE_LIMIT_BYTES ? 'truncated' : 'complete',
         } satisfies BrowserSaveMetadata, legacy.sessionId);
       }
killedBy: IndexedDB durable VTT session adapter flags legacy autosaves at the localStorage truncation boundary but not just below it
statusReason: expected [ { …(13) }, { …(13) } ] to deeply equal ArrayContaining{…}

[Killed] ConditionalExpression
src/vtt/local-session-store.ts:717:12
     const transaction = this.database.transaction(sessionStoreName(), 'readonly');
     const value: unknown = await requestResult(transaction.objectStore(sessionStoreName()).get(sessionId));
     await transactionComplete(transaction);
-    return value === undefined ? null : value as BrowserSaveMetadata;
+    return true ? null : value as BrowserSaveMetadata;
   }
 }
killedBy: IndexedDB durable VTT session adapter keeps the first autosave metadata when later snapshots share its session
statusReason: expected { …(5) } to match object { …(3) }
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
src/vtt/local-session-store.ts:717:12
     const transaction = this.database.transaction(sessionStoreName(), 'readonly');
     const value: unknown = await requestResult(transaction.objectStore(sessionStoreName()).get(sessionId));
     await transactionComplete(transaction);
-    return value === undefined ? null : value as BrowserSaveMetadata;
+    return false ? null : value as BrowserSaveMetadata;
   }
 }
killedBy: IndexedDB durable VTT session adapter persists snapshot removal and both rename paths across reopen
statusReason: Browser save does not exist.
