[Killed] ConditionalExpression
src/vtt/session-record.ts:99:5
   switch (revision.transition.kind) {
     case 'reducer_applied':
     case 'turn_skipped':
-    case 'turn_delayed':
-      return revision.transition.events;
+    case 'turn_delayed':
     case 'session_started':
     case 'session_ended':
killedBy: D377.14 structured session record export summary_drops_overrides: totals a hand-computed fixture and retains the DM fiat ruling card
statusReason: expected { …(5) } to match object { damageDealt: 7, …(2) }
(2 matching properties omitted from actual)

[Killed] UnaryOperator
src/vtt/session-record.ts:145:29
 export function deriveSessionRecord(revisions: readonly SessionRevision[]): SessionRecord {
   const byRevision = new Map(revisions.map((revision) => [revision.revision, revision] as const));
   const activeRevisionNumbers = new Set<number>();
-  let cursor = revisions.at(-1)?.revision ?? null;
+  let cursor = revisions.at(+1)?.revision ?? null;
   while (cursor !== null) {
     activeRevisionNumbers.add(cursor);
killedBy: typed encounter conclusion drives to victory, stops turns, renders the outcome, autosaves once, and closes the record
statusReason: expected { encounter: 1, room: null, …(8) } to match object { status: 'closed', …(1) }
(8 matching properties omitted from actual)

[Timeout] BlockStatement
src/vtt/session-record.ts:146:27
   const byRevision = new Map(revisions.map((revision) => [revision.revision, revision] as const));
   const activeRevisionNumbers = new Set<number>();
   let cursor = revisions.at(-1)?.revision ?? null;
-  while (cursor !== null) {
-    activeRevisionNumbers.add(cursor);
-    const revision = byRevision.get(cursor);
-    if (revision === undefined) throw new Error('Session record ancestry is incomplete.');
-    cursor = revision.parentRevision;
-  }
+  while (cursor !== null) {}
   const active = revisions.filter((revision) => activeRevisionNumbers.has(revision.revision));
   const ordinalByRevision = new Map<number, number>();

[Killed] StringLiteral
src/vtt/session-record.ts:149:49
   while (cursor !== null) {
     activeRevisionNumbers.add(cursor);
     const revision = byRevision.get(cursor);
-    if (revision === undefined) throw new Error('Session record ancestry is incomplete.');
+    if (revision === undefined) throw new Error("");
     cursor = revision.parentRevision;
   }
killedBy: D377.14 structured session record export rejects missing and out-of-order active ancestry with distinct messages
statusReason: expected [Function] to throw error including 'Session record ancestry is incomplete.' but got ''

[Killed] MethodExpression
src/vtt/session-record.ts:152:18
     if (revision === undefined) throw new Error('Session record ancestry is incomplete.');
     cursor = revision.parentRevision;
   }
-  const active = revisions.filter((revision) => activeRevisionNumbers.has(revision.revision));
+  const active = revisions;
   const ordinalByRevision = new Map<number, number>();
   for (const revision of active) {
killedBy: D377.14 structured session record export follows only the active ancestry and starts a new ordinal at room composition
statusReason: expected [ { encounter: 1, …(3) }, …(1) ] to deeply equal [ { encounter: 1, …(3) }, …(1) ]

[Killed] ArrowFunction
src/vtt/session-record.ts:152:35
     if (revision === undefined) throw new Error('Session record ancestry is incomplete.');
     cursor = revision.parentRevision;
   }
-  const active = revisions.filter((revision) => activeRevisionNumbers.has(revision.revision));
+  const active = revisions.filter(() => undefined);
   const ordinalByRevision = new Map<number, number>();
   for (const revision of active) {
killedBy: Vane Warren loader, chaining, seats, and end-session export export_drops_encounter: End Session emits one parseable export containing all three played encounters
statusReason: expected [] to have a length of 3 but got +0

[Killed] BlockStatement
src/vtt/session-record.ts:154:34
   }
   const active = revisions.filter((revision) => activeRevisionNumbers.has(revision.revision));
   const ordinalByRevision = new Map<number, number>();
-  for (const revision of active) {
-    const parentOrdinal = revision.parentRevision === null
-      ? 1
-      : ordinalByRevision.get(revision.parentRevision);
-    if (parentOrdinal === undefined) throw new Error('Session record encounter ancestry is incomplete.');
-    ordinalByRevision.set(
-      revision.revision,
-      revision.transition.kind === 'room_composed' ? parentOrdinal + 1 : parentOrdinal,
-    );
-  }
+  for (const revision of active) {}
   const encounterOrdinals = [...new Set(ordinalByRevision.values())];
   const encounters = encounterOrdinals.map((encounter): SessionEncounterRecord => {
killedBy: Vane Warren loader, chaining, seats, and end-session export export_drops_encounter: End Session emits one parseable export containing all three played encounters
statusReason: expected [] to have a length of 3 but got +0

[Killed] StringLiteral
src/vtt/session-record.ts:158:54
     const parentOrdinal = revision.parentRevision === null
       ? 1
       : ordinalByRevision.get(revision.parentRevision);
-    if (parentOrdinal === undefined) throw new Error('Session record encounter ancestry is incomplete.');
+    if (parentOrdinal === undefined) throw new Error("");
     ordinalByRevision.set(
       revision.revision,
killedBy: D377.14 structured session record export rejects missing and out-of-order active ancestry with distinct messages
statusReason: expected [Function] to throw error including 'Session record encounter ancestry is …' but got ''

[Killed] EqualityOperator
src/vtt/session-record.ts:161:7
     if (parentOrdinal === undefined) throw new Error('Session record encounter ancestry is incomplete.');
     ordinalByRevision.set(
       revision.revision,
-      revision.transition.kind === 'room_composed' ? parentOrdinal + 1 : parentOrdinal,
+      revision.transition.kind !== 'room_composed' ? parentOrdinal + 1 : parentOrdinal,
     );
   }
killedBy: Vane Warren loader, chaining, seats, and end-session export export_drops_encounter: End Session emits one parseable export containing all three played encounters
statusReason: expected [ Array(5) ] to have a length of 3 but got 5

[Killed] ArithmeticOperator
src/vtt/session-record.ts:161:54
     if (parentOrdinal === undefined) throw new Error('Session record encounter ancestry is incomplete.');
     ordinalByRevision.set(
       revision.revision,
-      revision.transition.kind === 'room_composed' ? parentOrdinal + 1 : parentOrdinal,
+      revision.transition.kind === 'room_composed' ? parentOrdinal - 1 : parentOrdinal,
     );
   }
killedBy: D377.14 structured session record export follows only the active ancestry and starts a new ordinal at room composition
statusReason: expected [ { encounter: 1, …(3) }, …(1) ] to deeply equal [ { encounter: 1, …(3) }, …(1) ]

[Killed] MethodExpression
src/vtt/session-record.ts:166:21
   }
   const encounterOrdinals = [...new Set(ordinalByRevision.values())];
   const encounters = encounterOrdinals.map((encounter): SessionEncounterRecord => {
-    const segment = active.filter(
-      (revision) => ordinalByRevision.get(revision.revision) === encounter,
-    );
+    const segment = active;
     const names = new Map<CombatantId, string>();
     for (const revision of segment) {
killedBy: D377.14 structured session record export follows only the active ancestry and starts a new ordinal at room composition
statusReason: expected [ { encounter: 1, …(3) }, …(1) ] to deeply equal [ { encounter: 1, …(3) }, …(1) ]

[Killed] ConditionalExpression
src/vtt/session-record.ts:167:21
   const encounterOrdinals = [...new Set(ordinalByRevision.values())];
   const encounters = encounterOrdinals.map((encounter): SessionEncounterRecord => {
     const segment = active.filter(
-      (revision) => ordinalByRevision.get(revision.revision) === encounter,
+      (revision) => true,
     );
     const names = new Map<CombatantId, string>();
killedBy: D377.14 structured session record export follows only the active ancestry and starts a new ordinal at room composition
statusReason: expected [ { encounter: 1, …(3) }, …(1) ] to deeply equal [ { encounter: 1, …(3) }, …(1) ]

[Killed] ConditionalExpression
src/vtt/session-record.ts:167:21
   const encounterOrdinals = [...new Set(ordinalByRevision.values())];
   const encounters = encounterOrdinals.map((encounter): SessionEncounterRecord => {
     const segment = active.filter(
-      (revision) => ordinalByRevision.get(revision.revision) === encounter,
+      (revision) => false,
     );
     const names = new Map<CombatantId, string>();
killedBy: typed encounter conclusion drives to victory, stops turns, renders the outcome, autosaves once, and closes the record
statusReason: expected { encounter: 1, room: null, …(8) } to match object { status: 'closed', …(1) }
(8 matching properties omitted from actual)

[Killed] BlockStatement
src/vtt/session-record.ts:170:37
       (revision) => ordinalByRevision.get(revision.revision) === encounter,
     );
     const names = new Map<CombatantId, string>();
-    for (const revision of segment) {
-      for (const subject of revision.encounterState.combatants) {
-        names.set(subject.profile.id, subject.profile.name);
-      }
-    }
+    for (const revision of segment) {}
     const summaries = new Map<CombatantId, MutableCombatantSummary>();
     for (const [combatant] of names) mutableCombatant(summaries, combatant, names);
killedBy: D377.14 structured session record export summarizes every resource and mortality event while excluding plausible false positives
statusReason: expected 'combatant:pace-first' to be 'pace-first' // Object.is equality

[Killed] BlockStatement
src/vtt/session-record.ts:171:65
     );
     const names = new Map<CombatantId, string>();
     for (const revision of segment) {
-      for (const subject of revision.encounterState.combatants) {
-        names.set(subject.profile.id, subject.profile.name);
-      }
+      for (const subject of revision.encounterState.combatants) {}
     }
     const summaries = new Map<CombatantId, MutableCombatantSummary>();
killedBy: D377.14 structured session record export summarizes every resource and mortality event while excluding plausible false positives
statusReason: expected 'combatant:pace-first' to be 'pace-first' // Object.is equality

[Killed] AssignmentOperator
src/vtt/session-record.ts:185:13
       for (const event of eventsOf(revision)) {
         switch (event.type) {
           case 'damage_applied':
-            mutableCombatant(summaries, event.source, names).damageDealt += event.amount;
+            mutableCombatant(summaries, event.source, names).damageDealt -= event.amount;
             mutableCombatant(summaries, event.target, names).damageTaken += event.amount;
             if (event.lifeState === 'dead') {
killedBy: D377.14 structured session record export summary_drops_overrides: totals a hand-computed fixture and retains the DM fiat ruling card
statusReason: expected { …(5) } to match object { damageDealt: 7, …(2) }
(2 matching properties omitted from actual)

[Killed] AssignmentOperator
src/vtt/session-record.ts:186:13
         switch (event.type) {
           case 'damage_applied':
             mutableCombatant(summaries, event.source, names).damageDealt += event.amount;
-            mutableCombatant(summaries, event.target, names).damageTaken += event.amount;
+            mutableCombatant(summaries, event.target, names).damageTaken -= event.amount;
             if (event.lifeState === 'dead') {
               deaths.push({ combatant: event.target, eventSequence: event.sequence, cause: 'damage' });
killedBy: D377.14 structured session record export summary_drops_overrides: totals a hand-computed fixture and retains the DM fiat ruling card
statusReason: expected { …(5) } to match object { damageDealt: +0, damageTaken: 7 }
(7 matching properties omitted from actual)

[Killed] EqualityOperator
src/vtt/session-record.ts:187:17
           case 'damage_applied':
             mutableCombatant(summaries, event.source, names).damageDealt += event.amount;
             mutableCombatant(summaries, event.target, names).damageTaken += event.amount;
-            if (event.lifeState === 'dead') {
+            if (event.lifeState !== 'dead') {
               deaths.push({ combatant: event.target, eventSequence: event.sequence, cause: 'damage' });
             }
killedBy: D377.14 structured session record export records Revivify and DM un-kill ruling cards as distinct revivals before later deaths
statusReason: expected [] to deeply equal [ { …(3) }, { …(3) } ]

[Killed] ConditionalExpression
src/vtt/session-record.ts:187:17
           case 'damage_applied':
             mutableCombatant(summaries, event.source, names).damageDealt += event.amount;
             mutableCombatant(summaries, event.target, names).damageTaken += event.amount;
-            if (event.lifeState === 'dead') {
+            if (true) {
               deaths.push({ combatant: event.target, eventSequence: event.sequence, cause: 'damage' });
             }
killedBy: D377.14 structured session record export summarizes every resource and mortality event while excluding plausible false positives
statusReason: expected [ { …(3) }, { …(3) }, { …(3) } ] to deeply equal [ { …(3) }, { …(3) } ]

[Killed] ArithmeticOperator
src/vtt/session-record.ts:193:40
             break;
           case 'spell_slot_spent': {
             const slots = mutableCombatant(summaries, event.combatant, names).spellSlots;
-            slots.set(event.slotLevel, (slots.get(event.slotLevel) ?? 0) + 1);
+            slots.set(event.slotLevel, (slots.get(event.slotLevel) ?? 0) - 1);
             break;
           }
killedBy: D377.14 structured session record export summary_drops_overrides: totals a hand-computed fixture and retains the DM fiat ruling card
statusReason: expected { …(5) } to match object { damageDealt: 7, …(2) }
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
src/vtt/session-record.ts:196:11
             slots.set(event.slotLevel, (slots.get(event.slotLevel) ?? 0) + 1);
             break;
           }
-          case 'legendary_action_used':
-            mutableCombatant(summaries, event.combatant, names).legendaryActionUses += event.cost;
-            break;
+          case 'legendary_action_used':
           case 'wild_shape_assumed':
             mutableCombatant(summaries, event.combatant, names).wildShapeUses += 1;
killedBy: D377.14 structured session record export summarizes every resource and mortality event while excluding plausible false positives
statusReason: expected { spellSlots: [], …(3) } to match object { legendaryActionUses: 3 }
(3 matching properties omitted from actual)

[Killed] AssignmentOperator
src/vtt/session-record.ts:197:13
             break;
           }
           case 'legendary_action_used':
-            mutableCombatant(summaries, event.combatant, names).legendaryActionUses += event.cost;
+            mutableCombatant(summaries, event.combatant, names).legendaryActionUses -= event.cost;
             break;
           case 'wild_shape_assumed':
killedBy: D377.14 structured session record export summarizes every resource and mortality event while excluding plausible false positives
statusReason: expected { spellSlots: [], …(3) } to match object { legendaryActionUses: 3 }
(3 matching properties omitted from actual)

[Killed] AssignmentOperator
src/vtt/session-record.ts:200:13
             mutableCombatant(summaries, event.combatant, names).legendaryActionUses += event.cost;
             break;
           case 'wild_shape_assumed':
-            mutableCombatant(summaries, event.combatant, names).wildShapeUses += 1;
+            mutableCombatant(summaries, event.combatant, names).wildShapeUses -= 1;
             break;
           case 'limited_resource_spent': {
killedBy: D377.14 structured session record export summarizes every resource and mortality event while excluding plausible false positives
statusReason: expected { spellSlots: [], …(3) } to deeply equal { spellSlots: [], …(3) }

[Killed] ArithmeticOperator
src/vtt/session-record.ts:204:49
             break;
           case 'limited_resource_spent': {
             const resources = mutableCombatant(summaries, event.combatant, names).limitedResources;
-            resources.set(event.resourcePoolId, (resources.get(event.resourcePoolId) ?? 0) + 1);
+            resources.set(event.resourcePoolId, (resources.get(event.resourcePoolId) ?? 0) - 1);
             break;
           }
killedBy: D377.14 structured session record export summarizes every resource and mortality event while excluding plausible false positives
statusReason: expected { spellSlots: [], …(3) } to deeply equal { spellSlots: [], …(3) }

[Killed] ConditionalExpression
src/vtt/session-record.ts:216:17
               failures: event.failures,
               lifeState: event.lifeState,
             });
-            if (event.lifeState === 'dead') {
+            if (true) {
               deaths.push({ combatant: event.combatant, eventSequence: event.sequence, cause: 'death_save' });
             }
killedBy: D377.14 structured session record export summarizes every resource and mortality event while excluding plausible false positives
statusReason: expected [ { …(3) }, { …(3) }, { …(3) } ] to deeply equal [ { …(3) }, { …(3) } ]

[Killed] BlockStatement
src/vtt/session-record.ts:216:45
               failures: event.failures,
               lifeState: event.lifeState,
             });
-            if (event.lifeState === 'dead') {
-              deaths.push({ combatant: event.combatant, eventSequence: event.sequence, cause: 'death_save' });
-            }
+            if (event.lifeState === 'dead') {}
             break;
           case 'spell_cast':
killedBy: D377.14 structured session record export summarizes every resource and mortality event while excluding plausible false positives
statusReason: expected [ { …(3) } ] to deeply equal [ { …(3) }, { …(3) } ]

[Killed] EqualityOperator
src/vtt/session-record.ts:221:17
             }
             break;
           case 'spell_cast':
-            if (event.spellId === 'revivify') {
+            if (event.spellId !== 'revivify') {
               revivals.push(...event.targets.map((combatant) => ({
                 combatant,
killedBy: D377.14 structured session record export records Revivify and DM un-kill ruling cards as distinct revivals before later deaths
statusReason: expected [ { …(4) } ] to deeply equal [ { …(4) }, { …(4) } ]

[Killed] BlockStatement
src/vtt/session-record.ts:221:47
             }
             break;
           case 'spell_cast':
-            if (event.spellId === 'revivify') {
-              revivals.push(...event.targets.map((combatant) => ({
-                combatant,
-                eventSequence: event.sequence,
-                cause: 'revivify' as const,
-                source: event.caster,
-              })));
-            }
+            if (event.spellId === 'revivify') {}
             break;
           case 'adjudicated':
killedBy: D377.14 structured session record export records Revivify and DM un-kill ruling cards as distinct revivals before later deaths
statusReason: expected [ { …(4) } ] to deeply equal [ { …(4) }, { …(4) } ]

[Killed] ConditionalExpression
src/vtt/session-record.ts:230:11
               })));
             }
             break;
-          case 'adjudicated':
-            dmRulings.push({
-              revision: revision.revision,
-              eventSequence: event.sequence,
-              target: event.target,
-              subject: event.subject,
-              reasoning: event.reasoning,
-              consequence: structuredClone(event.consequence),
-            });
-            if (event.consequence.kind === 'death_override' && event.consequence.after.lifeState === 'dead') {
-              deaths.push({ combatant: event.target, eventSequence: event.sequence, cause: 'dm_override' });
-            }
-            if (
-              (event.consequence.kind === 'death_override' && event.consequence.after.lifeState === 'living') ||
-              (event.consequence.kind === 'hit_points' &&
-                event.consequence.before === 0 && event.consequence.after > 0)
-            ) {
-              revivals.push({
-                combatant: event.target,
-                eventSequence: event.sequence,
-                cause: 'dm_override',
-                source: null,
-              });
-            }
-            break;
+          case 'adjudicated':
           default:
             break;
killedBy: D377.14 structured session record export summary_drops_overrides: totals a hand-computed fixture and retains the DM fiat ruling card
statusReason: expected [] to deeply equal [ ObjectContaining{…} ]

[Killed] ConditionalExpression
src/vtt/session-record.ts:239:64
               reasoning: event.reasoning,
               consequence: structuredClone(event.consequence),
             });
-            if (event.consequence.kind === 'death_override' && event.consequence.after.lifeState === 'dead') {
+            if (event.consequence.kind === 'death_override' && true) {
               deaths.push({ combatant: event.target, eventSequence: event.sequence, cause: 'dm_override' });
             }
killedBy: D377.14 structured session record export summarizes every resource and mortality event while excluding plausible false positives
statusReason: expected [ { …(3) }, { …(3) }, { …(3) } ] to deeply equal [ { …(3) }, { …(3) } ]

[Killed] BlockStatement
src/vtt/session-record.ts:239:110
               reasoning: event.reasoning,
               consequence: structuredClone(event.consequence),
             });
-            if (event.consequence.kind === 'death_override' && event.consequence.after.lifeState === 'dead') {
-              deaths.push({ combatant: event.target, eventSequence: event.sequence, cause: 'dm_override' });
-            }
+            if (event.consequence.kind === 'death_override' && event.consequence.after.lifeState === 'dead') {}
             if (
               (event.consequence.kind === 'death_override' && event.consequence.after.lifeState === 'living') ||
killedBy: D377.14 structured session record export summarizes every resource and mortality event while excluding plausible false positives
statusReason: expected [ { …(3) } ] to deeply equal [ { …(3) }, { …(3) } ]

[Killed] ConditionalExpression
src/vtt/session-record.ts:243:15
               deaths.push({ combatant: event.target, eventSequence: event.sequence, cause: 'dm_override' });
             }
             if (
-              (event.consequence.kind === 'death_override' && event.consequence.after.lifeState === 'living') ||
-              (event.consequence.kind === 'hit_points' &&
-                event.consequence.before === 0 && event.consequence.after > 0)
+              true
             ) {
               revivals.push({
killedBy: D377.14 structured session record export summarizes every resource and mortality event while excluding plausible false positives
statusReason: expected [ { …(4) }, { …(4) }, { …(4) }, …(3) ] to deeply equal [ { …(4) }, { …(4) }, { …(4) } ]

[Killed] ConditionalExpression
src/vtt/session-record.ts:243:63
               deaths.push({ combatant: event.target, eventSequence: event.sequence, cause: 'dm_override' });
             }
             if (
-              (event.consequence.kind === 'death_override' && event.consequence.after.lifeState === 'living') ||
+              (event.consequence.kind === 'death_override' && true) ||
               (event.consequence.kind === 'hit_points' &&
                 event.consequence.before === 0 && event.consequence.after > 0)
killedBy: D377.14 structured session record export summarizes every resource and mortality event while excluding plausible false positives
statusReason: expected [ { …(4) }, { …(4) }, { …(4) }, …(1) ] to deeply equal [ { …(4) }, { …(4) }, { …(4) } ]

[Killed] ConditionalExpression
src/vtt/session-record.ts:244:16
             }
             if (
               (event.consequence.kind === 'death_override' && event.consequence.after.lifeState === 'living') ||
-              (event.consequence.kind === 'hit_points' &&
-                event.consequence.before === 0 && event.consequence.after > 0)
+              (false)
             ) {
               revivals.push({
killedBy: D377.14 structured session record export records Revivify and DM un-kill ruling cards as distinct revivals before later deaths
statusReason: expected [ { …(4) } ] to deeply equal [ { …(4) }, { …(4) } ]

[Killed] ConditionalExpression
src/vtt/session-record.ts:245:51
             if (
               (event.consequence.kind === 'death_override' && event.consequence.after.lifeState === 'living') ||
               (event.consequence.kind === 'hit_points' &&
-                event.consequence.before === 0 && event.consequence.after > 0)
+                event.consequence.before === 0 && true)
             ) {
               revivals.push({
killedBy: D377.14 structured session record export summarizes every resource and mortality event while excluding plausible false positives
statusReason: expected [ { …(4) }, { …(4) }, { …(4) }, …(1) ] to deeply equal [ { …(4) }, { …(4) }, { …(4) } ]

[Killed] EqualityOperator
src/vtt/session-record.ts:245:51
             if (
               (event.consequence.kind === 'death_override' && event.consequence.after.lifeState === 'living') ||
               (event.consequence.kind === 'hit_points' &&
-                event.consequence.before === 0 && event.consequence.after > 0)
+                event.consequence.before === 0 && event.consequence.after <= 0)
             ) {
               revivals.push({
killedBy: D377.14 structured session record export records Revivify and DM un-kill ruling cards as distinct revivals before later deaths
statusReason: expected [ { …(4) } ] to deeply equal [ { …(4) }, { …(4) } ]

[Killed] BlockStatement
src/vtt/session-record.ts:246:15
               (event.consequence.kind === 'death_override' && event.consequence.after.lifeState === 'living') ||
               (event.consequence.kind === 'hit_points' &&
                 event.consequence.before === 0 && event.consequence.after > 0)
-            ) {
-              revivals.push({
-                combatant: event.target,
-                eventSequence: event.sequence,
-                cause: 'dm_override',
-                source: null,
-              });
-            }
+            ) {}
             break;
           default:
killedBy: D377.14 structured session record export records Revivify and DM un-kill ruling cards as distinct revivals before later deaths
statusReason: expected [ { …(4) } ] to deeply equal [ { …(4) }, { …(4) } ]

[Killed] UnaryOperator
src/vtt/session-record.ts:260:29
         }
       }
     }
-    const last = segment.at(-1);
+    const last = segment.at(+1);
     const concluded = segment.find((revision) => revision.encounterState.phase.kind === 'concluded');
     const conclusion = concluded?.encounterState.phase.kind === 'concluded'
killedBy: D377.14 structured session record export uses the latest revision metadata and sorts combatants independently of encounter order
statusReason: expected 1 to be 2 // Object.is equality

[Killed] EqualityOperator
src/vtt/session-record.ts:261:50
       }
     }
     const last = segment.at(-1);
-    const concluded = segment.find((revision) => revision.encounterState.phase.kind === 'concluded');
+    const concluded = segment.find((revision) => revision.encounterState.phase.kind !== 'concluded');
     const conclusion = concluded?.encounterState.phase.kind === 'concluded'
       ? { ...concluded.encounterState.phase, journalRevision: concluded.revision }
killedBy: typed encounter conclusion drives to victory, stops turns, renders the outcome, autosaves once, and closes the record
statusReason: expected { encounter: 1, room: null, …(8) } to match object { status: 'closed', …(1) }
(8 matching properties omitted from actual)

[Killed] ConditionalExpression
src/vtt/session-record.ts:261:50
       }
     }
     const last = segment.at(-1);
-    const concluded = segment.find((revision) => revision.encounterState.phase.kind === 'concluded');
+    const concluded = segment.find((revision) => false);
     const conclusion = concluded?.encounterState.phase.kind === 'concluded'
       ? { ...concluded.encounterState.phase, journalRevision: concluded.revision }
killedBy: typed encounter conclusion drives to victory, stops turns, renders the outcome, autosaves once, and closes the record
statusReason: expected { encounter: 1, room: null, …(8) } to match object { status: 'closed', …(1) }
(8 matching properties omitted from actual)

[Killed] MethodExpression
src/vtt/session-record.ts:269:32
       encounter,
       room: last?.partyState?.room ?? null,
       roundsElapsed: segment.reduce(
-        (maximum, revision) => Math.max(maximum, revision.encounterState.round),
+        (maximum, revision) => Math.min(maximum, revision.encounterState.round),
         0,
       ),
killedBy: D377.14 structured session record export summary_drops_overrides: totals a hand-computed fixture and retains the DM fiat ruling card
statusReason: expected { encounter: 1, room: null, …(8) } to match object { roundsElapsed: 1 }
(9 matching properties omitted from actual)
