[Killed] MethodExpression
src/vtt/session-record.ts:272:19
         (maximum, revision) => Math.max(maximum, revision.encounterState.round),
         0,
       ),
-      combatants: [...summaries].sort(([left], [right]) => left.localeCompare(right)).map(
+      combatants: [...summaries].map(
         ([combatant, summary]) => ({
           combatant,
killedBy: D377.14 structured session record export uses the latest revision metadata and sorts combatants independently of encounter order
statusReason: expected [ 'combatant:pace-third', …(2) ] to deeply equal [ 'combatant:pace-first', …(2) ]

[Killed] MethodExpression
src/vtt/session-record.ts:279:25
           damageDealt: summary.damageDealt,
           damageTaken: summary.damageTaken,
           resourcesSpent: {
-            spellSlots: [...summary.spellSlots].sort(([left], [right]) => left - right).map(
+            spellSlots: [...summary.spellSlots].map(
               ([level, count]) => ({ level, count }),
             ),
killedBy: D377.14 structured session record export summarizes every resource and mortality event while excluding plausible false positives
statusReason: expected { …(5) } to match object { damageDealt: +0, …(2) }
(2 matching properties omitted from actual)

[Killed] ArithmeticOperator
src/vtt/session-record.ts:279:75
           damageDealt: summary.damageDealt,
           damageTaken: summary.damageTaken,
           resourcesSpent: {
-            spellSlots: [...summary.spellSlots].sort(([left], [right]) => left - right).map(
+            spellSlots: [...summary.spellSlots].sort(([left], [right]) => left + right).map(
               ([level, count]) => ({ level, count }),
             ),
killedBy: D377.14 structured session record export summarizes every resource and mortality event while excluding plausible false positives
statusReason: expected { …(5) } to match object { damageDealt: +0, …(2) }
(2 matching properties omitted from actual)

[Killed] MethodExpression
src/vtt/session-record.ts:284:31
             ),
             legendaryActionUses: summary.legendaryActionUses,
             wildShapeUses: summary.wildShapeUses,
-            limitedResources: [...summary.limitedResources]
-              .sort(([left], [right]) => left.localeCompare(right))
+            limitedResources: [...summary.limitedResources]
               .map(([resourcePoolId, count]) => ({ resourcePoolId, count })),
           },
killedBy: D377.14 structured session record export summarizes every resource and mortality event while excluding plausible false positives
statusReason: expected { spellSlots: [], …(3) } to deeply equal { spellSlots: [], …(3) }
