[Killed] ConditionalExpression
src/vtt/stable-dom-render.ts:2:7
 function attributeNames(element: HTMLElement): readonly string[] {
-  if (typeof element.getAttributeNames === 'function') return element.getAttributeNames();
+  if (false) return element.getAttributeNames();
   const attributes: unknown = Reflect.get(element, 'attributes');
   return attributes instanceof Map
killedBy: stable VTT control rendering uses native attribute names when available and synchronizes additions, changes, and removals
statusReason: expected { …(3) } to deeply equal { …(3) }

[Killed] EqualityOperator
src/vtt/stable-dom-render.ts:2:7
 function attributeNames(element: HTMLElement): readonly string[] {
-  if (typeof element.getAttributeNames === 'function') return element.getAttributeNames();
+  if (typeof element.getAttributeNames !== 'function') return element.getAttributeNames();
   const attributes: unknown = Reflect.get(element, 'attributes');
   return attributes instanceof Map
killedBy: stable VTT control rendering keeps a pending tray option connected and clickable across live publishes
statusReason: element.getAttributeNames is not a function

[Killed] ConditionalExpression
src/vtt/stable-dom-render.ts:5:61
   if (typeof element.getAttributeNames === 'function') return element.getAttributeNames();
   const attributes: unknown = Reflect.get(element, 'attributes');
   return attributes instanceof Map
-    ? [...attributes.keys()].filter((key): key is string => typeof key === 'string')
+    ? [...attributes.keys()].filter((key): key is string => true)
     : [];
 }
killedBy: stable VTT control rendering ignores non-string fallback attribute keys
statusReason: expected true to be false // Object.is equality

[Killed] ArrowFunction
src/vtt/stable-dom-render.ts:5:37
   if (typeof element.getAttributeNames === 'function') return element.getAttributeNames();
   const attributes: unknown = Reflect.get(element, 'attributes');
   return attributes instanceof Map
-    ? [...attributes.keys()].filter((key): key is string => typeof key === 'string')
+    ? [...attributes.keys()].filter(() => undefined)
     : [];
 }
killedBy: stable VTT control rendering timeline_rewind_control_replaced: keeps the live rewind button connected while the timeline republishes
statusReason: expected '2' to be '9' // Object.is equality

[Killed] BlockStatement
src/vtt/stable-dom-render.ts:9:70
     : [];
 }
 
-function syncAttributes(live: HTMLElement, draft: HTMLElement): void {
-  const desired = new Set(attributeNames(draft));
-  for (const name of attributeNames(live)) {
-    if (!desired.has(name)) live.removeAttribute(name);
-  }
-  for (const name of desired) {
-    const value = draft.getAttribute(name);
-    if (value !== null && live.getAttribute(name) !== value) live.setAttribute(name, value);
-  }
-}
+function syncAttributes(live: HTMLElement, draft: HTMLElement): void {}
 
 const MUTABLE_STATE_PROPERTIES = ['disabled', 'hidden', 'checked', 'selected', 'value'] as const;
killedBy: stable VTT control rendering timeline_rewind_control_replaced: keeps the live rewind button connected while the timeline republishes
statusReason: expected '2' to be '9' // Object.is equality

[Killed] BlockStatement
src/vtt/stable-dom-render.ts:11:44
 
 function syncAttributes(live: HTMLElement, draft: HTMLElement): void {
   const desired = new Set(attributeNames(draft));
-  for (const name of attributeNames(live)) {
-    if (!desired.has(name)) live.removeAttribute(name);
-  }
+  for (const name of attributeNames(live)) {}
   for (const name of desired) {
     const value = draft.getAttribute(name);
killedBy: stable VTT control rendering uses native attribute names when available and synchronizes additions, changes, and removals
statusReason: expected { …(4) } to deeply equal { …(3) }

[Killed] BooleanLiteral
src/vtt/stable-dom-render.ts:12:9
 function syncAttributes(live: HTMLElement, draft: HTMLElement): void {
   const desired = new Set(attributeNames(draft));
   for (const name of attributeNames(live)) {
-    if (!desired.has(name)) live.removeAttribute(name);
+    if (desired.has(name)) live.removeAttribute(name);
   }
   for (const name of desired) {
killedBy: stable VTT control rendering uses native attribute names when available and synchronizes additions, changes, and removals
statusReason: expected { 'data-stale': 'remove-me', …(3) } to deeply equal { …(3) }

[Killed] ConditionalExpression
src/vtt/stable-dom-render.ts:12:9
 function syncAttributes(live: HTMLElement, draft: HTMLElement): void {
   const desired = new Set(attributeNames(draft));
   for (const name of attributeNames(live)) {
-    if (!desired.has(name)) live.removeAttribute(name);
+    if (true) live.removeAttribute(name);
   }
   for (const name of desired) {
killedBy: stable VTT control rendering uses native attribute names when available and synchronizes additions, changes, and removals
statusReason: expected [ 'data-render-key', …(2) ] to deeply equal [ 'data-stale' ]

[Killed] BlockStatement
src/vtt/stable-dom-render.ts:14:31
   for (const name of attributeNames(live)) {
     if (!desired.has(name)) live.removeAttribute(name);
   }
-  for (const name of desired) {
-    const value = draft.getAttribute(name);
-    if (value !== null && live.getAttribute(name) !== value) live.setAttribute(name, value);
-  }
+  for (const name of desired) {}
 }
 
killedBy: stable VTT control rendering timeline_rewind_control_replaced: keeps the live rewind button connected while the timeline republishes
statusReason: expected '2' to be '9' // Object.is equality

[Killed] EqualityOperator
src/vtt/stable-dom-render.ts:16:27
   }
   for (const name of desired) {
     const value = draft.getAttribute(name);
-    if (value !== null && live.getAttribute(name) !== value) live.setAttribute(name, value);
+    if (value !== null && live.getAttribute(name) === value) live.setAttribute(name, value);
   }
 }
killedBy: stable VTT control rendering timeline_rewind_control_replaced: keeps the live rewind button connected while the timeline republishes
statusReason: expected '2' to be '9' // Object.is equality

[Survived] ConditionalExpression
src/vtt/stable-dom-render.ts:16:27
   }
   for (const name of desired) {
     const value = draft.getAttribute(name);
-    if (value !== null && live.getAttribute(name) !== value) live.setAttribute(name, value);
+    if (value !== null && true) live.setAttribute(name, value);
   }
 }

[Killed] BlockStatement
src/vtt/stable-dom-render.ts:25:52
 
 function mutableState(element: HTMLElement): ReadonlyMap<MutableStateProperty, unknown> {
   const state = new Map<MutableStateProperty, unknown>();
-  for (const property of MUTABLE_STATE_PROPERTIES) {
-    if (property in element) state.set(property, Reflect.get(element, property));
-  }
+  for (const property of MUTABLE_STATE_PROPERTIES) {}
   return state;
 }
killedBy: stable VTT control rendering keeps controller controls connected while adding a deferred roster member
statusReason: expected 'human' to be 'algorithm' // Object.is equality

[Killed] ConditionalExpression
src/vtt/stable-dom-render.ts:26:9
 function mutableState(element: HTMLElement): ReadonlyMap<MutableStateProperty, unknown> {
   const state = new Map<MutableStateProperty, unknown>();
   for (const property of MUTABLE_STATE_PROPERTIES) {
-    if (property in element) state.set(property, Reflect.get(element, property));
+    if (true) state.set(property, Reflect.get(element, property));
   }
   return state;
killedBy: stable VTT control rendering copies mutable state only when that property exists on both relevant controls
statusReason: expected InteractiveTestElement{ …(21) } to match object { disabled: true, hidden: true, …(2) }
(45 matching properties omitted from actual)

[Killed] ConditionalExpression
src/vtt/stable-dom-render.ts:26:9
 function mutableState(element: HTMLElement): ReadonlyMap<MutableStateProperty, unknown> {
   const state = new Map<MutableStateProperty, unknown>();
   for (const property of MUTABLE_STATE_PROPERTIES) {
-    if (property in element) state.set(property, Reflect.get(element, property));
+    if (false) state.set(property, Reflect.get(element, property));
   }
   return state;
killedBy: stable VTT control rendering keeps controller controls connected while adding a deferred roster member
statusReason: expected 'human' to be 'algorithm' // Object.is equality

[Killed] BlockStatement
src/vtt/stable-dom-render.ts:34:9
 function syncState(
   live: HTMLElement,
   desired: ReadonlyMap<MutableStateProperty, unknown>,
-): void {
-  for (const [property, value] of desired) {
-    if (property in live) Reflect.set(live, property, value);
-  }
-}
+): void {}
 
 function isHtmlElement(value: unknown): value is HTMLElement {
killedBy: stable VTT control rendering keeps controller controls connected while adding a deferred roster member
statusReason: expected 'human' to be 'algorithm' // Object.is equality

[Killed] BlockStatement
src/vtt/stable-dom-render.ts:35:44
   live: HTMLElement,
   desired: ReadonlyMap<MutableStateProperty, unknown>,
 ): void {
-  for (const [property, value] of desired) {
-    if (property in live) Reflect.set(live, property, value);
-  }
+  for (const [property, value] of desired) {}
 }
 
killedBy: stable VTT control rendering keeps controller controls connected while adding a deferred roster member
statusReason: expected 'human' to be 'algorithm' // Object.is equality

[Killed] ConditionalExpression
src/vtt/stable-dom-render.ts:36:9
   desired: ReadonlyMap<MutableStateProperty, unknown>,
 ): void {
   for (const [property, value] of desired) {
-    if (property in live) Reflect.set(live, property, value);
+    if (false) Reflect.set(live, property, value);
   }
 }
killedBy: stable VTT control rendering keeps controller controls connected while adding a deferred roster member
statusReason: expected 'human' to be 'algorithm' // Object.is equality

[Killed] ConditionalExpression
src/vtt/stable-dom-render.ts:36:9
   desired: ReadonlyMap<MutableStateProperty, unknown>,
 ): void {
   for (const [property, value] of desired) {
-    if (property in live) Reflect.set(live, property, value);
+    if (true) Reflect.set(live, property, value);
   }
 }
killedBy: stable VTT control rendering copies mutable state only when that property exists on both relevant controls
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/vtt/stable-dom-render.ts:41:10
 }
 
 function isHtmlElement(value: unknown): value is HTMLElement {
-  return typeof value === 'object' && value !== null &&
-    typeof Reflect.get(value, 'tagName') === 'string' &&
-    typeof Reflect.get(value, 'append') === 'function';
+  return true;
 }
 
killedBy: stable VTT control rendering ignores child-shaped non-elements instead of trying to reconcile them
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot read properties of …' was thrown

[Killed] ConditionalExpression
src/vtt/stable-dom-render.ts:41:10
 }
 
 function isHtmlElement(value: unknown): value is HTMLElement {
-  return typeof value === 'object' && value !== null &&
-    typeof Reflect.get(value, 'tagName') === 'string' &&
-    typeof Reflect.get(value, 'append') === 'function';
+  return false;
 }
 
killedBy: stable VTT control rendering keeps controller controls connected while adding a deferred roster member
statusReason: expected 'human' to be 'algorithm' // Object.is equality

[Killed] ConditionalExpression
src/vtt/stable-dom-render.ts:42:5
 
 function isHtmlElement(value: unknown): value is HTMLElement {
   return typeof value === 'object' && value !== null &&
-    typeof Reflect.get(value, 'tagName') === 'string' &&
+    true &&
     typeof Reflect.get(value, 'append') === 'function';
 }
killedBy: stable VTT control rendering ignores child-shaped non-elements instead of trying to reconcile them
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot read properties of …' was thrown

[Killed] EqualityOperator
src/vtt/stable-dom-render.ts:42:5
 
 function isHtmlElement(value: unknown): value is HTMLElement {
   return typeof value === 'object' && value !== null &&
-    typeof Reflect.get(value, 'tagName') === 'string' &&
+    typeof Reflect.get(value, 'tagName') !== 'string' &&
     typeof Reflect.get(value, 'append') === 'function';
 }
killedBy: stable VTT control rendering keeps controller controls connected while adding a deferred roster member
statusReason: expected 'human' to be 'algorithm' // Object.is equality

[Killed] ConditionalExpression
src/vtt/stable-dom-render.ts:43:5
 function isHtmlElement(value: unknown): value is HTMLElement {
   return typeof value === 'object' && value !== null &&
     typeof Reflect.get(value, 'tagName') === 'string' &&
-    typeof Reflect.get(value, 'append') === 'function';
+    true;
 }
 
killedBy: stable VTT control rendering ignores child-shaped non-elements instead of trying to reconcile them
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot read properties of …' was thrown

[Killed] EqualityOperator
src/vtt/stable-dom-render.ts:43:5
 function isHtmlElement(value: unknown): value is HTMLElement {
   return typeof value === 'object' && value !== null &&
     typeof Reflect.get(value, 'tagName') === 'string' &&
-    typeof Reflect.get(value, 'append') === 'function';
+    typeof Reflect.get(value, 'append') !== 'function';
 }
 
killedBy: stable VTT control rendering keeps controller controls connected while adding a deferred roster member
statusReason: expected 'human' to be 'algorithm' // Object.is equality

[Killed] StringLiteral
src/vtt/stable-dom-render.ts:68:11
     readonly key: StableRenderKey,
     readonly tree: 'live' | 'draft',
   ) {
-    super(`Stable render key ${key} is duplicated in the ${tree} tree.`);
+    super(``);
   }
 }
killedBy: stable VTT control rendering reports a duplicate in the live tree before applying the draft
statusReason: expected error to match asymmetric matcher

[Killed] ConditionalExpression
src/vtt/stable-dom-render.ts:90:34
 export function stableRenderKey(
   ...segments: readonly [namespace: string, identity: string, ...path: string[]]
 ): StableRenderKey {
-  if (segments.some((segment) => segment.length === 0)) {
+  if (segments.some((segment) => true)) {
     throw new StableRenderKeyFormatError(segments.join(':'));
   }
killedBy: stable VTT control rendering keeps a pending tray option connected and clickable across live publishes
statusReason: Stable render key dm:decision-tray must contain a namespace and logical identity.

[Killed] ArrowFunction
src/vtt/stable-dom-render.ts:90:21
 export function stableRenderKey(
   ...segments: readonly [namespace: string, identity: string, ...path: string[]]
 ): StableRenderKey {
-  if (segments.some((segment) => segment.length === 0)) {
+  if (segments.some(() => undefined)) {
     throw new StableRenderKeyFormatError(segments.join(':'));
   }
killedBy: stable VTT control rendering encodes every key segment and reports the rejected identity verbatim
statusReason: expected function to throw an error, but it didn't

[Killed] ConditionalExpression
src/vtt/stable-dom-render.ts:99:7
 function renderKey(element: HTMLElement): StableRenderKey | null {
   const key = element.dataset.renderKey;
   if (key === undefined) return null;
-  if (!key.includes(':')) throw new StableRenderKeyFormatError(key);
+  if (true) throw new StableRenderKeyFormatError(key);
   return key as StableRenderKey;
 }
killedBy: stable VTT control rendering keeps a pending tray option connected and clickable across live publishes
statusReason: Stable render key dm:decision-tray must contain a namespace and logical identity.

[Killed] BooleanLiteral
src/vtt/stable-dom-render.ts:99:7
 function renderKey(element: HTMLElement): StableRenderKey | null {
   const key = element.dataset.renderKey;
   if (key === undefined) return null;
-  if (!key.includes(':')) throw new StableRenderKeyFormatError(key);
+  if (key.includes(':')) throw new StableRenderKeyFormatError(key);
   return key as StableRenderKey;
 }
killedBy: stable VTT control rendering keeps a pending tray option connected and clickable across live publishes
statusReason: Stable render key dm:decision-tray must contain a namespace and logical identity.

[Killed] BlockStatement
src/vtt/stable-dom-render.ts:106:9
 function assertUniqueRenderKeys(
   root: HTMLElement,
   tree: 'live' | 'draft',
-): void {
-  const keyed = new Map<StableRenderKey, HTMLElement>();
-  const visit = (parent: HTMLElement): void => {
-    for (const child of Array.from(parent.children)) {
-      if (!isHtmlElement(child)) continue;
-      const key = renderKey(child);
-      if (key !== null) {
-        if (keyed.has(key)) throw new StableRenderKeyCollisionError(key, tree);
-        keyed.set(key, child);
-      }
-      visit(child);
-    }
-  };
-  visit(root);
-}
+): void {}
 
 function isInteractive(element: HTMLElement): boolean {
killedBy: stable VTT control rendering rejects colliding logical identities before mutating the live tree
statusReason: expected function to throw an error, but it didn't

[Killed] BlockStatement
src/vtt/stable-dom-render.ts:108:48
   tree: 'live' | 'draft',
 ): void {
   const keyed = new Map<StableRenderKey, HTMLElement>();
-  const visit = (parent: HTMLElement): void => {
-    for (const child of Array.from(parent.children)) {
-      if (!isHtmlElement(child)) continue;
-      const key = renderKey(child);
-      if (key !== null) {
-        if (keyed.has(key)) throw new StableRenderKeyCollisionError(key, tree);
-        keyed.set(key, child);
-      }
-      visit(child);
-    }
-  };
+  const visit = (parent: HTMLElement): void => {};
   visit(root);
 }
killedBy: stable VTT control rendering rejects colliding logical identities before mutating the live tree
statusReason: expected function to throw an error, but it didn't

[Killed] BlockStatement
src/vtt/stable-dom-render.ts:109:54
 ): void {
   const keyed = new Map<StableRenderKey, HTMLElement>();
   const visit = (parent: HTMLElement): void => {
-    for (const child of Array.from(parent.children)) {
-      if (!isHtmlElement(child)) continue;
-      const key = renderKey(child);
-      if (key !== null) {
-        if (keyed.has(key)) throw new StableRenderKeyCollisionError(key, tree);
-        keyed.set(key, child);
-      }
-      visit(child);
-    }
+    for (const child of Array.from(parent.children)) {}
   };
   visit(root);
killedBy: stable VTT control rendering rejects colliding logical identities before mutating the live tree
statusReason: expected function to throw an error, but it didn't

[Killed] BlockStatement
src/vtt/stable-dom-render.ts:112:25
     for (const child of Array.from(parent.children)) {
       if (!isHtmlElement(child)) continue;
       const key = renderKey(child);
-      if (key !== null) {
-        if (keyed.has(key)) throw new StableRenderKeyCollisionError(key, tree);
-        keyed.set(key, child);
-      }
+      if (key !== null) {}
       visit(child);
     }
killedBy: stable VTT control rendering rejects colliding logical identities before mutating the live tree
statusReason: expected function to throw an error, but it didn't

[Killed] MethodExpression
src/vtt/stable-dom-render.ts:123:15
 }
 
 function isInteractive(element: HTMLElement): boolean {
-  const tag = element.tagName.toUpperCase();
+  const tag = element.tagName.toLowerCase();
   if (['BUTTON', 'INPUT', 'SELECT', 'TEXTAREA', 'SUMMARY'].includes(tag)) return true;
   if (tag === 'A' && element.getAttribute('href') !== null) return true;
killedBy: stable VTT control rendering rejects a keyed control whose unkeyed wrapper would still replace it
statusReason: expected function to throw an error, but it didn't

[Killed] ConditionalExpression
src/vtt/stable-dom-render.ts:124:7
 
 function isInteractive(element: HTMLElement): boolean {
   const tag = element.tagName.toUpperCase();
-  if (['BUTTON', 'INPUT', 'SELECT', 'TEXTAREA', 'SUMMARY'].includes(tag)) return true;
+  if (false) return true;
   if (tag === 'A' && element.getAttribute('href') !== null) return true;
   return element.getAttribute('tabindex') !== null;
killedBy: stable VTT control rendering rejects a keyed control whose unkeyed wrapper would still replace it
statusReason: expected function to throw an error, but it didn't

[Killed] BooleanLiteral
src/vtt/stable-dom-render.ts:124:82
 
 function isInteractive(element: HTMLElement): boolean {
   const tag = element.tagName.toUpperCase();
-  if (['BUTTON', 'INPUT', 'SELECT', 'TEXTAREA', 'SUMMARY'].includes(tag)) return true;
+  if (['BUTTON', 'INPUT', 'SELECT', 'TEXTAREA', 'SUMMARY'].includes(tag)) return false;
   if (tag === 'A' && element.getAttribute('href') !== null) return true;
   return element.getAttribute('tabindex') !== null;
killedBy: stable VTT control rendering rejects a keyed control whose unkeyed wrapper would still replace it
statusReason: expected function to throw an error, but it didn't

[Killed] EqualityOperator
src/vtt/stable-dom-render.ts:125:7
 function isInteractive(element: HTMLElement): boolean {
   const tag = element.tagName.toUpperCase();
   if (['BUTTON', 'INPUT', 'SELECT', 'TEXTAREA', 'SUMMARY'].includes(tag)) return true;
-  if (tag === 'A' && element.getAttribute('href') !== null) return true;
+  if (tag !== 'A' && element.getAttribute('href') !== null) return true;
   return element.getAttribute('tabindex') !== null;
 }
killedBy: stable VTT control rendering distinguishes linked anchors and tabindex controls from inert lookalikes
statusReason: expected function to throw an error, but it didn't

[Killed] EqualityOperator
src/vtt/stable-dom-render.ts:125:22
 function isInteractive(element: HTMLElement): boolean {
   const tag = element.tagName.toUpperCase();
   if (['BUTTON', 'INPUT', 'SELECT', 'TEXTAREA', 'SUMMARY'].includes(tag)) return true;
-  if (tag === 'A' && element.getAttribute('href') !== null) return true;
+  if (tag === 'A' && element.getAttribute('href') === null) return true;
   return element.getAttribute('tabindex') !== null;
 }
killedBy: stable VTT control rendering distinguishes linked anchors and tabindex controls from inert lookalikes
statusReason: expected [Function] to not throw an error but 'StableInteractivePathError: Interacti…' was thrown

[Killed] ConditionalExpression
src/vtt/stable-dom-render.ts:126:10
   const tag = element.tagName.toUpperCase();
   if (['BUTTON', 'INPUT', 'SELECT', 'TEXTAREA', 'SUMMARY'].includes(tag)) return true;
   if (tag === 'A' && element.getAttribute('href') !== null) return true;
-  return element.getAttribute('tabindex') !== null;
+  return true;
 }
 
killedBy: stable VTT control rendering does not orphan a pressed tray option when a preview rerenders before click
statusReason: Interactive DIV has an unkeyed DIV ancestor in the live tree.

[Killed] ConditionalExpression
src/vtt/stable-dom-render.ts:126:10
   const tag = element.tagName.toUpperCase();
   if (['BUTTON', 'INPUT', 'SELECT', 'TEXTAREA', 'SUMMARY'].includes(tag)) return true;
   if (tag === 'A' && element.getAttribute('href') !== null) return true;
-  return element.getAttribute('tabindex') !== null;
+  return false;
 }
 
killedBy: stable VTT control rendering distinguishes linked anchors and tabindex controls from inert lookalikes
statusReason: expected function to throw an error, but it didn't

[Killed] BlockStatement
src/vtt/stable-dom-render.ts:132:9
 function assertStableInteractivePaths(
   root: HTMLElement,
   tree: 'live' | 'draft',
-): void {
-  const visit = (parent: HTMLElement, pathIsStable: boolean): void => {
-    for (const child of Array.from(parent.children)) {
-      if (!isHtmlElement(child)) continue;
-      const childIsStable = pathIsStable && renderKey(child) !== null;
-      if (isInteractive(child) && !childIsStable) {
-        let unkeyed: HTMLElement = child;
-        while (unkeyed !== root && renderKey(unkeyed) !== null) {
-          const ancestor = unkeyed.parentElement;
-          if (ancestor === null) break;
-          unkeyed = ancestor;
-        }
-        throw new StableInteractivePathError(
-          child.tagName.toUpperCase(),
-          unkeyed.tagName.toUpperCase(),
-          tree,
-        );
-      }
-      visit(child, childIsStable);
-    }
-  };
-  visit(root, true);
-}
+): void {}
 
 function keyedChildren(element: HTMLElement): ReadonlyMap<StableRenderKey, HTMLElement> {
killedBy: stable VTT control rendering rejects a keyed control whose unkeyed wrapper would still replace it
statusReason: expected function to throw an error, but it didn't

[Killed] BlockStatement
src/vtt/stable-dom-render.ts:133:71
   root: HTMLElement,
   tree: 'live' | 'draft',
 ): void {
-  const visit = (parent: HTMLElement, pathIsStable: boolean): void => {
-    for (const child of Array.from(parent.children)) {
-      if (!isHtmlElement(child)) continue;
-      const childIsStable = pathIsStable && renderKey(child) !== null;
-      if (isInteractive(child) && !childIsStable) {
-        let unkeyed: HTMLElement = child;
-        while (unkeyed !== root && renderKey(unkeyed) !== null) {
-          const ancestor = unkeyed.parentElement;
-          if (ancestor === null) break;
-          unkeyed = ancestor;
-        }
-        throw new StableInteractivePathError(
-          child.tagName.toUpperCase(),
-          unkeyed.tagName.toUpperCase(),
-          tree,
-        );
-      }
-      visit(child, childIsStable);
-    }
-  };
+  const visit = (parent: HTMLElement, pathIsStable: boolean): void => {};
   visit(root, true);
 }
killedBy: stable VTT control rendering rejects a keyed control whose unkeyed wrapper would still replace it
statusReason: expected function to throw an error, but it didn't

[Killed] BlockStatement
src/vtt/stable-dom-render.ts:134:54
   tree: 'live' | 'draft',
 ): void {
   const visit = (parent: HTMLElement, pathIsStable: boolean): void => {
-    for (const child of Array.from(parent.children)) {
-      if (!isHtmlElement(child)) continue;
-      const childIsStable = pathIsStable && renderKey(child) !== null;
-      if (isInteractive(child) && !childIsStable) {
-        let unkeyed: HTMLElement = child;
-        while (unkeyed !== root && renderKey(unkeyed) !== null) {
-          const ancestor = unkeyed.parentElement;
-          if (ancestor === null) break;
-          unkeyed = ancestor;
-        }
-        throw new StableInteractivePathError(
-          child.tagName.toUpperCase(),
-          unkeyed.tagName.toUpperCase(),
-          tree,
-        );
-      }
-      visit(child, childIsStable);
-    }
+    for (const child of Array.from(parent.children)) {}
   };
   visit(root, true);
killedBy: stable VTT control rendering rejects a keyed control whose unkeyed wrapper would still replace it
statusReason: expected function to throw an error, but it didn't

[Killed] LogicalOperator
src/vtt/stable-dom-render.ts:136:29
   const visit = (parent: HTMLElement, pathIsStable: boolean): void => {
     for (const child of Array.from(parent.children)) {
       if (!isHtmlElement(child)) continue;
-      const childIsStable = pathIsStable && renderKey(child) !== null;
+      const childIsStable = pathIsStable || renderKey(child) !== null;
       if (isInteractive(child) && !childIsStable) {
         let unkeyed: HTMLElement = child;
killedBy: stable VTT control rendering rejects a keyed control whose unkeyed wrapper would still replace it
statusReason: expected function to throw an error, but it didn't

[Killed] ConditionalExpression
src/vtt/stable-dom-render.ts:136:29
   const visit = (parent: HTMLElement, pathIsStable: boolean): void => {
     for (const child of Array.from(parent.children)) {
       if (!isHtmlElement(child)) continue;
-      const childIsStable = pathIsStable && renderKey(child) !== null;
+      const childIsStable = false;
       if (isInteractive(child) && !childIsStable) {
         let unkeyed: HTMLElement = child;
killedBy: stable VTT control rendering keeps a pending tray option connected and clickable across live publishes
statusReason: Interactive BUTTON has an unkeyed MAIN ancestor in the live tree.

[Killed] LogicalOperator
src/vtt/stable-dom-render.ts:137:11
     for (const child of Array.from(parent.children)) {
       if (!isHtmlElement(child)) continue;
       const childIsStable = pathIsStable && renderKey(child) !== null;
-      if (isInteractive(child) && !childIsStable) {
+      if (isInteractive(child) || !childIsStable) {
         let unkeyed: HTMLElement = child;
         while (unkeyed !== root && renderKey(unkeyed) !== null) {
killedBy: stable VTT control rendering keeps a pending tray option connected and clickable across live publishes
statusReason: Interactive BUTTON has an unkeyed MAIN ancestor in the live tree.

[Killed] BooleanLiteral
src/vtt/stable-dom-render.ts:137:35
     for (const child of Array.from(parent.children)) {
       if (!isHtmlElement(child)) continue;
       const childIsStable = pathIsStable && renderKey(child) !== null;
-      if (isInteractive(child) && !childIsStable) {
+      if (isInteractive(child) && childIsStable) {
         let unkeyed: HTMLElement = child;
         while (unkeyed !== root && renderKey(unkeyed) !== null) {
killedBy: stable VTT control rendering keeps a pending tray option connected and clickable across live publishes
statusReason: Interactive BUTTON has an unkeyed MAIN ancestor in the live tree.
