[Killed] ConditionalExpression
src/vtt/stable-dom-render.ts:139:36
       const childIsStable = pathIsStable && renderKey(child) !== null;
       if (isInteractive(child) && !childIsStable) {
         let unkeyed: HTMLElement = child;
-        while (unkeyed !== root && renderKey(unkeyed) !== null) {
+        while (unkeyed !== root && true) {
           const ancestor = unkeyed.parentElement;
           if (ancestor === null) break;
killedBy: stable VTT control rendering rejects a keyed control whose unkeyed wrapper would still replace it
statusReason: expected error to match asymmetric matcher

[Killed] LogicalOperator
src/vtt/stable-dom-render.ts:139:16
       const childIsStable = pathIsStable && renderKey(child) !== null;
       if (isInteractive(child) && !childIsStable) {
         let unkeyed: HTMLElement = child;
-        while (unkeyed !== root && renderKey(unkeyed) !== null) {
+        while (unkeyed !== root || renderKey(unkeyed) !== null) {
           const ancestor = unkeyed.parentElement;
           if (ancestor === null) break;
killedBy: stable VTT control rendering rejects a keyed control whose unkeyed wrapper would still replace it
statusReason: expected error to match asymmetric matcher

[Killed] MethodExpression
src/vtt/stable-dom-render.ts:145:11
           unkeyed = ancestor;
         }
         throw new StableInteractivePathError(
-          child.tagName.toUpperCase(),
+          child.tagName.toLowerCase(),
           unkeyed.tagName.toUpperCase(),
           tree,
killedBy: stable VTT control rendering rejects a keyed control whose unkeyed wrapper would still replace it
statusReason: expected error to match asymmetric matcher

[Killed] MethodExpression
src/vtt/stable-dom-render.ts:146:11
         }
         throw new StableInteractivePathError(
           child.tagName.toUpperCase(),
-          unkeyed.tagName.toUpperCase(),
+          unkeyed.tagName.toLowerCase(),
           tree,
         );
killedBy: stable VTT control rendering rejects a keyed control whose unkeyed wrapper would still replace it
statusReason: expected error to match asymmetric matcher

[Killed] BooleanLiteral
src/vtt/stable-dom-render.ts:153:15
       visit(child, childIsStable);
     }
   };
-  visit(root, true);
+  visit(root, false);
 }
 
killedBy: stable VTT control rendering keeps a pending tray option connected and clickable across live publishes
statusReason: Interactive BUTTON has an unkeyed MAIN ancestor in the live tree.

[Killed] BlockStatement
src/vtt/stable-dom-render.ts:158:53
 
 function keyedChildren(element: HTMLElement): ReadonlyMap<StableRenderKey, HTMLElement> {
   const keyed = new Map<StableRenderKey, HTMLElement>();
-  for (const child of Array.from(element.children)) {
-    if (!isHtmlElement(child)) continue;
-    const key = renderKey(child);
-    if (key === null) continue;
-    if (keyed.has(key)) throw new StableRenderKeyCollisionError(key, 'live');
-    keyed.set(key, child);
-  }
+  for (const child of Array.from(element.children)) {}
   return keyed;
 }
killedBy: stable VTT control rendering keeps a pending tray option connected and clickable across live publishes
statusReason: expected InteractiveTestElement{ …(22) } to be InteractiveTestElement{ …(22) } // Object.is equality

[Killed] BlockStatement
src/vtt/stable-dom-render.ts:168:67
   return keyed;
 }
 
-function syncElement(live: HTMLElement, draft: HTMLElement): void {
-  const desiredState = mutableState(draft);
-  syncAttributes(live, draft);
-  if (draft.children.length === 0) {
-    live.textContent = draft.textContent;
-  } else {
-    reconcileStableRenderedChildren(live, draft);
-  }
-  // A select's value is derived from its option children. Restore mutable DOM
-  // state only after those children have been reconciled so option insertion
-  // cannot overwrite the intended selection.
-  syncState(live, desiredState);
-}
+function syncElement(live: HTMLElement, draft: HTMLElement): void {}
 
 /**
killedBy: stable VTT control rendering keeps controller controls connected while adding a deferred roster member
statusReason: expected 'human' to be 'algorithm' // Object.is equality

[Killed] ConditionalExpression
src/vtt/stable-dom-render.ts:171:7
 function syncElement(live: HTMLElement, draft: HTMLElement): void {
   const desiredState = mutableState(draft);
   syncAttributes(live, draft);
-  if (draft.children.length === 0) {
+  if (true) {
     live.textContent = draft.textContent;
   } else {
killedBy: stable VTT control rendering keeps controller controls connected while adding a deferred roster member
statusReason: expected 'human' to be 'algorithm' // Object.is equality

[Killed] ConditionalExpression
src/vtt/stable-dom-render.ts:171:7
 function syncElement(live: HTMLElement, draft: HTMLElement): void {
   const desiredState = mutableState(draft);
   syncAttributes(live, draft);
-  if (draft.children.length === 0) {
+  if (false) {
     live.textContent = draft.textContent;
   } else {
killedBy: stable VTT control rendering keeps the encounter pause acknowledgement connected while its state changes
statusReason: expected 'Paused: interrupted' to be 'Encounter running' // Object.is equality

[Killed] BlockStatement
src/vtt/stable-dom-render.ts:173:10
   syncAttributes(live, draft);
   if (draft.children.length === 0) {
     live.textContent = draft.textContent;
-  } else {
-    reconcileStableRenderedChildren(live, draft);
-  }
+  } else {}
   // A select's value is derived from its option children. Restore mutable DOM
   // state only after those children have been reconciled so option insertion
killedBy: stable VTT control rendering keeps controller controls connected while adding a deferred roster member
statusReason: expected 'human' to be 'algorithm' // Object.is equality

[Killed] EqualityOperator
src/vtt/stable-dom-render.ts:202:41
   const rendered = desired.map((next) => {
     const key = renderKey(next);
     const prior = key === null ? undefined : keyed.get(key);
-    const node = prior !== undefined && prior.tagName === next.tagName
+    const node = prior !== undefined && prior.tagName !== next.tagName
       ? prior
       : next;
killedBy: stable VTT control rendering keeps a pending tray option connected and clickable across live publishes
statusReason: expected InteractiveTestElement{ …(22) } to be InteractiveTestElement{ …(22) } // Object.is equality

[Killed] ConditionalExpression
src/vtt/stable-dom-render.ts:202:41
   const rendered = desired.map((next) => {
     const key = renderKey(next);
     const prior = key === null ? undefined : keyed.get(key);
-    const node = prior !== undefined && prior.tagName === next.tagName
+    const node = prior !== undefined && true
       ? prior
       : next;
killedBy: stable VTT control rendering reorders retained nodes, inserts a new node, and removes stale and tag-mismatched nodes
statusReason: expected [ …(4) ] to deeply equal [ …(4) ]

[Killed] ConditionalExpression
src/vtt/stable-dom-render.ts:205:9
     const node = prior !== undefined && prior.tagName === next.tagName
       ? prior
       : next;
-    if (node === prior) syncElement(node, next);
+    if (false) syncElement(node, next);
     return node;
   });
killedBy: stable VTT control rendering keeps controller controls connected while adding a deferred roster member
statusReason: expected 'human' to be 'algorithm' // Object.is equality

[Killed] EqualityOperator
src/vtt/stable-dom-render.ts:205:9
     const node = prior !== undefined && prior.tagName === next.tagName
       ? prior
       : next;
-    if (node === prior) syncElement(node, next);
+    if (node !== prior) syncElement(node, next);
     return node;
   });
killedBy: stable VTT control rendering keeps controller controls connected while adding a deferred roster member
statusReason: expected 'human' to be 'algorithm' // Object.is equality

[Killed] BlockStatement
src/vtt/stable-dom-render.ts:209:51
     return node;
   });
   const retained = new Set(rendered);
-  for (const [index, node] of rendered.entries()) {
-    while (true) {
-      const current = Array.from(live.children).filter(isHtmlElement)[index];
-      if (current === node) break;
-      if (current !== undefined && !retained.has(current)) {
-        current.remove();
-        continue;
-      }
-      // Re-appending a retained node is still a DOM move. Leaving it in place
-      // keeps an active pointer sequence intact when preview siblings change.
-      live.insertBefore(node, current ?? null);
-      break;
-    }
-  }
+  for (const [index, node] of rendered.entries()) {}
   for (const stale of existing) {
     if (!retained.has(stale)) stale.remove();
killedBy: stable VTT control rendering keeps controller controls connected while adding a deferred roster member
statusReason: expected [ InteractiveTestElement{ …(22) } ] to have a length of 2 but got 1

[Timeout] BlockStatement
src/vtt/stable-dom-render.ts:210:18
   });
   const retained = new Set(rendered);
   for (const [index, node] of rendered.entries()) {
-    while (true) {
-      const current = Array.from(live.children).filter(isHtmlElement)[index];
-      if (current === node) break;
-      if (current !== undefined && !retained.has(current)) {
-        current.remove();
-        continue;
-      }
-      // Re-appending a retained node is still a DOM move. Leaving it in place
-      // keeps an active pointer sequence intact when preview siblings change.
-      live.insertBefore(node, current ?? null);
-      break;
-    }
+    while (true) {}
   }
   for (const stale of existing) {

[Killed] ConditionalExpression
src/vtt/stable-dom-render.ts:212:11
   for (const [index, node] of rendered.entries()) {
     while (true) {
       const current = Array.from(live.children).filter(isHtmlElement)[index];
-      if (current === node) break;
+      if (false) break;
       if (current !== undefined && !retained.has(current)) {
         current.remove();
killedBy: stable VTT control rendering does not orphan a pressed tray option when a preview rerenders before click
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/vtt/stable-dom-render.ts:212:11
   for (const [index, node] of rendered.entries()) {
     while (true) {
       const current = Array.from(live.children).filter(isHtmlElement)[index];
-      if (current === node) break;
+      if (current !== node) break;
       if (current !== undefined && !retained.has(current)) {
         current.remove();
killedBy: stable VTT control rendering does not orphan a pressed tray option when a preview rerenders before click
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/vtt/stable-dom-render.ts:213:36
     while (true) {
       const current = Array.from(live.children).filter(isHtmlElement)[index];
       if (current === node) break;
-      if (current !== undefined && !retained.has(current)) {
+      if (current !== undefined && retained.has(current)) {
         current.remove();
         continue;
killedBy: stable VTT control rendering reorders retained nodes, inserts a new node, and removes stale and tag-mismatched nodes
statusReason: expected "remove" to not be called at all, but actually been called 2 times

Received:

  1st remove call:

    Array []

[Killed] BlockStatement
src/vtt/stable-dom-render.ts:213:60
     while (true) {
       const current = Array.from(live.children).filter(isHtmlElement)[index];
       if (current === node) break;
-      if (current !== undefined && !retained.has(current)) {
-        current.remove();
-        continue;
-      }
+      if (current !== undefined && !retained.has(current)) {}
       // Re-appending a retained node is still a DOM move. Leaving it in place
       // keeps an active pointer sequence intact when preview siblings change.
killedBy: stable VTT control rendering reorders retained nodes, inserts a new node, and removes stale and tag-mismatched nodes
statusReason: expected "insertBefore" to be called with arguments: [ …(2) ]

Received:

  1st insertBefore call:

@@ -1,8 +1,73 @@
  [

[Killed] BlockStatement
src/vtt/stable-dom-render.ts:223:33
       break;
     }
   }
-  for (const stale of existing) {
-    if (!retained.has(stale)) stale.remove();
-  }
+  for (const stale of existing) {}
 }
 
killedBy: stable VTT control rendering removes a trailing stale node that never occupies a desired index
statusReason: expected [ …(2) ] to deeply equal [ InteractiveTestElement{ …(22) } ]

[Killed] ConditionalExpression
src/vtt/stable-dom-render.ts:224:9
     }
   }
   for (const stale of existing) {
-    if (!retained.has(stale)) stale.remove();
+    if (true) stale.remove();
   }
 }
killedBy: stable VTT control rendering keeps a pending tray option connected and clickable across live publishes
statusReason: expected null to be InteractiveTestElement{ …(22) } // Object.is equality

[Killed] ConditionalExpression
src/vtt/stable-dom-render.ts:224:9
     }
   }
   for (const stale of existing) {
-    if (!retained.has(stale)) stale.remove();
+    if (false) stale.remove();
   }
 }
killedBy: stable VTT control rendering removes a trailing stale node that never occupies a desired index
statusReason: expected [ …(2) ] to deeply equal [ InteractiveTestElement{ …(22) } ]
