[Killed] ConditionalExpression
src/vtt/survival-policy.ts:52:57
     characters: state.characters.map((character) => ({
       ...character,
       consumables: [
-        ...character.consumables.filter((consumable) => consumable.kind !== 'potion_of_healing'),
+        ...character.consumables.filter((consumable) => false),
         {
           kind: 'potion_of_healing' as const,
killedBy: D382 survival package replaces only old healing potions and preserves unrelated consumables exactly
statusReason: expected [ { kind: 'potion_of_healing', …(3) } ] to deeply equal [ { kind: 'goodberries', …(2) }, …(1) ]

[Killed] MethodExpression
src/vtt/survival-policy.ts:52:12
     characters: state.characters.map((character) => ({
       ...character,
       consumables: [
-        ...character.consumables.filter((consumable) => consumable.kind !== 'potion_of_healing'),
+        ...character.consumables,
         {
           kind: 'potion_of_healing' as const,
killedBy: D382 survival package replaces only old healing potions and preserves unrelated consumables exactly
statusReason: expected [ { …(4) }, …(2) ] to deeply equal [ { kind: 'goodberries', …(2) }, …(1) ]

[Killed] ConditionalExpression
src/vtt/survival-policy.ts:69:7
   caster: CombatantId,
   targetGroups: readonly (readonly CombatantId[])[],
 ): AidPreparationResult {
-  if (targetGroups.length < 1) throw new RangeError('Aid preparation requires at least one casting.');
+  if (false) throw new RangeError('Aid preparation requires at least one casting.');
   const casterState = state.characters.find((character) => character.combatantId === caster);
   if (casterState === undefined) throw new Error(`Aid caster ${caster} is not in the party.`);
killedBy: D382 survival package rejects every malformed Aid plan with its precise boundary error
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/vtt/survival-policy.ts:69:7
   caster: CombatantId,
   targetGroups: readonly (readonly CombatantId[])[],
 ): AidPreparationResult {
-  if (targetGroups.length < 1) throw new RangeError('Aid preparation requires at least one casting.');
+  if (targetGroups.length <= 1) throw new RangeError('Aid preparation requires at least one casting.');
   const casterState = state.characters.find((character) => character.combatantId === caster);
   if (casterState === undefined) throw new Error(`Aid caster ${caster} is not in the party.`);
killedBy: D382 survival package rejects every malformed Aid plan with its precise boundary error
statusReason: expected [Function] to throw error including 'Each Aid casting must name one to thr…' but got 'Aid preparation requires at least one…'

[Killed] EqualityOperator
src/vtt/survival-policy.ts:70:60
   targetGroups: readonly (readonly CombatantId[])[],
 ): AidPreparationResult {
   if (targetGroups.length < 1) throw new RangeError('Aid preparation requires at least one casting.');
-  const casterState = state.characters.find((character) => character.combatantId === caster);
+  const casterState = state.characters.find((character) => character.combatantId !== caster);
   if (casterState === undefined) throw new Error(`Aid caster ${caster} is not in the party.`);
   for (const targets of targetGroups) {
killedBy: D382 survival package potion_free_refill: drinking heals exactly 2d4+2, consumes exactly one real item use, and spends the Bonus Action
statusReason: The prepared Aid caster lacks the level-2 spell slots required for the planned castings.

[Killed] ArrowFunction
src/vtt/survival-policy.ts:70:45
   targetGroups: readonly (readonly CombatantId[])[],
 ): AidPreparationResult {
   if (targetGroups.length < 1) throw new RangeError('Aid preparation requires at least one casting.');
-  const casterState = state.characters.find((character) => character.combatantId === caster);
+  const casterState = state.characters.find(() => undefined);
   if (casterState === undefined) throw new Error(`Aid caster ${caster} is not in the party.`);
   for (const targets of targetGroups) {
killedBy: D382 survival package potion_free_refill: drinking heals exactly 2d4+2, consumes exactly one real item use, and spends the Bonus Action
statusReason: Aid caster combatant:character-2 is not in the party.

[Killed] StringLiteral
src/vtt/survival-policy.ts:71:50
 ): AidPreparationResult {
   if (targetGroups.length < 1) throw new RangeError('Aid preparation requires at least one casting.');
   const casterState = state.characters.find((character) => character.combatantId === caster);
-  if (casterState === undefined) throw new Error(`Aid caster ${caster} is not in the party.`);
+  if (casterState === undefined) throw new Error(``);
   for (const targets of targetGroups) {
     if (targets.length < 1 || targets.length > 3 || new Set(targets).size !== targets.length) {
killedBy: D382 survival package rejects every malformed Aid plan with its precise boundary error
statusReason: expected [Function] to throw error including 'Aid caster combatant:not-in-party is …' but got ''

[Killed] BlockStatement
src/vtt/survival-policy.ts:72:39
   if (targetGroups.length < 1) throw new RangeError('Aid preparation requires at least one casting.');
   const casterState = state.characters.find((character) => character.combatantId === caster);
   if (casterState === undefined) throw new Error(`Aid caster ${caster} is not in the party.`);
-  for (const targets of targetGroups) {
-    if (targets.length < 1 || targets.length > 3 || new Set(targets).size !== targets.length) {
-      throw new RangeError('Each Aid casting must name one to three distinct creatures.');
-    }
-    for (const target of targets) {
-      if (!state.characters.some((character) => character.combatantId === target)) {
-        throw new Error(`Aid target ${target} is not in the party.`);
-      }
-    }
-  }
+  for (const targets of targetGroups) {}
   const levelTwo = casterState.spellSlots.find((slot) => slot.pool === 'shared' && slot.level === 2);
   if (levelTwo === undefined || levelTwo.remaining < targetGroups.length) {
killedBy: D382 survival package rejects every malformed Aid plan with its precise boundary error
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/vtt/survival-policy.ts:73:53
   const casterState = state.characters.find((character) => character.combatantId === caster);
   if (casterState === undefined) throw new Error(`Aid caster ${caster} is not in the party.`);
   for (const targets of targetGroups) {
-    if (targets.length < 1 || targets.length > 3 || new Set(targets).size !== targets.length) {
+    if (targets.length < 1 || targets.length > 3 || false) {
       throw new RangeError('Each Aid casting must name one to three distinct creatures.');
     }
killedBy: D382 survival package rejects every malformed Aid plan with its precise boundary error
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/vtt/survival-policy.ts:73:31
   const casterState = state.characters.find((character) => character.combatantId === caster);
   if (casterState === undefined) throw new Error(`Aid caster ${caster} is not in the party.`);
   for (const targets of targetGroups) {
-    if (targets.length < 1 || targets.length > 3 || new Set(targets).size !== targets.length) {
+    if (targets.length < 1 || targets.length >= 3 || new Set(targets).size !== targets.length) {
       throw new RangeError('Each Aid casting must name one to three distinct creatures.');
     }
killedBy: D382 survival package potion_free_refill: drinking heals exactly 2d4+2, consumes exactly one real item use, and spends the Bonus Action
statusReason: Each Aid casting must name one to three distinct creatures.

[Killed] BlockStatement
src/vtt/survival-policy.ts:76:35
     if (targets.length < 1 || targets.length > 3 || new Set(targets).size !== targets.length) {
       throw new RangeError('Each Aid casting must name one to three distinct creatures.');
     }
-    for (const target of targets) {
-      if (!state.characters.some((character) => character.combatantId === target)) {
-        throw new Error(`Aid target ${target} is not in the party.`);
-      }
-    }
+    for (const target of targets) {}
   }
   const levelTwo = casterState.spellSlots.find((slot) => slot.pool === 'shared' && slot.level === 2);
killedBy: D382 survival package rejects every malformed Aid plan with its precise boundary error
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/vtt/survival-policy.ts:77:49
       throw new RangeError('Each Aid casting must name one to three distinct creatures.');
     }
     for (const target of targets) {
-      if (!state.characters.some((character) => character.combatantId === target)) {
+      if (!state.characters.some((character) => true)) {
         throw new Error(`Aid target ${target} is not in the party.`);
       }
killedBy: D382 survival package rejects every malformed Aid plan with its precise boundary error
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/vtt/survival-policy.ts:77:49
       throw new RangeError('Each Aid casting must name one to three distinct creatures.');
     }
     for (const target of targets) {
-      if (!state.characters.some((character) => character.combatantId === target)) {
+      if (!state.characters.some((character) => character.combatantId !== target)) {
         throw new Error(`Aid target ${target} is not in the party.`);
       }
killedBy: D382 survival package rejects every malformed Aid plan with its precise boundary error
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/vtt/survival-policy.ts:78:25
     }
     for (const target of targets) {
       if (!state.characters.some((character) => character.combatantId === target)) {
-        throw new Error(`Aid target ${target} is not in the party.`);
+        throw new Error(``);
       }
     }
killedBy: D382 survival package rejects every malformed Aid plan with its precise boundary error
statusReason: expected [Function] to throw error including 'Aid target combatant:not-in-party is …' but got ''

[Killed] ConditionalExpression
src/vtt/survival-policy.ts:82:84
       }
     }
   }
-  const levelTwo = casterState.spellSlots.find((slot) => slot.pool === 'shared' && slot.level === 2);
+  const levelTwo = casterState.spellSlots.find((slot) => slot.pool === 'shared' && true);
   if (levelTwo === undefined || levelTwo.remaining < targetGroups.length) {
     throw new Error('The prepared Aid caster lacks the level-2 spell slots required for the planned castings.');
killedBy: D382 survival package aid_stacks: two level-2 castings cover all five PCs for 8 hours without stacking an overlapping target
statusReason: expected [ 4, 2 ] to deeply equal [ 3, 1 ]

[Killed] EqualityOperator
src/vtt/survival-policy.ts:82:84
       }
     }
   }
-  const levelTwo = casterState.spellSlots.find((slot) => slot.pool === 'shared' && slot.level === 2);
+  const levelTwo = casterState.spellSlots.find((slot) => slot.pool === 'shared' && slot.level !== 2);
   if (levelTwo === undefined || levelTwo.remaining < targetGroups.length) {
     throw new Error('The prepared Aid caster lacks the level-2 spell slots required for the planned castings.');
killedBy: D382 survival package aid_stacks: two level-2 castings cover all five PCs for 8 hours without stacking an overlapping target
statusReason: expected [ 4, 2 ] to deeply equal [ 3, 1 ]

[Killed] EqualityOperator
src/vtt/survival-policy.ts:83:33
     }
   }
   const levelTwo = casterState.spellSlots.find((slot) => slot.pool === 'shared' && slot.level === 2);
-  if (levelTwo === undefined || levelTwo.remaining < targetGroups.length) {
+  if (levelTwo === undefined || levelTwo.remaining <= targetGroups.length) {
     throw new Error('The prepared Aid caster lacks the level-2 spell slots required for the planned castings.');
   }
killedBy: D382 survival package allows the exact remaining Aid slot and leaves pre-aided and untargeted creatures unchanged
statusReason: The prepared Aid caster lacks the level-2 spell slots required for the planned castings.

[Killed] EqualityOperator
src/vtt/survival-policy.ts:83:33
     }
   }
   const levelTwo = casterState.spellSlots.find((slot) => slot.pool === 'shared' && slot.level === 2);
-  if (levelTwo === undefined || levelTwo.remaining < targetGroups.length) {
+  if (levelTwo === undefined || levelTwo.remaining >= targetGroups.length) {
     throw new Error('The prepared Aid caster lacks the level-2 spell slots required for the planned castings.');
   }
killedBy: D382 survival package potion_free_refill: drinking heals exactly 2d4+2, consumes exactly one real item use, and spends the Bonus Action
statusReason: The prepared Aid caster lacks the level-2 spell slots required for the planned castings.

[Killed] ConditionalExpression
src/vtt/survival-policy.ts:88:9
   }
   const aided = new Set(targetGroups.flat());
   const characters = state.characters.map((character) => {
-    if (character.combatantId === caster) {
+    if (false) {
       const spellSlots = character.spellSlots.map((slot) =>
         slot.pool === 'shared' && slot.level === 2
killedBy: D382 survival package allows the exact remaining Aid slot and leaves pre-aided and untargeted creatures unchanged
statusReason: expected 1 to be +0 // Object.is equality

[Killed] EqualityOperator
src/vtt/survival-policy.ts:88:9
   }
   const aided = new Set(targetGroups.flat());
   const characters = state.characters.map((character) => {
-    if (character.combatantId === caster) {
+    if (character.combatantId !== caster) {
       const spellSlots = character.spellSlots.map((slot) =>
         slot.pool === 'shared' && slot.level === 2
killedBy: D382 survival package allows the exact remaining Aid slot and leaves pre-aided and untargeted creatures unchanged
statusReason: expected 1 to be +0 // Object.is equality

[Killed] EqualityOperator
src/vtt/survival-policy.ts:90:9
   const characters = state.characters.map((character) => {
     if (character.combatantId === caster) {
       const spellSlots = character.spellSlots.map((slot) =>
-        slot.pool === 'shared' && slot.level === 2
+        slot.pool !== 'shared' && slot.level === 2
           ? { ...slot, remaining: slot.remaining - targetGroups.length }
           : slot);
killedBy: D382 survival package allows the exact remaining Aid slot and leaves pre-aided and untargeted creatures unchanged
statusReason: expected 1 to be +0 // Object.is equality

[Killed] EqualityOperator
src/vtt/survival-policy.ts:90:35
   const characters = state.characters.map((character) => {
     if (character.combatantId === caster) {
       const spellSlots = character.spellSlots.map((slot) =>
-        slot.pool === 'shared' && slot.level === 2
+        slot.pool === 'shared' && slot.level !== 2
           ? { ...slot, remaining: slot.remaining - targetGroups.length }
           : slot);
killedBy: D382 survival package allows the exact remaining Aid slot and leaves pre-aided and untargeted creatures unchanged
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ArithmeticOperator
src/vtt/survival-policy.ts:91:35
     if (character.combatantId === caster) {
       const spellSlots = character.spellSlots.map((slot) =>
         slot.pool === 'shared' && slot.level === 2
-          ? { ...slot, remaining: slot.remaining - targetGroups.length }
+          ? { ...slot, remaining: slot.remaining + targetGroups.length }
           : slot);
       if (!aided.has(character.combatantId) || character.aid !== null) return { ...character, spellSlots };
killedBy: D382 survival package allows the exact remaining Aid slot and leaves pre-aided and untargeted creatures unchanged
statusReason: expected 2 to be +0 // Object.is equality

[Killed] EqualityOperator
src/vtt/survival-policy.ts:93:48
         slot.pool === 'shared' && slot.level === 2
           ? { ...slot, remaining: slot.remaining - targetGroups.length }
           : slot);
-      if (!aided.has(character.combatantId) || character.aid !== null) return { ...character, spellSlots };
+      if (!aided.has(character.combatantId) || character.aid === null) return { ...character, spellSlots };
       return {
         ...character,
killedBy: D382 survival package aid_stacks: two level-2 castings cover all five PCs for 8 hours without stacking an overlapping target
statusReason: expected 38 to be 43 // Object.is equality

[Killed] ConditionalExpression
src/vtt/survival-policy.ts:93:48
         slot.pool === 'shared' && slot.level === 2
           ? { ...slot, remaining: slot.remaining - targetGroups.length }
           : slot);
-      if (!aided.has(character.combatantId) || character.aid !== null) return { ...character, spellSlots };
+      if (!aided.has(character.combatantId) || false) return { ...character, spellSlots };
       return {
         ...character,
killedBy: D382 survival package spends only the caster shared level-2 Aid slot without reapplying Aid
statusReason: expected { characterId: 2, …(13) } to match object { currentHitPoints: 38, …(3) }
(10 matching properties omitted from actual)

[Killed] ArithmeticOperator
src/vtt/survival-policy.ts:97:27
       return {
         ...character,
         spellSlots,
-        currentHitPoints: character.currentHitPoints + AID_HIT_POINT_BONUS,
+        currentHitPoints: character.currentHitPoints - AID_HIT_POINT_BONUS,
         hitPointMaximum: character.hitPointMaximum + AID_HIT_POINT_BONUS,
         aid: { source: caster, amount: AID_HIT_POINT_BONUS },
killedBy: D382 survival package aid_stacks: two level-2 castings cover all five PCs for 8 hours without stacking an overlapping target
statusReason: expected 33 to be 43 // Object.is equality

[Killed] ArithmeticOperator
src/vtt/survival-policy.ts:98:26
         ...character,
         spellSlots,
         currentHitPoints: character.currentHitPoints + AID_HIT_POINT_BONUS,
-        hitPointMaximum: character.hitPointMaximum + AID_HIT_POINT_BONUS,
+        hitPointMaximum: character.hitPointMaximum - AID_HIT_POINT_BONUS,
         aid: { source: caster, amount: AID_HIT_POINT_BONUS },
       };
killedBy: D382 survival package aid_stacks: two level-2 castings cover all five PCs for 8 hours without stacking an overlapping target
statusReason: expected 33 to be 43 // Object.is equality

[Killed] LogicalOperator
src/vtt/survival-policy.ts:102:9
         aid: { source: caster, amount: AID_HIT_POINT_BONUS },
       };
     }
-    if (!aided.has(character.combatantId) || character.aid !== null) return character;
+    if (!aided.has(character.combatantId) && character.aid !== null) return character;
     return {
       ...character,
killedBy: D382 survival package allows the exact remaining Aid slot and leaves pre-aided and untargeted creatures unchanged
statusReason: expected { characterId: 1, …(13) } to deeply equal { characterId: 1, …(13) }

[Killed] ConditionalExpression
src/vtt/survival-policy.ts:102:9
         aid: { source: caster, amount: AID_HIT_POINT_BONUS },
       };
     }
-    if (!aided.has(character.combatantId) || character.aid !== null) return character;
+    if (false) return character;
     return {
       ...character,
killedBy: D382 survival package allows the exact remaining Aid slot and leaves pre-aided and untargeted creatures unchanged
statusReason: expected { characterId: 1, …(13) } to deeply equal { characterId: 1, …(13) }

[Killed] ArithmeticOperator
src/vtt/survival-policy.ts:105:25
     if (!aided.has(character.combatantId) || character.aid !== null) return character;
     return {
       ...character,
-      currentHitPoints: character.currentHitPoints + AID_HIT_POINT_BONUS,
+      currentHitPoints: character.currentHitPoints - AID_HIT_POINT_BONUS,
       hitPointMaximum: character.hitPointMaximum + AID_HIT_POINT_BONUS,
       aid: { source: caster, amount: AID_HIT_POINT_BONUS },
killedBy: D382 survival package aid_stacks: two level-2 castings cover all five PCs for 8 hours without stacking an overlapping target
statusReason: expected 33 to be 43 // Object.is equality

[Killed] ArrayDeclaration
src/vtt/survival-policy.ts:113:71
   return {
     state: { ...state, characters },
     caster,
-    castings: targetGroups.map((targets) => ({ slotLevel: 2, targets: [...targets] })),
+    castings: targetGroups.map((targets) => ({ slotLevel: 2, targets: [] })),
     levelTwoSlotsBefore: levelTwo.remaining,
     levelTwoSlotsAfter: levelTwo.remaining - targetGroups.length,
killedBy: D382 survival package allows the exact remaining Aid slot and leaves pre-aided and untargeted creatures unchanged
statusReason: expected [ { slotLevel: 2, targets: [] } ] to deeply equal [ { slotLevel: 2, targets: [ …(2) ] } ]

[Killed] ArithmeticOperator
src/vtt/survival-policy.ts:115:25
     caster,
     castings: targetGroups.map((targets) => ({ slotLevel: 2, targets: [...targets] })),
     levelTwoSlotsBefore: levelTwo.remaining,
-    levelTwoSlotsAfter: levelTwo.remaining - targetGroups.length,
+    levelTwoSlotsAfter: levelTwo.remaining + targetGroups.length,
   };
 }
killedBy: D382 survival package aid_stacks: two level-2 castings cover all five PCs for 8 hours without stacking an overlapping target
statusReason: expected [ 3, 5 ] to deeply equal [ 3, 1 ]

[Killed] ArrowFunction
src/vtt/survival-policy.ts:120:30
 }
 
 function aidCasterMember(members: readonly LoadedPartyMember[]): LoadedPartyMember {
-  const druid = members.find((member) =>
-    member.source.classes.some((entry) => entry.classId === 'Druid') &&
-    member.spells.some((spell) => spell.id === 'aid'));
+  const druid = members.find(() => undefined);
   if (druid === undefined) throw new Error('The D385 survival party requires a Druid with prepared Aid.');
   return druid;
killedBy: D382 survival package potion_free_refill: drinking heals exactly 2d4+2, consumes exactly one real item use, and spends the Bonus Action
statusReason: The D385 survival party requires a Druid with prepared Aid.

[Killed] LogicalOperator
src/vtt/survival-policy.ts:121:5
 
 function aidCasterMember(members: readonly LoadedPartyMember[]): LoadedPartyMember {
   const druid = members.find((member) =>
-    member.source.classes.some((entry) => entry.classId === 'Druid') &&
-    member.spells.some((spell) => spell.id === 'aid'));
+    member.source.classes.some(entry => entry.classId === 'Druid') || member.spells.some(spell => spell.id === 'aid'));
   if (druid === undefined) throw new Error('The D385 survival party requires a Druid with prepared Aid.');
   return druid;
killedBy: D382 survival package selects only a Druid that actually carries Aid and requires exactly five members
statusReason: The prepared Aid caster lacks the level-2 spell slots required for the planned castings.

[Killed] ConditionalExpression
src/vtt/survival-policy.ts:121:43
 
 function aidCasterMember(members: readonly LoadedPartyMember[]): LoadedPartyMember {
   const druid = members.find((member) =>
-    member.source.classes.some((entry) => entry.classId === 'Druid') &&
+    member.source.classes.some((entry) => true) &&
     member.spells.some((spell) => spell.id === 'aid'));
   if (druid === undefined) throw new Error('The D385 survival party requires a Druid with prepared Aid.');
killedBy: D382 survival package selects only a Druid that actually carries Aid and requires exactly five members
statusReason: The prepared Aid caster lacks the level-2 spell slots required for the planned castings.

[Killed] MethodExpression
src/vtt/survival-policy.ts:122:5
 function aidCasterMember(members: readonly LoadedPartyMember[]): LoadedPartyMember {
   const druid = members.find((member) =>
     member.source.classes.some((entry) => entry.classId === 'Druid') &&
-    member.spells.some((spell) => spell.id === 'aid'));
+    member.spells.every(spell => spell.id === 'aid'));
   if (druid === undefined) throw new Error('The D385 survival party requires a Druid with prepared Aid.');
   return druid;
killedBy: D382 survival package potion_free_refill: drinking heals exactly 2d4+2, consumes exactly one real item use, and spends the Bonus Action
statusReason: The D385 survival party requires a Druid with prepared Aid.

[Killed] ConditionalExpression
src/vtt/survival-policy.ts:122:35
 function aidCasterMember(members: readonly LoadedPartyMember[]): LoadedPartyMember {
   const druid = members.find((member) =>
     member.source.classes.some((entry) => entry.classId === 'Druid') &&
-    member.spells.some((spell) => spell.id === 'aid'));
+    member.spells.some((spell) => true));
   if (druid === undefined) throw new Error('The D385 survival party requires a Druid with prepared Aid.');
   return druid;
killedBy: D382 survival package selects only a Druid that actually carries Aid and requires exactly five members
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/vtt/survival-policy.ts:133:7
   const initial = equipD365HealingPotions(createPartySessionState(members));
   const caster = combatantId(aidCasterMember(members).profile.id);
   const targets = initial.characters.map((character) => character.combatantId);
-  if (targets.length !== 5) throw new Error('The D385 survival party must contain exactly five characters.');
+  if (true) throw new Error('The D385 survival party must contain exactly five characters.');
   return prepareAid(initial, caster, [targets.slice(0, 3), targets.slice(3, 5)]);
 }
killedBy: D382 survival package potion_free_refill: drinking heals exactly 2d4+2, consumes exactly one real item use, and spends the Bonus Action
statusReason: The D385 survival party must contain exactly five characters.

[Killed] EqualityOperator
src/vtt/survival-policy.ts:133:7
   const initial = equipD365HealingPotions(createPartySessionState(members));
   const caster = combatantId(aidCasterMember(members).profile.id);
   const targets = initial.characters.map((character) => character.combatantId);
-  if (targets.length !== 5) throw new Error('The D385 survival party must contain exactly five characters.');
+  if (targets.length === 5) throw new Error('The D385 survival party must contain exactly five characters.');
   return prepareAid(initial, caster, [targets.slice(0, 3), targets.slice(3, 5)]);
 }
killedBy: D382 survival package potion_free_refill: drinking heals exactly 2d4+2, consumes exactly one real item use, and spends the Bonus Action
statusReason: The D385 survival party must contain exactly five characters.

[Killed] MethodExpression
src/vtt/survival-policy.ts:134:60
   const caster = combatantId(aidCasterMember(members).profile.id);
   const targets = initial.characters.map((character) => character.combatantId);
   if (targets.length !== 5) throw new Error('The D385 survival party must contain exactly five characters.');
-  return prepareAid(initial, caster, [targets.slice(0, 3), targets.slice(3, 5)]);
+  return prepareAid(initial, caster, [targets.slice(0, 3), targets]);
 }
 
killedBy: D382 survival package potion_free_refill: drinking heals exactly 2d4+2, consumes exactly one real item use, and spends the Bonus Action
statusReason: Each Aid casting must name one to three distinct creatures.

[Killed] MethodExpression
src/vtt/survival-policy.ts:134:39
   const caster = combatantId(aidCasterMember(members).profile.id);
   const targets = initial.characters.map((character) => character.combatantId);
   if (targets.length !== 5) throw new Error('The D385 survival party must contain exactly five characters.');
-  return prepareAid(initial, caster, [targets.slice(0, 3), targets.slice(3, 5)]);
+  return prepareAid(initial, caster, [targets, targets.slice(3, 5)]);
 }
 
killedBy: D382 survival package potion_free_refill: drinking heals exactly 2d4+2, consumes exactly one real item use, and spends the Bonus Action
statusReason: Each Aid casting must name one to three distinct creatures.

[Killed] MethodExpression
src/vtt/survival-policy.ts:138:10
 }
 
 export function averageHitDieHealing(sides: 6 | 8 | 10 | 12, constitutionModifier: number): number {
-  return Math.max(1, (sides + 1) / 2 + constitutionModifier);
+  return Math.min(1, (sides + 1) / 2 + constitutionModifier);
 }
 
killedBy: D382 survival package thrift_spends_anyway: skips a Hit Point Die below its average-healing threshold and spends at the first integer above it
statusReason: expected 1 to be 6.5 // Object.is equality

[Killed] ArithmeticOperator
src/vtt/survival-policy.ts:138:23
 }
 
 export function averageHitDieHealing(sides: 6 | 8 | 10 | 12, constitutionModifier: number): number {
-  return Math.max(1, (sides + 1) / 2 + constitutionModifier);
+  return Math.max(1, (sides - 1) / 2 + constitutionModifier);
 }
 
killedBy: D382 survival package thrift_spends_anyway: skips a Hit Point Die below its average-healing threshold and spends at the first integer above it
statusReason: expected 5.5 to be 6.5 // Object.is equality

[Killed] ConditionalExpression
src/vtt/survival-policy.ts:146:7
   readonly sides: 6 | 8 | 10 | 12;
   readonly constitutionModifier: number;
 }): boolean {
-  if (!Number.isFinite(input.missingHitPoints) || input.missingHitPoints < 0) {
+  if (false) {
     throw new RangeError('Hit-Die thrift requires a finite nonnegative Hit Point deficit.');
   }
killedBy: D382 survival package validates every thrift numeric boundary and preserves exact accepted endpoints
statusReason: expected [Function] to throw an error
