[Killed] BooleanLiteral
src/vtt/survival-policy.ts:146:7
   readonly sides: 6 | 8 | 10 | 12;
   readonly constitutionModifier: number;
 }): boolean {
-  if (!Number.isFinite(input.missingHitPoints) || input.missingHitPoints < 0) {
+  if (Number.isFinite(input.missingHitPoints) || input.missingHitPoints < 0) {
     throw new RangeError('Hit-Die thrift requires a finite nonnegative Hit Point deficit.');
   }
killedBy: D382 survival package thrift_spends_anyway: skips a Hit Point Die below its average-healing threshold and spends at the first integer above it
statusReason: Hit-Die thrift requires a finite nonnegative Hit Point deficit.

[Killed] EqualityOperator
src/vtt/survival-policy.ts:149:10
   if (!Number.isFinite(input.missingHitPoints) || input.missingHitPoints < 0) {
     throw new RangeError('Hit-Die thrift requires a finite nonnegative Hit Point deficit.');
   }
-  return input.missingHitPoints >= averageHitDieHealing(input.sides, input.constitutionModifier);
+  return input.missingHitPoints < averageHitDieHealing(input.sides, input.constitutionModifier);
 }
 
killedBy: D382 survival package thrift_spends_anyway: skips a Hit Point Die below its average-healing threshold and spends at the first integer above it
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/vtt/survival-policy.ts:149:10
   if (!Number.isFinite(input.missingHitPoints) || input.missingHitPoints < 0) {
     throw new RangeError('Hit-Die thrift requires a finite nonnegative Hit Point deficit.');
   }
-  return input.missingHitPoints >= averageHitDieHealing(input.sides, input.constitutionModifier);
+  return false;
 }
 
killedBy: D382 survival package thrift_spends_anyway: skips a Hit Point Die below its average-healing threshold and spends at the first integer above it
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/vtt/survival-policy.ts:153:60
 }
 
 export function averageCureWoundsHealing(slotLevel: number, spellcastingModifier: number): number {
-  if (!Number.isSafeInteger(slotLevel) || slotLevel < 1 || slotLevel > 9) {
+  if (!Number.isSafeInteger(slotLevel) || slotLevel < 1 || slotLevel <= 9) {
     throw new RangeError('Cure Wounds slot level must be an integer from 1 through 9.');
   }
killedBy: D382 survival package overheal_cast: spell thrift casts at exact average healing and refuses one HP below it
statusReason: Cure Wounds slot level must be an integer from 1 through 9.

[Killed] ConditionalExpression
src/vtt/survival-policy.ts:153:7
 }
 
 export function averageCureWoundsHealing(slotLevel: number, spellcastingModifier: number): number {
-  if (!Number.isSafeInteger(slotLevel) || slotLevel < 1 || slotLevel > 9) {
+  if (true) {
     throw new RangeError('Cure Wounds slot level must be an integer from 1 through 9.');
   }
killedBy: D382 survival package overheal_cast: spell thrift casts at exact average healing and refuses one HP below it
statusReason: Cure Wounds slot level must be an integer from 1 through 9.

[Killed] ArithmeticOperator
src/vtt/survival-policy.ts:158:10
   }
   // Cure Wounds restores 2d8 + modifier and adds 2d8 per higher slot:
   // docs/srd/full/srd-5.2.1.txt:7493-7508.
-  return slotLevel * 9 + spellcastingModifier;
+  return slotLevel / 9 + spellcastingModifier;
 }
 
killedBy: D382 survival package overheal_cast: spell thrift casts at exact average healing and refuses one HP below it
statusReason: expected 3.111111111111111 to be 12 // Object.is equality

[Killed] ArithmeticOperator
src/vtt/survival-policy.ts:158:10
   }
   // Cure Wounds restores 2d8 + modifier and adds 2d8 per higher slot:
   // docs/srd/full/srd-5.2.1.txt:7493-7508.
-  return slotLevel * 9 + spellcastingModifier;
+  return slotLevel * 9 - spellcastingModifier;
 }
 
killedBy: D382 survival package overheal_cast: spell thrift casts at exact average healing and refuses one HP below it
statusReason: expected 6 to be 12 // Object.is equality

[Killed] ConditionalExpression
src/vtt/survival-policy.ts:165:7
   readonly missingHitPoints: number;
   readonly averageHealing: number;
 }): boolean {
-  if (!Number.isFinite(input.missingHitPoints) || input.missingHitPoints < 0 ||
-      !Number.isFinite(input.averageHealing) || input.averageHealing < 1) {
+  if (false) {
     throw new RangeError('Average-healing thrift requires a nonnegative deficit and positive healing.');
   }
killedBy: D382 survival package validates every thrift numeric boundary and preserves exact accepted endpoints
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/vtt/survival-policy.ts:165:7
   readonly missingHitPoints: number;
   readonly averageHealing: number;
 }): boolean {
-  if (!Number.isFinite(input.missingHitPoints) || input.missingHitPoints < 0 ||
-      !Number.isFinite(input.averageHealing) || input.averageHealing < 1) {
+  if (false || input.averageHealing < 1) {
     throw new RangeError('Average-healing thrift requires a nonnegative deficit and positive healing.');
   }
killedBy: D382 survival package validates every thrift numeric boundary and preserves exact accepted endpoints
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/vtt/survival-policy.ts:166:49
   readonly averageHealing: number;
 }): boolean {
   if (!Number.isFinite(input.missingHitPoints) || input.missingHitPoints < 0 ||
-      !Number.isFinite(input.averageHealing) || input.averageHealing < 1) {
+      !Number.isFinite(input.averageHealing) || input.averageHealing <= 1) {
     throw new RangeError('Average-healing thrift requires a nonnegative deficit and positive healing.');
   }
killedBy: D382 survival package validates every thrift numeric boundary and preserves exact accepted endpoints
statusReason: Average-healing thrift requires a nonnegative deficit and positive healing.

[Killed] BooleanLiteral
src/vtt/survival-policy.ts:166:7
   readonly averageHealing: number;
 }): boolean {
   if (!Number.isFinite(input.missingHitPoints) || input.missingHitPoints < 0 ||
-      !Number.isFinite(input.averageHealing) || input.averageHealing < 1) {
+      Number.isFinite(input.averageHealing) || input.averageHealing < 1) {
     throw new RangeError('Average-healing thrift requires a nonnegative deficit and positive healing.');
   }
killedBy: D382 survival package overheal_cast: spell thrift casts at exact average healing and refuses one HP below it
statusReason: Average-healing thrift requires a nonnegative deficit and positive healing.

[Killed] EqualityOperator
src/vtt/survival-policy.ts:169:10
       !Number.isFinite(input.averageHealing) || input.averageHealing < 1) {
     throw new RangeError('Average-healing thrift requires a nonnegative deficit and positive healing.');
   }
-  return input.averageHealing <= input.missingHitPoints;
+  return input.averageHealing > input.missingHitPoints;
 }
 
killedBy: D382 survival package overheal_cast: spell thrift casts at exact average healing and refuses one HP below it
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/vtt/survival-policy.ts:169:10
       !Number.isFinite(input.averageHealing) || input.averageHealing < 1) {
     throw new RangeError('Average-healing thrift requires a nonnegative deficit and positive healing.');
   }
-  return input.averageHealing <= input.missingHitPoints;
+  return false;
 }
 
killedBy: D382 survival package overheal_cast: spell thrift casts at exact average healing and refuses one HP below it
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/vtt/survival-policy.ts:192:7
     readonly clericSpiritGuardiansSlotsReserved: number;
   },
 ): BetweenFightCureWoundsResult {
-  if (!Number.isSafeInteger(policy.clericBlessOpeningsReserved) || policy.clericBlessOpeningsReserved < 0 ||
-      !Number.isSafeInteger(policy.clericSpiritGuardiansSlotsReserved) || policy.clericSpiritGuardiansSlotsReserved < 0) {
+  if (false) {
     throw new RangeError('Between-fight slot reserves must be nonnegative integers.');
   }
killedBy: D382 survival package validates both reserve inputs independently and accepts exact zero reserves
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/vtt/survival-policy.ts:192:7
     readonly clericSpiritGuardiansSlotsReserved: number;
   },
 ): BetweenFightCureWoundsResult {
-  if (!Number.isSafeInteger(policy.clericBlessOpeningsReserved) || policy.clericBlessOpeningsReserved < 0 ||
-      !Number.isSafeInteger(policy.clericSpiritGuardiansSlotsReserved) || policy.clericSpiritGuardiansSlotsReserved < 0) {
+  if (false || policy.clericSpiritGuardiansSlotsReserved < 0) {
     throw new RangeError('Between-fight slot reserves must be nonnegative integers.');
   }
killedBy: D382 survival package validates both reserve inputs independently and accepts exact zero reserves
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/vtt/survival-policy.ts:193:75
   },
 ): BetweenFightCureWoundsResult {
   if (!Number.isSafeInteger(policy.clericBlessOpeningsReserved) || policy.clericBlessOpeningsReserved < 0 ||
-      !Number.isSafeInteger(policy.clericSpiritGuardiansSlotsReserved) || policy.clericSpiritGuardiansSlotsReserved < 0) {
+      !Number.isSafeInteger(policy.clericSpiritGuardiansSlotsReserved) || policy.clericSpiritGuardiansSlotsReserved <= 0) {
     throw new RangeError('Between-fight slot reserves must be nonnegative integers.');
   }
killedBy: D382 survival package finds Cure Wounds through prepared, mixed-known, and granted spell access
statusReason: Between-fight slot reserves must be nonnegative integers.

[Killed] BlockStatement
src/vtt/survival-policy.ts:193:122
   },
 ): BetweenFightCureWoundsResult {
   if (!Number.isSafeInteger(policy.clericBlessOpeningsReserved) || policy.clericBlessOpeningsReserved < 0 ||
-      !Number.isSafeInteger(policy.clericSpiritGuardiansSlotsReserved) || policy.clericSpiritGuardiansSlotsReserved < 0) {
-    throw new RangeError('Between-fight slot reserves must be nonnegative integers.');
-  }
+      !Number.isSafeInteger(policy.clericSpiritGuardiansSlotsReserved) || policy.clericSpiritGuardiansSlotsReserved < 0) {}
   let current = state;
   const castings: BetweenFightCureWoundsCasting[] = [];
killedBy: D382 survival package validates both reserve inputs independently and accepts exact zero reserves
statusReason: expected [Function] to throw an error

[Killed] ArrowFunction
src/vtt/survival-policy.ts:200:47
   const castings: BetweenFightCureWoundsCasting[] = [];
   while (true) {
     const candidates = members.flatMap((member) => {
-      const source = member.spellcasting.find((entry) =>
-        entry.preparedSpells.some((spell) => spell.id === 'cure-wounds') ||
-        entry.knownSpells.some((spell) => spell.id === 'cure-wounds') ||
-        entry.grants.some((grant) => grant.spell.id === 'cure-wounds'));
+      const source = member.spellcasting.find(() => undefined);
       if (source === undefined) return [];
       const caster = current.characters.find((character) => character.combatantId === member.profile.id);
killedBy: D382 survival package between-fight Cure Wounds spends the cheapest sufficient slot and preserves Bless plus Spirit Guardians reserves
statusReason: expected undefined to deeply equal { …(4) }

[Killed] MethodExpression
src/vtt/survival-policy.ts:201:9
   while (true) {
     const candidates = members.flatMap((member) => {
       const source = member.spellcasting.find((entry) =>
-        entry.preparedSpells.some((spell) => spell.id === 'cure-wounds') ||
+        entry.preparedSpells.every(spell => spell.id === 'cure-wounds') ||
         entry.knownSpells.some((spell) => spell.id === 'cure-wounds') ||
         entry.grants.some((grant) => grant.spell.id === 'cure-wounds'));
killedBy: D382 survival package between-fight Cure Wounds spends the cheapest sufficient slot and preserves Bless plus Spirit Guardians reserves
statusReason: expected undefined to deeply equal { …(4) }

[Killed] ConditionalExpression
src/vtt/survival-policy.ts:201:9
   while (true) {
     const candidates = members.flatMap((member) => {
       const source = member.spellcasting.find((entry) =>
-        entry.preparedSpells.some((spell) => spell.id === 'cure-wounds') ||
-        entry.knownSpells.some((spell) => spell.id === 'cure-wounds') ||
-        entry.grants.some((grant) => grant.spell.id === 'cure-wounds'));
+        false);
       if (source === undefined) return [];
       const caster = current.characters.find((character) => character.combatantId === member.profile.id);
killedBy: D382 survival package between-fight Cure Wounds spends the cheapest sufficient slot and preserves Bless plus Spirit Guardians reserves
statusReason: expected undefined to deeply equal { …(4) }

[Killed] EqualityOperator
src/vtt/survival-policy.ts:202:43
     const candidates = members.flatMap((member) => {
       const source = member.spellcasting.find((entry) =>
         entry.preparedSpells.some((spell) => spell.id === 'cure-wounds') ||
-        entry.knownSpells.some((spell) => spell.id === 'cure-wounds') ||
+        entry.knownSpells.some((spell) => spell.id !== 'cure-wounds') ||
         entry.grants.some((grant) => grant.spell.id === 'cure-wounds'));
       if (source === undefined) return [];
killedBy: D382 survival package pins the fixed 30-seed final-encounter survival fraction at or above two thirds
statusReason: expected { successes: 30, total: 30 } to deeply equal { successes: 29, total: 30 }

[Killed] MethodExpression
src/vtt/survival-policy.ts:202:9
     const candidates = members.flatMap((member) => {
       const source = member.spellcasting.find((entry) =>
         entry.preparedSpells.some((spell) => spell.id === 'cure-wounds') ||
-        entry.knownSpells.some((spell) => spell.id === 'cure-wounds') ||
+        entry.knownSpells.every(spell => spell.id === 'cure-wounds') ||
         entry.grants.some((grant) => grant.spell.id === 'cure-wounds'));
       if (source === undefined) return [];
killedBy: D382 survival package finds Cure Wounds through prepared, mixed-known, and granted spell access
statusReason: expected [] to deeply equal [ { …(4) } ]

[Killed] ConditionalExpression
src/vtt/survival-policy.ts:203:38
       const source = member.spellcasting.find((entry) =>
         entry.preparedSpells.some((spell) => spell.id === 'cure-wounds') ||
         entry.knownSpells.some((spell) => spell.id === 'cure-wounds') ||
-        entry.grants.some((grant) => grant.spell.id === 'cure-wounds'));
+        entry.grants.some((grant) => true));
       if (source === undefined) return [];
       const caster = current.characters.find((character) => character.combatantId === member.profile.id);
killedBy: D382 survival package finds Cure Wounds through prepared, mixed-known, and granted spell access
statusReason: expected [ { …(4) } ] to deeply equal []

[Killed] ConditionalExpression
src/vtt/survival-policy.ts:203:38
       const source = member.spellcasting.find((entry) =>
         entry.preparedSpells.some((spell) => spell.id === 'cure-wounds') ||
         entry.knownSpells.some((spell) => spell.id === 'cure-wounds') ||
-        entry.grants.some((grant) => grant.spell.id === 'cure-wounds'));
+        entry.grants.some((grant) => false));
       if (source === undefined) return [];
       const caster = current.characters.find((character) => character.combatantId === member.profile.id);
killedBy: D382 survival package finds Cure Wounds through prepared, mixed-known, and granted spell access
statusReason: expected [] to deeply equal [ { …(4) } ]

[Killed] ConditionalExpression
src/vtt/survival-policy.ts:205:61
         entry.knownSpells.some((spell) => spell.id === 'cure-wounds') ||
         entry.grants.some((grant) => grant.spell.id === 'cure-wounds'));
       if (source === undefined) return [];
-      const caster = current.characters.find((character) => character.combatantId === member.profile.id);
+      const caster = current.characters.find((character) => true);
       if (caster === undefined || caster.life !== 'living') return [];
       const isCleric = member.source.classes.some((entry) => entry.classId === 'Cleric');
killedBy: D382 survival package between-fight Cure Wounds spends the cheapest sufficient slot and preserves Bless plus Spirit Guardians reserves
statusReason: expected undefined to deeply equal { …(4) }

[Killed] EqualityOperator
src/vtt/survival-policy.ts:205:61
         entry.knownSpells.some((spell) => spell.id === 'cure-wounds') ||
         entry.grants.some((grant) => grant.spell.id === 'cure-wounds'));
       if (source === undefined) return [];
-      const caster = current.characters.find((character) => character.combatantId === member.profile.id);
+      const caster = current.characters.find((character) => character.combatantId !== member.profile.id);
       if (caster === undefined || caster.life !== 'living') return [];
       const isCleric = member.source.classes.some((entry) => entry.classId === 'Cleric');
killedBy: D382 survival package between-fight Cure Wounds spends the cheapest sufficient slot and preserves Bless plus Spirit Guardians reserves
statusReason: expected undefined to deeply equal { …(4) }

[Killed] ConditionalExpression
src/vtt/survival-policy.ts:206:35
         entry.grants.some((grant) => grant.spell.id === 'cure-wounds'));
       if (source === undefined) return [];
       const caster = current.characters.find((character) => character.combatantId === member.profile.id);
-      if (caster === undefined || caster.life !== 'living') return [];
+      if (caster === undefined || false) return [];
       const isCleric = member.source.classes.some((entry) => entry.classId === 'Cleric');
       const reserve = isCleric
killedBy: D382 survival package ignores absent, dead, and spell-less candidate casters
statusReason: expected [ { …(4) } ] to deeply equal []

[Killed] EqualityOperator
src/vtt/survival-policy.ts:206:35
         entry.grants.some((grant) => grant.spell.id === 'cure-wounds'));
       if (source === undefined) return [];
       const caster = current.characters.find((character) => character.combatantId === member.profile.id);
-      if (caster === undefined || caster.life !== 'living') return [];
+      if (caster === undefined || caster.life === 'living') return [];
       const isCleric = member.source.classes.some((entry) => entry.classId === 'Cleric');
       const reserve = isCleric
killedBy: D382 survival package between-fight Cure Wounds spends the cheapest sufficient slot and preserves Bless plus Spirit Guardians reserves
statusReason: expected undefined to deeply equal { …(4) }

[Killed] MethodExpression
src/vtt/survival-policy.ts:207:24
       if (source === undefined) return [];
       const caster = current.characters.find((character) => character.combatantId === member.profile.id);
       if (caster === undefined || caster.life !== 'living') return [];
-      const isCleric = member.source.classes.some((entry) => entry.classId === 'Cleric');
+      const isCleric = member.source.classes.every(entry => entry.classId === 'Cleric');
       const reserve = isCleric
         ? policy.clericBlessOpeningsReserved + policy.clericSpiritGuardiansSlotsReserved
killedBy: D382 survival package counts only shared slots and preserves the exact combined Cleric reserve boundary
statusReason: expected [ { …(4) } ] to deeply equal []

[Killed] ArrowFunction
src/vtt/survival-policy.ts:207:51
       if (source === undefined) return [];
       const caster = current.characters.find((character) => character.combatantId === member.profile.id);
       if (caster === undefined || caster.life !== 'living') return [];
-      const isCleric = member.source.classes.some((entry) => entry.classId === 'Cleric');
+      const isCleric = member.source.classes.some(() => undefined);
       const reserve = isCleric
         ? policy.clericBlessOpeningsReserved + policy.clericSpiritGuardiansSlotsReserved
killedBy: D382 survival package counts only shared slots and preserves the exact combined Cleric reserve boundary
statusReason: expected [ { …(4) } ] to deeply equal []

[Killed] ArithmeticOperator
src/vtt/survival-policy.ts:209:11
       if (caster === undefined || caster.life !== 'living') return [];
       const isCleric = member.source.classes.some((entry) => entry.classId === 'Cleric');
       const reserve = isCleric
-        ? policy.clericBlessOpeningsReserved + policy.clericSpiritGuardiansSlotsReserved
+        ? policy.clericBlessOpeningsReserved - policy.clericSpiritGuardiansSlotsReserved
         : 0;
       const remainingSharedSlots = caster.spellSlots
killedBy: D382 survival package counts only shared slots and preserves the exact combined Cleric reserve boundary
statusReason: expected [ { …(4) } ] to deeply equal []

[Killed] MethodExpression
src/vtt/survival-policy.ts:211:36
       const reserve = isCleric
         ? policy.clericBlessOpeningsReserved + policy.clericSpiritGuardiansSlotsReserved
         : 0;
-      const remainingSharedSlots = caster.spellSlots
-        .filter((slot) => slot.pool === 'shared')
+      const remainingSharedSlots = caster.spellSlots
         .reduce((total, slot) => total + slot.remaining, 0);
       return caster.spellSlots
killedBy: D382 survival package counts only shared slots and preserves the exact combined Cleric reserve boundary
statusReason: expected [ { …(4) } ] to deeply equal []

[Killed] ConditionalExpression
src/vtt/survival-policy.ts:212:27
         ? policy.clericBlessOpeningsReserved + policy.clericSpiritGuardiansSlotsReserved
         : 0;
       const remainingSharedSlots = caster.spellSlots
-        .filter((slot) => slot.pool === 'shared')
+        .filter((slot) => true)
         .reduce((total, slot) => total + slot.remaining, 0);
       return caster.spellSlots
killedBy: D382 survival package counts only shared slots and preserves the exact combined Cleric reserve boundary
statusReason: expected [ { …(4) } ] to deeply equal []

[Killed] ConditionalExpression
src/vtt/survival-policy.ts:212:27
         ? policy.clericBlessOpeningsReserved + policy.clericSpiritGuardiansSlotsReserved
         : 0;
       const remainingSharedSlots = caster.spellSlots
-        .filter((slot) => slot.pool === 'shared')
+        .filter((slot) => false)
         .reduce((total, slot) => total + slot.remaining, 0);
       return caster.spellSlots
killedBy: D382 survival package between-fight Cure Wounds spends the cheapest sufficient slot and preserves Bless plus Spirit Guardians reserves
statusReason: expected undefined to deeply equal { …(4) }

[Killed] ArithmeticOperator
src/vtt/survival-policy.ts:213:34
         : 0;
       const remainingSharedSlots = caster.spellSlots
         .filter((slot) => slot.pool === 'shared')
-        .reduce((total, slot) => total + slot.remaining, 0);
+        .reduce((total, slot) => total - slot.remaining, 0);
       return caster.spellSlots
         .filter((slot) => slot.pool === 'shared' && slot.remaining > 0 && remainingSharedSlots - 1 >= reserve)
killedBy: D382 survival package between-fight Cure Wounds spends the cheapest sufficient slot and preserves Bless plus Spirit Guardians reserves
statusReason: expected undefined to deeply equal { …(4) }

[Killed] MethodExpression
src/vtt/survival-policy.ts:214:14
       const remainingSharedSlots = caster.spellSlots
         .filter((slot) => slot.pool === 'shared')
         .reduce((total, slot) => total + slot.remaining, 0);
-      return caster.spellSlots
-        .filter((slot) => slot.pool === 'shared' && slot.remaining > 0 && remainingSharedSlots - 1 >= reserve)
+      return caster.spellSlots
         .map((slot) => ({
           caster,
killedBy: D382 survival package counts only shared slots and preserves the exact combined Cleric reserve boundary
statusReason: expected [ { …(4) } ] to deeply equal []

[Killed] LogicalOperator
src/vtt/survival-policy.ts:215:27
         .filter((slot) => slot.pool === 'shared')
         .reduce((total, slot) => total + slot.remaining, 0);
       return caster.spellSlots
-        .filter((slot) => slot.pool === 'shared' && slot.remaining > 0 && remainingSharedSlots - 1 >= reserve)
+        .filter((slot) => slot.pool === 'shared' || slot.remaining > 0 && remainingSharedSlots - 1 >= reserve)
         .map((slot) => ({
           caster,
killedBy: D382 survival package selects a positive shared slot, then decrements only its exact pool and level
statusReason: expected [ { …(4) } ] to deeply equal [ { …(4) } ]

[Killed] ConditionalExpression
src/vtt/survival-policy.ts:215:27
         .filter((slot) => slot.pool === 'shared')
         .reduce((total, slot) => total + slot.remaining, 0);
       return caster.spellSlots
-        .filter((slot) => slot.pool === 'shared' && slot.remaining > 0 && remainingSharedSlots - 1 >= reserve)
+        .filter((slot) => true)
         .map((slot) => ({
           caster,
killedBy: D382 survival package counts only shared slots and preserves the exact combined Cleric reserve boundary
statusReason: expected [ { …(4) } ] to deeply equal []

[Killed] LogicalOperator
src/vtt/survival-policy.ts:222:7
           averageHealing: averageCureWoundsHealing(slot.level, source.spellcastingModifier),
         }));
     }).sort((left, right) =>
-      left.slot.level - right.slot.level ||
-      left.caster.combatantId.localeCompare(right.caster.combatantId));
+      left.slot.level - right.slot.level && left.caster.combatantId.localeCompare(right.caster.combatantId));
     const selected = candidates.find((candidate) => current.characters.some((target) =>
       target.life === 'living' && shouldCastAverageHealing({
killedBy: D382 survival package breaks equal slot and target deficits by combatant identity
statusReason: expected { …(4) } to deeply equal { …(4) }

[Killed] ArithmeticOperator
src/vtt/survival-policy.ts:222:7
           averageHealing: averageCureWoundsHealing(slot.level, source.spellcastingModifier),
         }));
     }).sort((left, right) =>
-      left.slot.level - right.slot.level ||
+      left.slot.level + right.slot.level ||
       left.caster.combatantId.localeCompare(right.caster.combatantId));
     const selected = candidates.find((candidate) => current.characters.some((target) =>
killedBy: D382 survival package breaks equal slot and target deficits by combatant identity
statusReason: expected { …(4) } to deeply equal { …(4) }

[Killed] ArrowFunction
src/vtt/survival-policy.ts:224:38
     }).sort((left, right) =>
       left.slot.level - right.slot.level ||
       left.caster.combatantId.localeCompare(right.caster.combatantId));
-    const selected = candidates.find((candidate) => current.characters.some((target) =>
-      target.life === 'living' && shouldCastAverageHealing({
-        missingHitPoints: target.hitPointMaximum - target.currentHitPoints,
-        averageHealing: candidate.averageHealing,
-      })));
+    const selected = candidates.find(() => undefined);
     if (selected === undefined) break;
     const target = [...current.characters]
killedBy: D382 survival package between-fight Cure Wounds spends the cheapest sufficient slot and preserves Bless plus Spirit Guardians reserves
statusReason: expected undefined to deeply equal { …(4) }

[Killed] ArrowFunction
src/vtt/survival-policy.ts:224:77
     }).sort((left, right) =>
       left.slot.level - right.slot.level ||
       left.caster.combatantId.localeCompare(right.caster.combatantId));
-    const selected = candidates.find((candidate) => current.characters.some((target) =>
-      target.life === 'living' && shouldCastAverageHealing({
-        missingHitPoints: target.hitPointMaximum - target.currentHitPoints,
-        averageHealing: candidate.averageHealing,
-      })));
+    const selected = candidates.find((candidate) => current.characters.some(() => undefined));
     if (selected === undefined) break;
     const target = [...current.characters]
killedBy: D382 survival package between-fight Cure Wounds spends the cheapest sufficient slot and preserves Bless plus Spirit Guardians reserves
statusReason: expected undefined to deeply equal { …(4) }

[Killed] ConditionalExpression
src/vtt/survival-policy.ts:225:7
       left.slot.level - right.slot.level ||
       left.caster.combatantId.localeCompare(right.caster.combatantId));
     const selected = candidates.find((candidate) => current.characters.some((target) =>
-      target.life === 'living' && shouldCastAverageHealing({
-        missingHitPoints: target.hitPointMaximum - target.currentHitPoints,
-        averageHealing: candidate.averageHealing,
-      })));
+      false));
     if (selected === undefined) break;
     const target = [...current.characters]
killedBy: D382 survival package between-fight Cure Wounds spends the cheapest sufficient slot and preserves Bless plus Spirit Guardians reserves
statusReason: expected undefined to deeply equal { …(4) }

[Killed] EqualityOperator
src/vtt/survival-policy.ts:225:7
       left.slot.level - right.slot.level ||
       left.caster.combatantId.localeCompare(right.caster.combatantId));
     const selected = candidates.find((candidate) => current.characters.some((target) =>
-      target.life === 'living' && shouldCastAverageHealing({
+      target.life !== 'living' && shouldCastAverageHealing({
         missingHitPoints: target.hitPointMaximum - target.currentHitPoints,
         averageHealing: candidate.averageHealing,
killedBy: D382 survival package between-fight Cure Wounds spends the cheapest sufficient slot and preserves Bless plus Spirit Guardians reserves
statusReason: expected undefined to deeply equal { …(4) }
