[Killed] ArithmeticOperator
src/vtt/survival-policy.ts:226:27
       left.caster.combatantId.localeCompare(right.caster.combatantId));
     const selected = candidates.find((candidate) => current.characters.some((target) =>
       target.life === 'living' && shouldCastAverageHealing({
-        missingHitPoints: target.hitPointMaximum - target.currentHitPoints,
+        missingHitPoints: target.hitPointMaximum + target.currentHitPoints,
         averageHealing: candidate.averageHealing,
       })));
killedBy: D382 survival package chooses the sufficient caster and the living target with the greatest real deficit
statusReason: expected [] to deeply equal [ { …(4) } ]

[Killed] MethodExpression
src/vtt/survival-policy.ts:230:20
         averageHealing: candidate.averageHealing,
       })));
     if (selected === undefined) break;
-    const target = [...current.characters]
-      .filter((candidate) => candidate.life === 'living' && shouldCastAverageHealing({
-        missingHitPoints: candidate.hitPointMaximum - candidate.currentHitPoints,
-        averageHealing: selected.averageHealing,
-      }))
-      .sort((left, right) =>
-        (right.hitPointMaximum - right.currentHitPoints) - (left.hitPointMaximum - left.currentHitPoints) ||
-        left.combatantId.localeCompare(right.combatantId))[0];
+    const target = [...current.characters].filter(candidate => candidate.life === 'living' && shouldCastAverageHealing({
+  missingHitPoints: candidate.hitPointMaximum - candidate.currentHitPoints,
+  averageHealing: selected.averageHealing
+}))[0];
     if (target === undefined) break;
     current = {
killedBy: D382 survival package breaks equal slot and target deficits by combatant identity
statusReason: expected { …(4) } to deeply equal { …(4) }

[Killed] MethodExpression
src/vtt/survival-policy.ts:230:20
         averageHealing: candidate.averageHealing,
       })));
     if (selected === undefined) break;
-    const target = [...current.characters]
-      .filter((candidate) => candidate.life === 'living' && shouldCastAverageHealing({
-        missingHitPoints: candidate.hitPointMaximum - candidate.currentHitPoints,
-        averageHealing: selected.averageHealing,
-      }))
+    const target = [...current.characters]
       .sort((left, right) =>
         (right.hitPointMaximum - right.currentHitPoints) - (left.hitPointMaximum - left.currentHitPoints) ||
killedBy: D382 survival package chooses the sufficient caster and the living target with the greatest real deficit
statusReason: expected [ { …(4) } ] to deeply equal [ { …(4) } ]

[Killed] ArrowFunction
src/vtt/survival-policy.ts:231:15
       })));
     if (selected === undefined) break;
     const target = [...current.characters]
-      .filter((candidate) => candidate.life === 'living' && shouldCastAverageHealing({
-        missingHitPoints: candidate.hitPointMaximum - candidate.currentHitPoints,
-        averageHealing: selected.averageHealing,
-      }))
+      .filter(() => undefined)
       .sort((left, right) =>
         (right.hitPointMaximum - right.currentHitPoints) - (left.hitPointMaximum - left.currentHitPoints) ||
killedBy: D382 survival package between-fight Cure Wounds spends the cheapest sufficient slot and preserves Bless plus Spirit Guardians reserves
statusReason: expected undefined to deeply equal { …(4) }

[Killed] ConditionalExpression
src/vtt/survival-policy.ts:231:30
       })));
     if (selected === undefined) break;
     const target = [...current.characters]
-      .filter((candidate) => candidate.life === 'living' && shouldCastAverageHealing({
-        missingHitPoints: candidate.hitPointMaximum - candidate.currentHitPoints,
-        averageHealing: selected.averageHealing,
-      }))
+      .filter((candidate) => true)
       .sort((left, right) =>
         (right.hitPointMaximum - right.currentHitPoints) - (left.hitPointMaximum - left.currentHitPoints) ||
killedBy: D382 survival package chooses the sufficient caster and the living target with the greatest real deficit
statusReason: expected [ { …(4) } ] to deeply equal [ { …(4) } ]

[Survived] ArithmeticOperator
src/vtt/survival-policy.ts:232:27
     if (selected === undefined) break;
     const target = [...current.characters]
       .filter((candidate) => candidate.life === 'living' && shouldCastAverageHealing({
-        missingHitPoints: candidate.hitPointMaximum - candidate.currentHitPoints,
+        missingHitPoints: candidate.hitPointMaximum + candidate.currentHitPoints,
         averageHealing: selected.averageHealing,
       }))

[Killed] ArithmeticOperator
src/vtt/survival-policy.ts:236:61
         averageHealing: selected.averageHealing,
       }))
       .sort((left, right) =>
-        (right.hitPointMaximum - right.currentHitPoints) - (left.hitPointMaximum - left.currentHitPoints) ||
+        (right.hitPointMaximum - right.currentHitPoints) - (left.hitPointMaximum + left.currentHitPoints) ||
         left.combatantId.localeCompare(right.combatantId))[0];
     if (target === undefined) break;
killedBy: D382 survival package chooses the sufficient caster and the living target with the greatest real deficit
statusReason: expected [ { …(4) } ] to deeply equal [ { …(4) } ]

[Killed] LogicalOperator
src/vtt/survival-policy.ts:236:9
         averageHealing: selected.averageHealing,
       }))
       .sort((left, right) =>
-        (right.hitPointMaximum - right.currentHitPoints) - (left.hitPointMaximum - left.currentHitPoints) ||
-        left.combatantId.localeCompare(right.combatantId))[0];
+        right.hitPointMaximum - right.currentHitPoints - (left.hitPointMaximum - left.currentHitPoints) && left.combatantId.localeCompare(right.combatantId))[0];
     if (target === undefined) break;
     current = {
killedBy: D382 survival package breaks equal slot and target deficits by combatant identity
statusReason: expected { …(4) } to deeply equal { …(4) }

[Killed] EqualityOperator
src/vtt/survival-policy.ts:242:13
     current = {
       ...current,
       characters: current.characters.map((character) => {
-        if (character.combatantId === selected.caster.combatantId) {
+        if (character.combatantId !== selected.caster.combatantId) {
           return {
             ...character,
killedBy: D382 survival package between-fight Cure Wounds spends the cheapest sufficient slot and preserves Bless plus Spirit Guardians reserves
statusReason: expected [ …(3) ] to deeply equal [ …(3) ]

[Killed] BlockStatement
src/vtt/survival-policy.ts:242:68
     current = {
       ...current,
       characters: current.characters.map((character) => {
-        if (character.combatantId === selected.caster.combatantId) {
-          return {
-            ...character,
-            spellSlots: character.spellSlots.map((slot) =>
-              slot.pool === selected.slot.pool && slot.level === selected.slot.level
-                ? { ...slot, remaining: slot.remaining - 1 }
-                : slot),
-            ...(character.combatantId === target.combatantId
-              ? { currentHitPoints: character.currentHitPoints + selected.averageHealing }
-              : {}),
-          };
-        }
+        if (character.combatantId === selected.caster.combatantId) {}
         return character.combatantId === target.combatantId
           ? { ...character, currentHitPoints: character.currentHitPoints + selected.averageHealing }
killedBy: D382 survival package selects a positive shared slot, then decrements only its exact pool and level
statusReason: expected { characterId: 1, …(13) } to match object { currentHitPoints: 38, …(1) }
(14 matching properties omitted from actual)

[Killed] EqualityOperator
src/vtt/survival-policy.ts:246:15
           return {
             ...character,
             spellSlots: character.spellSlots.map((slot) =>
-              slot.pool === selected.slot.pool && slot.level === selected.slot.level
+              slot.pool !== selected.slot.pool && slot.level === selected.slot.level
                 ? { ...slot, remaining: slot.remaining - 1 }
                 : slot),
killedBy: D382 survival package selects a positive shared slot, then decrements only its exact pool and level
statusReason: expected { characterId: 1, …(13) } to match object { currentHitPoints: 38, …(1) }
(16 matching properties omitted from actual)

[Killed] ConditionalExpression
src/vtt/survival-policy.ts:246:15
           return {
             ...character,
             spellSlots: character.spellSlots.map((slot) =>
-              slot.pool === selected.slot.pool && slot.level === selected.slot.level
+              true
                 ? { ...slot, remaining: slot.remaining - 1 }
                 : slot),
killedBy: D382 survival package selects a positive shared slot, then decrements only its exact pool and level
statusReason: expected { characterId: 1, …(13) } to match object { currentHitPoints: 38, …(1) }
(20 matching properties omitted from actual)

[Killed] ArithmeticOperator
src/vtt/survival-policy.ts:247:41
             ...character,
             spellSlots: character.spellSlots.map((slot) =>
               slot.pool === selected.slot.pool && slot.level === selected.slot.level
-                ? { ...slot, remaining: slot.remaining - 1 }
+                ? { ...slot, remaining: slot.remaining + 1 }
                 : slot),
             ...(character.combatantId === target.combatantId
killedBy: D382 survival package selects a positive shared slot, then decrements only its exact pool and level
statusReason: expected { characterId: 1, …(13) } to match object { currentHitPoints: 38, …(1) }
(14 matching properties omitted from actual)

[Killed] ConditionalExpression
src/vtt/survival-policy.ts:249:17
               slot.pool === selected.slot.pool && slot.level === selected.slot.level
                 ? { ...slot, remaining: slot.remaining - 1 }
                 : slot),
-            ...(character.combatantId === target.combatantId
+            ...(true
               ? { currentHitPoints: character.currentHitPoints + selected.averageHealing }
               : {}),
killedBy: D382 survival package between-fight Cure Wounds spends the cheapest sufficient slot and preserves Bless plus Spirit Guardians reserves
statusReason: Average-healing thrift requires a nonnegative deficit and positive healing.

[Killed] EqualityOperator
src/vtt/survival-policy.ts:249:17
               slot.pool === selected.slot.pool && slot.level === selected.slot.level
                 ? { ...slot, remaining: slot.remaining - 1 }
                 : slot),
-            ...(character.combatantId === target.combatantId
+            ...(character.combatantId !== target.combatantId
               ? { currentHitPoints: character.currentHitPoints + selected.averageHealing }
               : {}),
killedBy: D382 survival package between-fight Cure Wounds spends the cheapest sufficient slot and preserves Bless plus Spirit Guardians reserves
statusReason: Average-healing thrift requires a nonnegative deficit and positive healing.

[Killed] ArithmeticOperator
src/vtt/survival-policy.ts:250:37
                 ? { ...slot, remaining: slot.remaining - 1 }
                 : slot),
             ...(character.combatantId === target.combatantId
-              ? { currentHitPoints: character.currentHitPoints + selected.averageHealing }
+              ? { currentHitPoints: character.currentHitPoints - selected.averageHealing }
               : {}),
           };
killedBy: D382 survival package selects a positive shared slot, then decrements only its exact pool and level
statusReason: expected [ { …(4) }, { …(4) }, { …(4) } ] to deeply equal [ { …(4) } ]

[Killed] ConditionalExpression
src/vtt/survival-policy.ts:254:16
               : {}),
           };
         }
-        return character.combatantId === target.combatantId
+        return true
           ? { ...character, currentHitPoints: character.currentHitPoints + selected.averageHealing }
           : character;
killedBy: D382 survival package between-fight Cure Wounds spends the cheapest sufficient slot and preserves Bless plus Spirit Guardians reserves
statusReason: Average-healing thrift requires a nonnegative deficit and positive healing.

[Killed] EqualityOperator
src/vtt/survival-policy.ts:254:16
               : {}),
           };
         }
-        return character.combatantId === target.combatantId
+        return character.combatantId !== target.combatantId
           ? { ...character, currentHitPoints: character.currentHitPoints + selected.averageHealing }
           : character;
killedBy: D382 survival package between-fight Cure Wounds spends the cheapest sufficient slot and preserves Bless plus Spirit Guardians reserves
statusReason: Average-healing thrift requires a nonnegative deficit and positive healing.

[Killed] ArithmeticOperator
src/vtt/survival-policy.ts:255:47
           };
         }
         return character.combatantId === target.combatantId
-          ? { ...character, currentHitPoints: character.currentHitPoints + selected.averageHealing }
+          ? { ...character, currentHitPoints: character.currentHitPoints - selected.averageHealing }
           : character;
       }),
killedBy: D382 survival package between-fight Cure Wounds spends the cheapest sufficient slot and preserves Bless plus Spirit Guardians reserves
statusReason: expected -106 to be 43 // Object.is equality
