[Survived] ObjectLiteral
src/vtt/vane-warren.ts:188:65
   { column: 2, row: 5 },
 ] as const;
 
-const TPK_ENEMY_POSITIONS: Readonly<Record<string, GridCell>> = {
-  ashmaw: { column: 4, row: 3 },
-  'cinder-guard-b': { column: 4, row: 4 },
-  'cinder-wave-1-a': { column: 4, row: 5 },
-  'cinder-wave-2-a': { column: 4, row: 6 },
-  'doomed-crocodile': { column: 3, row: 4 },
-  'doomed-crocodile-second': { column: 3, row: 5 },
-  'doomed-crocodile-third': { column: 3, row: 1 },
-  'doomed-crocodile-fourth': { column: 3, row: 2 },
-  'doomed-crocodile-fifth': { column: 3, row: 6 },
-  'doomed-crocodile-sixth': { column: 3, row: 7 },
-};
+const TPK_ENEMY_POSITIONS: Readonly<Record<string, GridCell>> = {};
 
 /** Rehearsal-only composition variants. Every combatant uses an existing statblock unchanged. */

[Killed] ArithmeticOperator
src/vtt/vane-warren.ts:233:25
 }
 
 export function vaneWarrenActionEconomy(fight: VaneWarrenFight): VaneWarrenActionEconomy {
-  const listedEnemies = fight.standing.length +
-    fight.alarmWaves.reduce((count, wave) => count + wave.adds.length, 0) +
+  const listedEnemies = fight.standing.length - fight.alarmWaves.reduce((count, wave) => count + wave.adds.length, 0) +
     fight.conditionalJoiners.length;
   const enemyOpportunities = listedEnemies + fight.legendaryActionPool;
killedBy: D377.5 The Vane Warren flagship bundle ratio_drift: detune_ratio_stale: derives every detuned ratio from its live roster instead of a copied expectation
statusReason: expected [ { id: 'cinder-rite', …(4) }, …(2) ] to deeply equal [ { id: 'cinder-rite', …(4) }, …(2) ]

[Killed] ArithmeticOperator
src/vtt/vane-warren.ts:233:25
 }
 
 export function vaneWarrenActionEconomy(fight: VaneWarrenFight): VaneWarrenActionEconomy {
-  const listedEnemies = fight.standing.length +
-    fight.alarmWaves.reduce((count, wave) => count + wave.adds.length, 0) +
-    fight.conditionalJoiners.length;
+  const listedEnemies = fight.standing.length + fight.alarmWaves.reduce((count, wave) => count + wave.adds.length, 0) - fight.conditionalJoiners.length;
   const enemyOpportunities = listedEnemies + fight.legendaryActionPool;
   return {
killedBy: D377.5 The Vane Warren flagship bundle ratio_drift: detune_ratio_stale: derives every detuned ratio from its live roster instead of a copied expectation
statusReason: expected [ { id: 'cinder-rite', …(4) }, …(2) ] to deeply equal [ { id: 'cinder-rite', …(4) }, …(2) ]

[Killed] ArithmeticOperator
src/vtt/vane-warren.ts:234:46
 
 export function vaneWarrenActionEconomy(fight: VaneWarrenFight): VaneWarrenActionEconomy {
   const listedEnemies = fight.standing.length +
-    fight.alarmWaves.reduce((count, wave) => count + wave.adds.length, 0) +
+    fight.alarmWaves.reduce((count, wave) => count - wave.adds.length, 0) +
     fight.conditionalJoiners.length;
   const enemyOpportunities = listedEnemies + fight.legendaryActionPool;
killedBy: D377.5 The Vane Warren flagship bundle ratio_drift: detune_ratio_stale: derives every detuned ratio from its live roster instead of a copied expectation
statusReason: expected [ { id: 'cinder-rite', …(4) }, …(2) ] to deeply equal [ { id: 'cinder-rite', …(4) }, …(2) ]

[Killed] ArithmeticOperator
src/vtt/vane-warren.ts:236:30
   const listedEnemies = fight.standing.length +
     fight.alarmWaves.reduce((count, wave) => count + wave.adds.length, 0) +
     fight.conditionalJoiners.length;
-  const enemyOpportunities = listedEnemies + fight.legendaryActionPool;
+  const enemyOpportunities = listedEnemies - fight.legendaryActionPool;
   return {
     enemyOpportunities,
killedBy: D377.5 The Vane Warren flagship bundle ratio_drift: detune_ratio_stale: derives every detuned ratio from its live roster instead of a copied expectation
statusReason: expected [ { id: 'cinder-rite', …(4) }, …(2) ] to deeply equal [ { id: 'cinder-rite', …(4) }, …(2) ]

[Killed] ArithmeticOperator
src/vtt/vane-warren.ts:240:12
   return {
     enemyOpportunities,
     partyOpportunities: 5,
-    ratio: enemyOpportunities / 5,
+    ratio: enemyOpportunities * 5,
   };
 }
killedBy: D377.5 The Vane Warren flagship bundle ratio_drift: detune_ratio_stale: derives every detuned ratio from its live roster instead of a copied expectation
statusReason: expected [ { id: 'cinder-rite', …(4) }, …(2) ] to deeply equal [ { id: 'cinder-rite', …(4) }, …(2) ]

[Survived] ConditionalExpression
src/vtt/vane-warren.ts:259:22
   name: string,
   position: GridCell,
 ): VaneWarrenWorldObject {
-  const durability = objectClass === 'brazier'
+  const durability = true
     ? { kind: 'indestructible' as const }
     : { kind: 'hit_points' as const, hitPoints: objectClass === 'war_drum' ? 12 : 8, maximumHitPoints: objectClass === 'war_drum' ? 12 : 8 };

[Survived] ConditionalExpression
src/vtt/vane-warren.ts:259:22
   name: string,
   position: GridCell,
 ): VaneWarrenWorldObject {
-  const durability = objectClass === 'brazier'
+  const durability = false
     ? { kind: 'indestructible' as const }
     : { kind: 'hit_points' as const, hitPoints: objectClass === 'war_drum' ? 12 : 8, maximumHitPoints: objectClass === 'war_drum' ? 12 : 8 };

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:261:104
 ): VaneWarrenWorldObject {
   const durability = objectClass === 'brazier'
     ? { kind: 'indestructible' as const }
-    : { kind: 'hit_points' as const, hitPoints: objectClass === 'war_drum' ? 12 : 8, maximumHitPoints: objectClass === 'war_drum' ? 12 : 8 };
+    : { kind: 'hit_points' as const, hitPoints: objectClass === 'war_drum' ? 12 : 8, maximumHitPoints: false ? 12 : 8 };
   const cover = objectClass === 'war_drum' ? 'three_quarters' as const : 'half' as const;
   return {
killedBy: D382 survival package pins the fixed 30-seed final-encounter survival fraction at or above two thirds
statusReason: World object Hit Points must be positive safe integers within the maximum.

[Killed] EqualityOperator
src/vtt/vane-warren.ts:261:49
 ): VaneWarrenWorldObject {
   const durability = objectClass === 'brazier'
     ? { kind: 'indestructible' as const }
-    : { kind: 'hit_points' as const, hitPoints: objectClass === 'war_drum' ? 12 : 8, maximumHitPoints: objectClass === 'war_drum' ? 12 : 8 };
+    : { kind: 'hit_points' as const, hitPoints: objectClass !== 'war_drum' ? 12 : 8, maximumHitPoints: objectClass === 'war_drum' ? 12 : 8 };
   const cover = objectClass === 'war_drum' ? 'three_quarters' as const : 'half' as const;
   return {
killedBy: D382 survival package pins the fixed 30-seed final-encounter survival fraction at or above two thirds
statusReason: World object Hit Points must be positive safe integers within the maximum.

[Killed] EqualityOperator
src/vtt/vane-warren.ts:262:17
   const durability = objectClass === 'brazier'
     ? { kind: 'indestructible' as const }
     : { kind: 'hit_points' as const, hitPoints: objectClass === 'war_drum' ? 12 : 8, maximumHitPoints: objectClass === 'war_drum' ? 12 : 8 };
-  const cover = objectClass === 'war_drum' ? 'three_quarters' as const : 'half' as const;
+  const cover = objectClass !== 'war_drum' ? 'three_quarters' as const : 'half' as const;
   return {
     class: objectClass,
killedBy: D377.5 The Vane Warren flagship bundle all three Vane Warren fights expose anchored brazier and cask cover, with Cinder Rite adding its war drum
statusReason: expected [ { …(4) }, …(2) ] to deep equally contain { name: 'Coal-Red Brazier', …(3) }

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:262:17
   const durability = objectClass === 'brazier'
     ? { kind: 'indestructible' as const }
     : { kind: 'hit_points' as const, hitPoints: objectClass === 'war_drum' ? 12 : 8, maximumHitPoints: objectClass === 'war_drum' ? 12 : 8 };
-  const cover = objectClass === 'war_drum' ? 'three_quarters' as const : 'half' as const;
+  const cover = true ? 'three_quarters' as const : 'half' as const;
   return {
     class: objectClass,
killedBy: D377.5 The Vane Warren flagship bundle all three Vane Warren fights expose anchored brazier and cask cover, with Cinder Rite adding its war drum
statusReason: expected [ { …(4) }, …(2) ] to deep equally contain { name: 'Coal-Red Brazier', …(3) }

[Survived] ConditionalExpression
src/vtt/vane-warren.ts:268:58
     object: {
       id: worldObjectId(`world-object:vane-warren:${fightId}:${objectClass}`),
       name,
-      kind: objectClass === 'brazier' ? 'light-source' : objectClass === 'oil_cask' ? 'hazard' : 'generic',
+      kind: objectClass === 'brazier' ? 'light-source' : false ? 'hazard' : 'generic',
       position,
       footprint: [position],

[Survived] ConditionalExpression
src/vtt/vane-warren.ts:268:13
     object: {
       id: worldObjectId(`world-object:vane-warren:${fightId}:${objectClass}`),
       name,
-      kind: objectClass === 'brazier' ? 'light-source' : objectClass === 'oil_cask' ? 'hazard' : 'generic',
+      kind: false ? 'light-source' : objectClass === 'oil_cask' ? 'hazard' : 'generic',
       position,
       footprint: [position],

[Survived] ConditionalExpression
src/vtt/vane-warren.ts:272:30
       position,
       footprint: [position],
       durability,
-      armorClass: armorClass(objectClass === 'oil_cask' ? 10 : 12),
+      armorClass: armorClass(true ? 10 : 12),
       damageResponses: [],
       blocking: { movement: false, lineOfSight: false, cover },

[Survived] EqualityOperator
src/vtt/vane-warren.ts:272:30
       position,
       footprint: [position],
       durability,
-      armorClass: armorClass(objectClass === 'oil_cask' ? 10 : 12),
+      armorClass: armorClass(objectClass !== 'oil_cask' ? 10 : 12),
       damageResponses: [],
       blocking: { movement: false, lineOfSight: false, cover },

[Killed] BooleanLiteral
src/vtt/vane-warren.ts:274:29
       durability,
       armorClass: armorClass(objectClass === 'oil_cask' ? 10 : 12),
       damageResponses: [],
-      blocking: { movement: false, lineOfSight: false, cover },
+      blocking: { movement: true, lineOfSight: false, cover },
       ...(objectClass === 'war_drum'
         ? {
killedBy: D382 survival package pins the fixed 30-seed final-encounter survival fraction at or above two thirds
statusReason: Vane Warren — The Cinder Rite: Illegal movement: blocked_step at step 0.

[Survived] BooleanLiteral
src/vtt/vane-warren.ts:274:49
       durability,
       armorClass: armorClass(objectClass === 'oil_cask' ? 10 : 12),
       damageResponses: [],
-      blocking: { movement: false, lineOfSight: false, cover },
+      blocking: { movement: false, lineOfSight: true, cover },
       ...(objectClass === 'war_drum'
         ? {

[Killed] EqualityOperator
src/vtt/vane-warren.ts:275:11
       armorClass: armorClass(objectClass === 'oil_cask' ? 10 : 12),
       damageResponses: [],
       blocking: { movement: false, lineOfSight: false, cover },
-      ...(objectClass === 'war_drum'
+      ...(objectClass !== 'war_drum'
         ? {
             classActions: [{
killedBy: D377.5 The Vane Warren flagship bundle drum_from_anywhere: exposes the typed alarm action only to adjacent enemies and gives the designated drummer highest algorithm priority
statusReason: The adjacent drummer has no alarm action.

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:275:11
       armorClass: armorClass(objectClass === 'oil_cask' ? 10 : 12),
       damageResponses: [],
       blocking: { movement: false, lineOfSight: false, cover },
-      ...(objectClass === 'war_drum'
+      ...(false
         ? {
             classActions: [{
killedBy: DmEncounterHost live algorithm path replays the same configured pure reducer used by live host commands
statusReason: The Vane Warren war drum control is missing.

[Killed] ArrayDeclaration
src/vtt/vane-warren.ts:310:19
 
 function environment(fightId: VaneWarrenFightId, leader: CombatantId): EncounterEnvironment {
   return {
-    lightRegions: [{
-      id: `${fightId}:brazier-light`,
-      level: 'dim',
-      cells: [{ column: 7, row: 3 }, { column: 7, row: 4 }, { column: 8, row: 3 }, { column: 8, row: 4 }],
-    }],
+    lightRegions: [],
     difficultTerrainRegions: [{
       id: `${fightId}:rubble`,
killedBy: D377.5 The Vane Warren flagship bundle loads each separate fight with pre-placed tokens, fog, light, surfaces, and at least six landed terrain or hazard elements
statusReason: expected 0 to be greater than 0

[Killed] ArrayDeclaration
src/vtt/vane-warren.ts:315:30
       level: 'dim',
       cells: [{ column: 7, row: 3 }, { column: 7, row: 4 }, { column: 8, row: 3 }, { column: 8, row: 4 }],
     }],
-    difficultTerrainRegions: [{
-      id: `${fightId}:rubble`,
-      cells: [{ column: 5, row: 2 }, { column: 5, row: 3 }, { column: 5, row: 4 }],
-    }],
+    difficultTerrainRegions: [],
     obscurementRegions: [{
       id: `${fightId}:smoke`,
killedBy: D377.5 The Vane Warren flagship bundle loads each separate fight with pre-placed tokens, fog, light, surfaces, and at least six landed terrain or hazard elements
statusReason: expected 0 to be greater than 0

[Killed] StringLiteral
src/vtt/vane-warren.ts:320:11
       cells: [{ column: 5, row: 2 }, { column: 5, row: 3 }, { column: 5, row: 4 }],
     }],
     obscurementRegions: [{
-      id: `${fightId}:smoke`,
+      id: ``,
       obscurement: 'light',
       cells: [{ column: 6, row: 6 }, { column: 6, row: 7 }, { column: 7, row: 6 }, { column: 7, row: 7 }],
killedBy: D377.5 The Vane Warren flagship bundle tpk_rehearsal_configs: keeps the default fight unchanged and stacks both doomed variants from existing roster content
statusReason: Environment region requires a non-empty id and at least one cell.

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:340:7
 }
 
 function areaHooks(material: PersistentAreaMaterial): PersistentArea['hooks'] {
-  if (material.id === 'webs') {
+  if (false) {
     return (['on_enter', 'on_start_of_turn_inside'] as const).map((hook) => ({
       hook,
killedBy: D382 survival package pins the fixed 30-seed final-encounter survival fraction at or above two thirds
statusReason: expected { successes: 30, total: 30 } to deeply equal { successes: 29, total: 30 }

[Killed] BlockStatement
src/vtt/vane-warren.ts:340:31
 }
 
 function areaHooks(material: PersistentAreaMaterial): PersistentArea['hooks'] {
-  if (material.id === 'webs') {
-    return (['on_enter', 'on_start_of_turn_inside'] as const).map((hook) => ({
-      hook,
-      frequency: 'once_per_turn' as const,
-      effect: {
-        kind: 'save_gated' as const,
-        ability: 'dexterity' as const,
-        dc: 13,
-        rollMode: 'normal' as const,
-        onSuccess: 'none' as const,
-        payload: {
-          kind: 'effect' as const,
-          payload: { kind: 'condition' as const, condition: 'Restrained' as const },
-          lifetime: { kind: 'while_inside' as const },
-        },
-      },
-    }));
-  }
+  if (material.id === 'webs') {}
   return (['on_enter', 'on_end_of_turn_inside'] as const).map((hook) => ({
     hook,
killedBy: D382 survival package pins the fixed 30-seed final-encounter survival fraction at or above two thirds
statusReason: expected { successes: 30, total: 30 } to deeply equal { successes: 29, total: 30 }

[Killed] ArithmeticOperator
src/vtt/vane-warren.ts:386:65
     id: persistentAreaId(`area:${String(sequence)}`),
     sequence,
     owner,
-    origin: { kind: 'fixed', point: feetPoint(point.column * 5, point.row * 5) },
+    origin: { kind: 'fixed', point: feetPoint(point.column * 5, point.row / 5) },
     shape: { kind: 'cube', size: feet(material.id === 'webs' ? 20 : 10) },
     duration: { kind: 'rounds', remaining: material.id === 'webs' ? 600 : 10 },
killedBy: D382 survival package pins the fixed 30-seed final-encounter survival fraction at or above two thirds
statusReason: Cube center must snap to a 5-foot grid intersection.

[Killed] ArithmeticOperator
src/vtt/vane-warren.ts:386:47
     id: persistentAreaId(`area:${String(sequence)}`),
     sequence,
     owner,
-    origin: { kind: 'fixed', point: feetPoint(point.column * 5, point.row * 5) },
+    origin: { kind: 'fixed', point: feetPoint(point.column / 5, point.row * 5) },
     shape: { kind: 'cube', size: feet(material.id === 'webs' ? 20 : 10) },
     duration: { kind: 'rounds', remaining: material.id === 'webs' ? 600 : 10 },
killedBy: D382 survival package pins the fixed 30-seed final-encounter survival fraction at or above two thirds
statusReason: Feet must be a finite, non-negative number.

[Killed] EqualityOperator
src/vtt/vane-warren.ts:387:39
     sequence,
     owner,
     origin: { kind: 'fixed', point: feetPoint(point.column * 5, point.row * 5) },
-    shape: { kind: 'cube', size: feet(material.id === 'webs' ? 20 : 10) },
+    shape: { kind: 'cube', size: feet(material.id !== 'webs' ? 20 : 10) },
     duration: { kind: 'rounds', remaining: material.id === 'webs' ? 600 : 10 },
     targetFilter: { kind: 'all' },
killedBy: D382 survival package pins the fixed 30-seed final-encounter survival fraction at or above two thirds
statusReason: expected { successes: 30, total: 30 } to deeply equal { successes: 29, total: 30 }

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:387:39
     sequence,
     owner,
     origin: { kind: 'fixed', point: feetPoint(point.column * 5, point.row * 5) },
-    shape: { kind: 'cube', size: feet(material.id === 'webs' ? 20 : 10) },
+    shape: { kind: 'cube', size: feet(false ? 20 : 10) },
     duration: { kind: 'rounds', remaining: material.id === 'webs' ? 600 : 10 },
     targetFilter: { kind: 'all' },
killedBy: D382 survival package pins the fixed 30-seed final-encounter survival fraction at or above two thirds
statusReason: expected { successes: 30, total: 30 } to deeply equal { successes: 29, total: 30 }

[Survived] EqualityOperator
src/vtt/vane-warren.ts:388:44
     owner,
     origin: { kind: 'fixed', point: feetPoint(point.column * 5, point.row * 5) },
     shape: { kind: 'cube', size: feet(material.id === 'webs' ? 20 : 10) },
-    duration: { kind: 'rounds', remaining: material.id === 'webs' ? 600 : 10 },
+    duration: { kind: 'rounds', remaining: material.id !== 'webs' ? 600 : 10 },
     targetFilter: { kind: 'all' },
     difficultTerrain: true,

[Survived] ConditionalExpression
src/vtt/vane-warren.ts:388:44
     owner,
     origin: { kind: 'fixed', point: feetPoint(point.column * 5, point.row * 5) },
     shape: { kind: 'cube', size: feet(material.id === 'webs' ? 20 : 10) },
-    duration: { kind: 'rounds', remaining: material.id === 'webs' ? 600 : 10 },
+    duration: { kind: 'rounds', remaining: false ? 600 : 10 },
     targetFilter: { kind: 'all' },
     difficultTerrain: true,

[Killed] BooleanLiteral
src/vtt/vane-warren.ts:390:23
     shape: { kind: 'cube', size: feet(material.id === 'webs' ? 20 : 10) },
     duration: { kind: 'rounds', remaining: material.id === 'webs' ? 600 : 10 },
     targetFilter: { kind: 'all' },
-    difficultTerrain: true,
+    difficultTerrain: false,
     material,
     hooks: areaHooks(material),
killedBy: D382 survival package pins the fixed 30-seed final-encounter survival fraction at or above two thirds
statusReason: expected { successes: 30, total: 30 } to deeply equal { successes: 29, total: 30 }

[Killed] ArrowFunction
src/vtt/vane-warren.ts:451:41
 }
 
 function fightById(id: VaneWarrenFightId): VaneWarrenFight {
-  const fight = VANE_WARREN_FIGHTS.find((candidate) => candidate.id === id);
+  const fight = VANE_WARREN_FIGHTS.find(() => undefined);
   if (fight === undefined) throw new Error(`Unknown Vane Warren fight ${id}.`);
   return fight;
killedBy: D382 survival package pins the fixed 30-seed final-encounter survival fraction at or above two thirds
statusReason: Unknown Vane Warren fight cinder-rite.

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:451:56
 }
 
 function fightById(id: VaneWarrenFightId): VaneWarrenFight {
-  const fight = VANE_WARREN_FIGHTS.find((candidate) => candidate.id === id);
+  const fight = VANE_WARREN_FIGHTS.find((candidate) => true);
   if (fight === undefined) throw new Error(`Unknown Vane Warren fight ${id}.`);
   return fight;
killedBy: Vane Warren loader, chaining, seats, and end-session export bounds_mismatch_reintroduced: reaches DM controls for all three authored fights with their matching art package
statusReason: expected 'encounter:vane-warren: The Cinder Rit…' to contain 'The Iron Voice'

[Killed] StringLiteral
src/vtt/vane-warren.ts:452:44
 
 function fightById(id: VaneWarrenFightId): VaneWarrenFight {
   const fight = VANE_WARREN_FIGHTS.find((candidate) => candidate.id === id);
-  if (fight === undefined) throw new Error(`Unknown Vane Warren fight ${id}.`);
+  if (fight === undefined) throw new Error(``);
   return fight;
 }
killedBy: D377.5 The Vane Warren flagship bundle covers the fight-construction refusal contract and exact scenario boundary
statusReason: expected [Function] to throw error including 'Unknown Vane Warren fight missing.' but got ''

[Killed] ArrayDeclaration
src/vtt/vane-warren.ts:458:10
 
 function playerPositions(scenario: VaneWarrenRehearsalScenario): readonly GridCell[] {
   if (scenario !== 'default') return VANE_WARREN_TPK_SCENARIOS[scenario].playerPositions;
-  return [
-    { column: 1, row: 2 },
-    { column: 1, row: 4 },
-    { column: 1, row: 6 },
-    { column: 1, row: 8 },
-    { column: 2, row: 5 },
-  ];
+  return [];
 }
 
killedBy: D382 survival package pins the fixed 30-seed final-encounter survival fraction at or above two thirds
statusReason: Cannot read properties of undefined (reading 'column')

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:472:7
   players: readonly CombatantProfile[],
   scenario: VaneWarrenRehearsalScenario = 'default',
 ): VaneWarrenEncounterState {
-  if (players.length !== 5 || players.some((profile) => profile.kind !== 'player_character')) {
+  if (false) {
     throw new RangeError('The Vane Warren is bundled for exactly five player characters.');
   }
killedBy: D377.5 The Vane Warren flagship bundle covers the fight-construction refusal contract and exact scenario boundary
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:472:7
   players: readonly CombatantProfile[],
   scenario: VaneWarrenRehearsalScenario = 'default',
 ): VaneWarrenEncounterState {
-  if (players.length !== 5 || players.some((profile) => profile.kind !== 'player_character')) {
+  if (false || players.some((profile) => profile.kind !== 'player_character')) {
     throw new RangeError('The Vane Warren is bundled for exactly five player characters.');
   }
killedBy: D377.5 The Vane Warren flagship bundle covers the fight-construction refusal contract and exact scenario boundary
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/vtt/vane-warren.ts:473:26
   scenario: VaneWarrenRehearsalScenario = 'default',
 ): VaneWarrenEncounterState {
   if (players.length !== 5 || players.some((profile) => profile.kind !== 'player_character')) {
-    throw new RangeError('The Vane Warren is bundled for exactly five player characters.');
+    throw new RangeError("");
   }
   const fight = fightById(fightId);
killedBy: D377.5 The Vane Warren flagship bundle covers the fight-construction refusal contract and exact scenario boundary
statusReason: expected [Function] to throw error including 'exactly five player characters' but got ''

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:476:7
     throw new RangeError('The Vane Warren is bundled for exactly five player characters.');
   }
   const fight = fightById(fightId);
-  if (scenario !== 'default' && fightId !== 'cinder-rite') {
+  if (true && fightId !== 'cinder-rite') {
     throw new Error(`${scenario} is configured only for The Cinder Rite.`);
   }
killedBy: D382 survival package pins the fixed 30-seed final-encounter survival fraction at or above two thirds
statusReason: default is configured only for The Cinder Rite.

[Killed] EqualityOperator
src/vtt/vane-warren.ts:476:33
     throw new RangeError('The Vane Warren is bundled for exactly five player characters.');
   }
   const fight = fightById(fightId);
-  if (scenario !== 'default' && fightId !== 'cinder-rite') {
+  if (scenario !== 'default' && fightId === 'cinder-rite') {
     throw new Error(`${scenario} is configured only for The Cinder Rite.`);
   }
killedBy: player-character AlgorithmController policy vane-tpk-clean-terminates: the doomed composition defeats the party after death saves
statusReason: tpk-clean is configured only for The Cinder Rite.

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:485:59
     ...(scenarioConfig?.startingReinforcements ?? []),
   ];
   const standingProfiles = startingRoster.map((entry) => profileFor(fightId, entry));
-  const leaderIndex = fight.standing.findIndex((entry) => entry.id === fight.leaderRosterId);
+  const leaderIndex = fight.standing.findIndex((entry) => false);
   const leader = standingProfiles[leaderIndex];
   if (leader === undefined) throw new Error(`${fight.name} has no leader profile.`);
killedBy: D382 survival package pins the fixed 30-seed final-encounter survival fraction at or above two thirds
statusReason: The Cinder Rite has no leader profile.

[Killed] EqualityOperator
src/vtt/vane-warren.ts:485:59
     ...(scenarioConfig?.startingReinforcements ?? []),
   ];
   const standingProfiles = startingRoster.map((entry) => profileFor(fightId, entry));
-  const leaderIndex = fight.standing.findIndex((entry) => entry.id === fight.leaderRosterId);
+  const leaderIndex = fight.standing.findIndex((entry) => entry.id !== fight.leaderRosterId);
   const leader = standingProfiles[leaderIndex];
   if (leader === undefined) throw new Error(`${fight.name} has no leader profile.`);
killedBy: D382 survival package pins the fixed 30-seed final-encounter survival fraction at or above two thirds
statusReason: The Iron Voice has no leader profile.

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:489:9
   const leader = standingProfiles[leaderIndex];
   if (leader === undefined) throw new Error(`${fight.name} has no leader profile.`);
   const objects = [
-    ...(fight.alarmWaves.length === 0
+    ...(true
       ? []
       : [encounterObject(fightId, 'war_drum', 'Vane Warren War Drum', { column: 11, row: 5 })]),
killedBy: DmEncounterHost live algorithm path replays the same configured pure reducer used by live host commands
statusReason: The Cinder Rite has no war drum.

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:489:9
   const leader = standingProfiles[leaderIndex];
   if (leader === undefined) throw new Error(`${fight.name} has no leader profile.`);
   const objects = [
-    ...(fight.alarmWaves.length === 0
+    ...(false
       ? []
       : [encounterObject(fightId, 'war_drum', 'Vane Warren War Drum', { column: 11, row: 5 })]),
killedBy: D377.5 The Vane Warren flagship bundle all three Vane Warren fights expose anchored brazier and cask cover, with Cinder Rite adding its war drum
statusReason: expected [ { …(4) }, …(2) ] to have a length of 2 but got 3

[NoCoverage] ArithmeticOperator
src/vtt/vane-warren.ts:512:64
         id: profile.tokenId,
         combatantId: profile.id,
         position: scenarioConfig?.enemyPositions[startingRoster[index]?.id ?? ''] ??
-          startingRoster[index]?.position ?? { column: 9, row: index + 1 },
+          startingRoster[index]?.position ?? { column: 9, row: index - 1 },
       })),
     ],

[Killed] StringLiteral
src/vtt/vane-warren.ts:523:7
       { column: 11, row: 8 }, { column: 12, row: 8 }, { column: 13, row: 8 },
     ],
     dmNotes: [
-      `${VANE_WARREN_ID}: ${fight.name}.`,
+      ``,
       'Flat stronghold floor only: no elevation, falls, or chasms.',
       'Forced movement can drive creatures into the ember-bed movement hazard.',
killedBy: D377.5 The Vane Warren flagship bundle tpk_rehearsal_configs: keeps the default fight unchanged and stacks both doomed variants from existing roster content
statusReason: DM notes must be non-empty.

[Killed] StringLiteral
src/vtt/vane-warren.ts:525:7
     dmNotes: [
       `${VANE_WARREN_ID}: ${fight.name}.`,
       'Flat stronghold floor only: no elevation, falls, or chasms.',
-      'Forced movement can drive creatures into the ember-bed movement hazard.',
+      "",
       ...(scenarioConfig === null ? [] : [
         `${scenarioConfig.id}: the alarm was pre-sounded and both authored waves plus the doomed reinforcement composition begin on the board.`,
killedBy: D377.5 The Vane Warren flagship bundle tpk_rehearsal_configs: keeps the default fight unchanged and stacks both doomed variants from existing roster content
statusReason: DM notes must be non-empty.

[Survived] ArrayDeclaration
src/vtt/vane-warren.ts:526:37
       `${VANE_WARREN_ID}: ${fight.name}.`,
       'Flat stronghold floor only: no elevation, falls, or chasms.',
       'Forced movement can drive creatures into the ember-bed movement hazard.',
-      ...(scenarioConfig === null ? [] : [
+      ...(scenarioConfig === null ? ["Stryker was here"] : [
         `${scenarioConfig.id}: the alarm was pre-sounded and both authored waves plus the doomed reinforcement composition begin on the board.`,
       ]),

[Killed] StringLiteral
src/vtt/vane-warren.ts:527:9
       'Flat stronghold floor only: no elevation, falls, or chasms.',
       'Forced movement can drive creatures into the ember-bed movement hazard.',
       ...(scenarioConfig === null ? [] : [
-        `${scenarioConfig.id}: the alarm was pre-sounded and both authored waves plus the doomed reinforcement composition begin on the board.`,
+        ``,
       ]),
     ],
killedBy: player-character AlgorithmController policy vane-tpk-clean-terminates: the doomed composition defeats the party after death saves
statusReason: DM notes must be non-empty.
