[Killed] StringLiteral
src/vtt/vane-warren.ts:531:35
       ]),
     ],
   });
-  const alarmCaller = combatantId(`combatant:vane-warren:${fightId}:cinder-guard-b`);
+  const alarmCaller = combatantId(``);
   const alarmObjectId = worldObjectId(`world-object:vane-warren:${fightId}:war_drum`);
   const configuredEvents: readonly EncounterEvent[] = scenarioConfig === null
killedBy: D382 survival package pins the fixed 30-seed final-encounter survival fraction at or above two thirds
statusReason: CombatantId must be trimmed, non-empty, and at most 200 characters.

[Killed] StringLiteral
src/vtt/vane-warren.ts:532:39
     ],
   });
   const alarmCaller = combatantId(`combatant:vane-warren:${fightId}:cinder-guard-b`);
-  const alarmObjectId = worldObjectId(`world-object:vane-warren:${fightId}:war_drum`);
+  const alarmObjectId = worldObjectId(``);
   const configuredEvents: readonly EncounterEvent[] = scenarioConfig === null
     ? []
killedBy: D382 survival package pins the fixed 30-seed final-encounter survival fraction at or above two thirds
statusReason: WorldObjectId must be trimmed, non-empty, and at most 200 characters.

[Killed] EqualityOperator
src/vtt/vane-warren.ts:533:55
   });
   const alarmCaller = combatantId(`combatant:vane-warren:${fightId}:cinder-guard-b`);
   const alarmObjectId = worldObjectId(`world-object:vane-warren:${fightId}:war_drum`);
-  const configuredEvents: readonly EncounterEvent[] = scenarioConfig === null
+  const configuredEvents: readonly EncounterEvent[] = scenarioConfig !== null
     ? []
     : [
killedBy: D377.5 The Vane Warren flagship bundle tpk_rehearsal_configs: keeps the default fight unchanged and stacks both doomed variants from existing roster content
statusReason: expected [ { sequence: 1, …(6) }, …(2) ] to deeply equal []

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:533:55
   });
   const alarmCaller = combatantId(`combatant:vane-warren:${fightId}:cinder-guard-b`);
   const alarmObjectId = worldObjectId(`world-object:vane-warren:${fightId}:war_drum`);
-  const configuredEvents: readonly EncounterEvent[] = scenarioConfig === null
+  const configuredEvents: readonly EncounterEvent[] = true
     ? []
     : [
killedBy: D377.5 The Vane Warren flagship bundle tpk_rehearsal_configs: keeps the default fight unchanged and stacks both doomed variants from existing roster content
statusReason: expected [] to deeply equal [ 'world_object_used', …(2) ]

[Killed] ArrayDeclaration
src/vtt/vane-warren.ts:535:7
   const alarmObjectId = worldObjectId(`world-object:vane-warren:${fightId}:war_drum`);
   const configuredEvents: readonly EncounterEvent[] = scenarioConfig === null
     ? []
-    : [
-        {
-          sequence: 1,
-          type: 'world_object_used',
-          actor: alarmCaller,
-          objectId: alarmObjectId,
-          actionId: VANE_WARREN_SOUND_DRUM_ACTION_ID,
-          round: 1,
-          authority: 'dm_override',
-        },
-        ...fight.alarmWaves.map((wave, index): EncounterEvent => ({
-          sequence: index + 2,
-          type: 'reinforcement_wave_deployed',
-          objectId: alarmObjectId,
-          waveId: wave.id,
-          calledBy: alarmCaller,
-          combatants: wave.adds.map((entry) => combatantId(`combatant:vane-warren:${fightId}:${entry.id}`)),
-          round: 1,
-        })),
-      ];
+    : [];
   const withAreas: EncounterState = {
     ...encounter,
killedBy: D377.5 The Vane Warren flagship bundle tpk_rehearsal_configs: keeps the default fight unchanged and stacks both doomed variants from existing roster content
statusReason: expected [] to deeply equal [ 'world_object_used', …(2) ]

[Survived] ArithmeticOperator
src/vtt/vane-warren.ts:546:21
           authority: 'dm_override',
         },
         ...fight.alarmWaves.map((wave, index): EncounterEvent => ({
-          sequence: index + 2,
+          sequence: index - 2,
           type: 'reinforcement_wave_deployed',
           objectId: alarmObjectId,

[Survived] ArithmeticOperator
src/vtt/vane-warren.ts:558:24
   const withAreas: EncounterState = {
     ...encounter,
     eventLog: configuredEvents,
-    nextEventSequence: configuredEvents.length + 1,
+    nextEventSequence: configuredEvents.length - 1,
     persistentAreas: [grease, web],
     nextPersistentAreaSequence: 3,

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:578:12
     encounter: withAreas,
     objects,
     terrainFeatures,
-    alarm: scenarioConfig === null
+    alarm: false
       ? { kind: 'ready' }
       : {
killedBy: D377.5 The Vane Warren flagship bundle tpk_rehearsal_configs: keeps the default fight unchanged and stacks both doomed variants from existing roster content
statusReason: expected { kind: 'complete', …(3) } to deeply equal { kind: 'ready' }

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:578:12
     encounter: withAreas,
     objects,
     terrainFeatures,
-    alarm: scenarioConfig === null
+    alarm: true
       ? { kind: 'ready' }
       : {
killedBy: D377.5 The Vane Warren flagship bundle tpk_rehearsal_configs: keeps the default fight unchanged and stacks both doomed variants from existing roster content
statusReason: expected { kind: 'ready' } to deeply equal ObjectContaining{…}

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:592:50
 }
 
 function positionOf(state: EncounterState, actor: CombatantId): GridCell {
-  const token = state.tokens.find((candidate) => candidate.combatantId === actor);
+  const token = state.tokens.find((candidate) => false);
   if (token === undefined) throw new Error(`Combatant ${actor} has no Vane Warren token.`);
   return token.position;
killedBy: D377.5 The Vane Warren flagship bundle drum_double_trigger: taking the adjacent class action sounds the alarm once and cannot queue it again
statusReason: Combatant combatant:vane-warren:cinder-rite:cinder-guard-b has no Vane Warren token.

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:592:50
 }
 
 function positionOf(state: EncounterState, actor: CombatantId): GridCell {
-  const token = state.tokens.find((candidate) => candidate.combatantId === actor);
+  const token = state.tokens.find((candidate) => true);
   if (token === undefined) throw new Error(`Combatant ${actor} has no Vane Warren token.`);
   return token.position;
killedBy: D377.5 The Vane Warren flagship bundle drum_double_trigger: taking the adjacent class action sounds the alarm once and cannot queue it again
statusReason: The enemy must reach the war drum before using it.

[Killed] EqualityOperator
src/vtt/vane-warren.ts:598:10
 }
 
 function adjacent(left: GridCell, right: GridCell): boolean {
-  return Math.max(Math.abs(left.column - right.column), Math.abs(left.row - right.row)) <= 1;
+  return Math.max(Math.abs(left.column - right.column), Math.abs(left.row - right.row)) > 1;
 }
 
killedBy: D377.5 The Vane Warren flagship bundle drum_double_trigger: taking the adjacent class action sounds the alarm once and cannot queue it again
statusReason: The enemy must reach the war drum before using it.

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:598:10
 }
 
 function adjacent(left: GridCell, right: GridCell): boolean {
-  return Math.max(Math.abs(left.column - right.column), Math.abs(left.row - right.row)) <= 1;
+  return true;
 }
 
killedBy: D377.5 The Vane Warren flagship bundle enforces brazier ignition preconditions and does not duplicate a burning cell
statusReason: expected [Function] to throw error including 'A Vane Warren brazier can ignite only…' but got 'The adjacent cell has no enabled flam…'

[Killed] ArrowFunction
src/vtt/vane-warren.ts:602:36
 }
 
 function drum(state: VaneWarrenEncounterState): VaneWarrenWorldObject {
-  const found = state.objects.find((entry) => entry.class === 'war_drum');
+  const found = state.objects.find(() => undefined);
   if (found === undefined) throw new Error(`${state.fight.name} has no war drum.`);
   return found;
killedBy: D377.5 The Vane Warren flagship bundle drum_double_trigger: taking the adjacent class action sounds the alarm once and cannot queue it again
statusReason: The Cinder Rite has no war drum.

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:602:47
 }
 
 function drum(state: VaneWarrenEncounterState): VaneWarrenWorldObject {
-  const found = state.objects.find((entry) => entry.class === 'war_drum');
+  const found = state.objects.find((entry) => false);
   if (found === undefined) throw new Error(`${state.fight.name} has no war drum.`);
   return found;
killedBy: D377.5 The Vane Warren flagship bundle drum_double_trigger: taking the adjacent class action sounds the alarm once and cannot queue it again
statusReason: The Cinder Rite has no war drum.

[NoCoverage] StringLiteral
src/vtt/vane-warren.ts:603:44
 
 function drum(state: VaneWarrenEncounterState): VaneWarrenWorldObject {
   const found = state.objects.find((entry) => entry.class === 'war_drum');
-  if (found === undefined) throw new Error(`${state.fight.name} has no war drum.`);
+  if (found === undefined) throw new Error(``);
   return found;
 }

[Killed] EqualityOperator
src/vtt/vane-warren.ts:611:7
   state: VaneWarrenEncounterState,
   actor: CombatantId,
 ): VaneWarrenEncounterState {
-  if (state.alarm.kind !== 'ready') throw new Error('The Vane Warren war drum has already been used.');
+  if (state.alarm.kind === 'ready') throw new Error('The Vane Warren war drum has already been used.');
   const subject = state.encounter.combatants.find((candidate) => candidate.profile.id === actor);
   if (subject === undefined || subject.profile.kind !== 'monster') {
killedBy: D377.5 The Vane Warren flagship bundle drum_double_trigger: taking the adjacent class action sounds the alarm once and cannot queue it again
statusReason: The Vane Warren war drum has already been used.

[Survived] ConditionalExpression
src/vtt/vane-warren.ts:611:7
   state: VaneWarrenEncounterState,
   actor: CombatantId,
 ): VaneWarrenEncounterState {
-  if (state.alarm.kind !== 'ready') throw new Error('The Vane Warren war drum has already been used.');
+  if (false) throw new Error('The Vane Warren war drum has already been used.');
   const subject = state.encounter.combatants.find((candidate) => candidate.profile.id === actor);
   if (subject === undefined || subject.profile.kind !== 'monster') {

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:612:66
   actor: CombatantId,
 ): VaneWarrenEncounterState {
   if (state.alarm.kind !== 'ready') throw new Error('The Vane Warren war drum has already been used.');
-  const subject = state.encounter.combatants.find((candidate) => candidate.profile.id === actor);
+  const subject = state.encounter.combatants.find((candidate) => true);
   if (subject === undefined || subject.profile.kind !== 'monster') {
     throw new Error('Only an enemy in this fight can sound the Vane Warren war drum.');
killedBy: D377.5 The Vane Warren flagship bundle drum_double_trigger: taking the adjacent class action sounds the alarm once and cannot queue it again
statusReason: Only an enemy in this fight can sound the Vane Warren war drum.

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:612:66
   actor: CombatantId,
 ): VaneWarrenEncounterState {
   if (state.alarm.kind !== 'ready') throw new Error('The Vane Warren war drum has already been used.');
-  const subject = state.encounter.combatants.find((candidate) => candidate.profile.id === actor);
+  const subject = state.encounter.combatants.find((candidate) => false);
   if (subject === undefined || subject.profile.kind !== 'monster') {
     throw new Error('Only an enemy in this fight can sound the Vane Warren war drum.');
killedBy: D377.5 The Vane Warren flagship bundle drum_double_trigger: taking the adjacent class action sounds the alarm once and cannot queue it again
statusReason: Only an enemy in this fight can sound the Vane Warren war drum.

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:613:7
 ): VaneWarrenEncounterState {
   if (state.alarm.kind !== 'ready') throw new Error('The Vane Warren war drum has already been used.');
   const subject = state.encounter.combatants.find((candidate) => candidate.profile.id === actor);
-  if (subject === undefined || subject.profile.kind !== 'monster') {
+  if (true) {
     throw new Error('Only an enemy in this fight can sound the Vane Warren war drum.');
   }
killedBy: D377.5 The Vane Warren flagship bundle drum_double_trigger: taking the adjacent class action sounds the alarm once and cannot queue it again
statusReason: Only an enemy in this fight can sound the Vane Warren war drum.

[Killed] EqualityOperator
src/vtt/vane-warren.ts:613:32
 ): VaneWarrenEncounterState {
   if (state.alarm.kind !== 'ready') throw new Error('The Vane Warren war drum has already been used.');
   const subject = state.encounter.combatants.find((candidate) => candidate.profile.id === actor);
-  if (subject === undefined || subject.profile.kind !== 'monster') {
+  if (subject === undefined || subject.profile.kind === 'monster') {
     throw new Error('Only an enemy in this fight can sound the Vane Warren war drum.');
   }
killedBy: D377.5 The Vane Warren flagship bundle drum_double_trigger: taking the adjacent class action sounds the alarm once and cannot queue it again
statusReason: Only an enemy in this fight can sound the Vane Warren war drum.

[NoCoverage] StringLiteral
src/vtt/vane-warren.ts:614:21
   if (state.alarm.kind !== 'ready') throw new Error('The Vane Warren war drum has already been used.');
   const subject = state.encounter.combatants.find((candidate) => candidate.profile.id === actor);
   if (subject === undefined || subject.profile.kind !== 'monster') {
-    throw new Error('Only an enemy in this fight can sound the Vane Warren war drum.');
+    throw new Error("");
   }
   const alarmObject = drum(state);

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:617:7
     throw new Error('Only an enemy in this fight can sound the Vane Warren war drum.');
   }
   const alarmObject = drum(state);
-  if (!adjacent(positionOf(state.encounter, actor), alarmObject.object.position)) {
+  if (true) {
     throw new Error('The enemy must reach the war drum before using it.');
   }
killedBy: D377.5 The Vane Warren flagship bundle drum_double_trigger: taking the adjacent class action sounds the alarm once and cannot queue it again
statusReason: The enemy must reach the war drum before using it.

[Killed] BooleanLiteral
src/vtt/vane-warren.ts:617:7
     throw new Error('Only an enemy in this fight can sound the Vane Warren war drum.');
   }
   const alarmObject = drum(state);
-  if (!adjacent(positionOf(state.encounter, actor), alarmObject.object.position)) {
+  if (adjacent(positionOf(state.encounter, actor), alarmObject.object.position)) {
     throw new Error('The enemy must reach the war drum before using it.');
   }
killedBy: D377.5 The Vane Warren flagship bundle drum_double_trigger: taking the adjacent class action sounds the alarm once and cannot queue it again
statusReason: The enemy must reach the war drum before using it.

[Killed] MethodExpression
src/vtt/vane-warren.ts:620:23
   if (!adjacent(positionOf(state.encounter, actor), alarmObject.object.position)) {
     throw new Error('The enemy must reach the war drum before using it.');
   }
-  const usedAtRound = Math.max(1, state.encounter.round);
+  const usedAtRound = Math.min(1, state.encounter.round);
   return {
     ...state,
killedBy: D377.5 The Vane Warren flagship bundle dm_trigger_unlogged: exposes the object fallback and records its ruling card while sounding the same alarm once
statusReason: expected { kind: 'sounded', …(3) } to match object { kind: 'sounded', …(2) }
(1 matching property omitted from actual)

[Killed] ArithmeticOperator
src/vtt/vane-warren.ts:629:24
       usedAtRound,
       waves: state.fight.alarmWaves.map((wave) => ({
         id: wave.id,
-        deployAtRound: usedAtRound + wave.delayRounds,
+        deployAtRound: usedAtRound - wave.delayRounds,
         status: 'pending',
       })),
killedBy: D377.5 The Vane Warren flagship bundle alarm_double_wave: deploys each fight-local alarm wave once on its listed subsequent round
statusReason: expected [ 'ashmaw', 'cinder-guard-b', …(2) ] to have a length of 2 but got 4

[Survived] ArrayDeclaration
src/vtt/vane-warren.ts:634:52
       })),
     },
     transitions: [...state.transitions, {
-      kind: 'alarm_used', round: usedAtRound, ids: [String(alarmObject.object.id)],
+      kind: 'alarm_used', round: usedAtRound, ids: [],
     }],
   };

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:670:24
 function openPosition(state: EncounterState, preferred: GridCell): GridCell {
   const occupied = new Set(state.tokens.map((token) => `${String(token.position.column)},${String(token.position.row)}`));
   const blocked = new Set(state.blockedCells.map((cell) => `${String(cell.column)},${String(cell.row)}`));
-  for (let radius = 0; radius < Math.max(state.bounds.columns, state.bounds.rows); radius += 1) {
+  for (let radius = 0; false; radius += 1) {
     for (let row = Math.max(0, preferred.row - radius); row <= Math.min(state.bounds.rows - 1, preferred.row + radius); row += 1) {
       for (let column = Math.max(0, preferred.column - radius); column <= Math.min(state.bounds.columns - 1, preferred.column + radius); column += 1) {
killedBy: D382 survival package pins the fixed 30-seed final-encounter survival fraction at or above two thirds
statusReason: The Vane Warren has no open reinforcement cell.

[Killed] EqualityOperator
src/vtt/vane-warren.ts:670:24
 function openPosition(state: EncounterState, preferred: GridCell): GridCell {
   const occupied = new Set(state.tokens.map((token) => `${String(token.position.column)},${String(token.position.row)}`));
   const blocked = new Set(state.blockedCells.map((cell) => `${String(cell.column)},${String(cell.row)}`));
-  for (let radius = 0; radius < Math.max(state.bounds.columns, state.bounds.rows); radius += 1) {
+  for (let radius = 0; radius >= Math.max(state.bounds.columns, state.bounds.rows); radius += 1) {
     for (let row = Math.max(0, preferred.row - radius); row <= Math.min(state.bounds.rows - 1, preferred.row + radius); row += 1) {
       for (let column = Math.max(0, preferred.column - radius); column <= Math.min(state.bounds.columns - 1, preferred.column + radius); column += 1) {
killedBy: D377.5 The Vane Warren flagship bundle the live command reducer deploys each alarm wave once when its arrival round is reached
statusReason: The Vane Warren has no open reinforcement cell.

[Killed] BlockStatement
src/vtt/vane-warren.ts:671:131
   const occupied = new Set(state.tokens.map((token) => `${String(token.position.column)},${String(token.position.row)}`));
   const blocked = new Set(state.blockedCells.map((cell) => `${String(cell.column)},${String(cell.row)}`));
   for (let radius = 0; radius < Math.max(state.bounds.columns, state.bounds.rows); radius += 1) {
-    for (let row = Math.max(0, preferred.row - radius); row <= Math.min(state.bounds.rows - 1, preferred.row + radius); row += 1) {
-      for (let column = Math.max(0, preferred.column - radius); column <= Math.min(state.bounds.columns - 1, preferred.column + radius); column += 1) {
-        const key = `${String(column)},${String(row)}`;
-        if (!occupied.has(key) && !blocked.has(key)) return { column, row };
-      }
-    }
+    for (let row = Math.max(0, preferred.row - radius); row <= Math.min(state.bounds.rows - 1, preferred.row + radius); row += 1) {}
   }
   throw new Error('The Vane Warren has no open reinforcement cell.');
killedBy: D382 survival package pins the fixed 30-seed final-encounter survival fraction at or above two thirds
statusReason: The Vane Warren has no open reinforcement cell.

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:671:57
   const occupied = new Set(state.tokens.map((token) => `${String(token.position.column)},${String(token.position.row)}`));
   const blocked = new Set(state.blockedCells.map((cell) => `${String(cell.column)},${String(cell.row)}`));
   for (let radius = 0; radius < Math.max(state.bounds.columns, state.bounds.rows); radius += 1) {
-    for (let row = Math.max(0, preferred.row - radius); row <= Math.min(state.bounds.rows - 1, preferred.row + radius); row += 1) {
+    for (let row = Math.max(0, preferred.row - radius); false; row += 1) {
       for (let column = Math.max(0, preferred.column - radius); column <= Math.min(state.bounds.columns - 1, preferred.column + radius); column += 1) {
         const key = `${String(column)},${String(row)}`;
killedBy: D382 survival package pins the fixed 30-seed final-encounter survival fraction at or above two thirds
statusReason: The Vane Warren has no open reinforcement cell.

[Killed] BlockStatement
src/vtt/vane-warren.ts:672:151
   const blocked = new Set(state.blockedCells.map((cell) => `${String(cell.column)},${String(cell.row)}`));
   for (let radius = 0; radius < Math.max(state.bounds.columns, state.bounds.rows); radius += 1) {
     for (let row = Math.max(0, preferred.row - radius); row <= Math.min(state.bounds.rows - 1, preferred.row + radius); row += 1) {
-      for (let column = Math.max(0, preferred.column - radius); column <= Math.min(state.bounds.columns - 1, preferred.column + radius); column += 1) {
-        const key = `${String(column)},${String(row)}`;
-        if (!occupied.has(key) && !blocked.has(key)) return { column, row };
-      }
+      for (let column = Math.max(0, preferred.column - radius); column <= Math.min(state.bounds.columns - 1, preferred.column + radius); column += 1) {}
     }
   }
killedBy: D382 survival package pins the fixed 30-seed final-encounter survival fraction at or above two thirds
statusReason: The Vane Warren has no open reinforcement cell.

[Killed] EqualityOperator
src/vtt/vane-warren.ts:672:65
   const blocked = new Set(state.blockedCells.map((cell) => `${String(cell.column)},${String(cell.row)}`));
   for (let radius = 0; radius < Math.max(state.bounds.columns, state.bounds.rows); radius += 1) {
     for (let row = Math.max(0, preferred.row - radius); row <= Math.min(state.bounds.rows - 1, preferred.row + radius); row += 1) {
-      for (let column = Math.max(0, preferred.column - radius); column <= Math.min(state.bounds.columns - 1, preferred.column + radius); column += 1) {
+      for (let column = Math.max(0, preferred.column - radius); column > Math.min(state.bounds.columns - 1, preferred.column + radius); column += 1) {
         const key = `${String(column)},${String(row)}`;
         if (!occupied.has(key) && !blocked.has(key)) return { column, row };
killedBy: D382 survival package pins the fixed 30-seed final-encounter survival fraction at or above two thirds
statusReason: The Vane Warren has no open reinforcement cell.

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:674:13
     for (let row = Math.max(0, preferred.row - radius); row <= Math.min(state.bounds.rows - 1, preferred.row + radius); row += 1) {
       for (let column = Math.max(0, preferred.column - radius); column <= Math.min(state.bounds.columns - 1, preferred.column + radius); column += 1) {
         const key = `${String(column)},${String(row)}`;
-        if (!occupied.has(key) && !blocked.has(key)) return { column, row };
+        if (false) return { column, row };
       }
     }
killedBy: D382 survival package pins the fixed 30-seed final-encounter survival fraction at or above two thirds
statusReason: The Vane Warren has no open reinforcement cell.

[Killed] BooleanLiteral
src/vtt/vane-warren.ts:674:35
     for (let row = Math.max(0, preferred.row - radius); row <= Math.min(state.bounds.rows - 1, preferred.row + radius); row += 1) {
       for (let column = Math.max(0, preferred.column - radius); column <= Math.min(state.bounds.columns - 1, preferred.column + radius); column += 1) {
         const key = `${String(column)},${String(row)}`;
-        if (!occupied.has(key) && !blocked.has(key)) return { column, row };
+        if (!occupied.has(key) && blocked.has(key)) return { column, row };
       }
     }
killedBy: Vane Warren loader, chaining, seats, and end-session export all-algorithm chain concludes Iron Voice and assigns its conditional successor roster
statusReason: Algorithm host exceeded 200 decision boundaries.

[Survived] BooleanLiteral
src/vtt/vane-warren.ts:685:23
   initial: EncounterState,
   fight: VaneWarrenFight,
   entries: readonly VaneWarrenRosterEntry[],
-  incrementRevision = true,
+  incrementRevision = false,
 ): EncounterState {
   let encounter = initial;

[Killed] BlockStatement
src/vtt/vane-warren.ts:690:32
   let encounter = initial;
   const profiles: CombatantProfile[] = [];
   const positions: GridCell[] = [];
-  for (const entry of entries) {
-    const profile = profileFor(fight.id, entry);
-    const position = openPosition(encounter, entry.position);
-    profiles.push(profile);
-    positions.push(position);
-    encounter = {
-      ...encounter,
-      tokens: [...encounter.tokens, { id: profile.tokenId, combatantId: profile.id, position }],
-    };
-  }
+  for (const entry of entries) {}
   const initialized = createEncounter({
     bounds: initial.bounds,
killedBy: D382 survival package pins the fixed 30-seed final-encounter survival fraction at or above two thirds
statusReason: Vane Warren — The Last Muster: An encounter requires at least one combatant.

[Survived] UnaryOperator
src/vtt/vane-warren.ts:709:29
       position: positions[index] as GridCell,
     })),
   });
-  const lastSlot = Math.max(-1, ...encounter.initiative.map((entry) => entry.slot));
+  const lastSlot = Math.max(+1, ...encounter.initiative.map((entry) => entry.slot));
   const lastTotal = Math.min(0, ...encounter.initiative.map((entry) => entry.total));
   const appendedInitiative: readonly InitiativeEntry[] = encounter.initiative.length === 0

[Survived] MethodExpression
src/vtt/vane-warren.ts:709:20
       position: positions[index] as GridCell,
     })),
   });
-  const lastSlot = Math.max(-1, ...encounter.initiative.map((entry) => entry.slot));
+  const lastSlot = Math.min(-1, ...encounter.initiative.map(entry => entry.slot));
   const lastTotal = Math.min(0, ...encounter.initiative.map((entry) => entry.total));
   const appendedInitiative: readonly InitiativeEntry[] = encounter.initiative.length === 0

[Survived] MethodExpression
src/vtt/vane-warren.ts:710:21
     })),
   });
   const lastSlot = Math.max(-1, ...encounter.initiative.map((entry) => entry.slot));
-  const lastTotal = Math.min(0, ...encounter.initiative.map((entry) => entry.total));
+  const lastTotal = Math.max(0, ...encounter.initiative.map(entry => entry.total));
   const appendedInitiative: readonly InitiativeEntry[] = encounter.initiative.length === 0
     ? []

[Killed] EqualityOperator
src/vtt/vane-warren.ts:711:58
   });
   const lastSlot = Math.max(-1, ...encounter.initiative.map((entry) => entry.slot));
   const lastTotal = Math.min(0, ...encounter.initiative.map((entry) => entry.total));
-  const appendedInitiative: readonly InitiativeEntry[] = encounter.initiative.length === 0
+  const appendedInitiative: readonly InitiativeEntry[] = encounter.initiative.length !== 0
     ? []
     : profiles.map((profile, index) => ({
killedBy: Vane Warren loader, chaining, seats, and end-session export all-algorithm chain concludes Iron Voice and assigns its conditional successor roster
statusReason: Algorithm host published 1,000 times at round 13 after resource_spent.

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:711:58
   });
   const lastSlot = Math.max(-1, ...encounter.initiative.map((entry) => entry.slot));
   const lastTotal = Math.min(0, ...encounter.initiative.map((entry) => entry.total));
-  const appendedInitiative: readonly InitiativeEntry[] = encounter.initiative.length === 0
+  const appendedInitiative: readonly InitiativeEntry[] = true
     ? []
     : profiles.map((profile, index) => ({
killedBy: Vane Warren loader, chaining, seats, and end-session export all-algorithm chain concludes Iron Voice and assigns its conditional successor roster
statusReason: Algorithm host published 1,000 times at round 13 after resource_spent.

[Survived] ArithmeticOperator
src/vtt/vane-warren.ts:715:16
     ? []
     : profiles.map((profile, index) => ({
         combatant: profile.id,
-        total: lastTotal - 1,
+        total: lastTotal + 1,
         roll: 1,
         bonus: profile.rules.initiativeBonus,

[Survived] ArithmeticOperator
src/vtt/vane-warren.ts:718:15
         total: lastTotal - 1,
         roll: 1,
         bonus: profile.rules.initiativeBonus,
-        slot: lastSlot + index + 1,
+        slot: lastSlot + index - 1,
       }));
   return {

[Survived] ArithmeticOperator
src/vtt/vane-warren.ts:718:15
         total: lastTotal - 1,
         roll: 1,
         bonus: profile.rules.initiativeBonus,
-        slot: lastSlot + index + 1,
+        slot: lastSlot - index + 1,
       }));
   return {

[Survived] ArithmeticOperator
src/vtt/vane-warren.ts:722:35
       }));
   return {
     ...encounter,
-    revision: incrementRevision ? encounter.revision + 1 : encounter.revision,
+    revision: incrementRevision ? encounter.revision - 1 : encounter.revision,
     combatants: [...encounter.combatants, ...initialized.combatants],
     initiative: [...encounter.initiative, ...appendedInitiative],

[Killed] ArrowFunction
src/vtt/vane-warren.ts:740:34
 }
 
 function fightForEncounter(state: EncounterState): VaneWarrenFight | null {
-  return VANE_WARREN_FIGHTS.find((fight) => state.combatants.some((subject) =>
-    subject.profile.id === combatantId(`combatant:vane-warren:${fight.id}:${fight.leaderRosterId}`))) ?? null;
+  return VANE_WARREN_FIGHTS.find(() => undefined) ?? null;
 }
 
killedBy: D377.5 The Vane Warren flagship bundle the live command reducer deploys each alarm wave once when its arrival round is reached
statusReason: expected [] to have a length of 1 but got +0
