[Killed] ArrowFunction
src/vtt/vane-warren.ts:740:67
 }
 
 function fightForEncounter(state: EncounterState): VaneWarrenFight | null {
-  return VANE_WARREN_FIGHTS.find((fight) => state.combatants.some((subject) =>
-    subject.profile.id === combatantId(`combatant:vane-warren:${fight.id}:${fight.leaderRosterId}`))) ?? null;
+  return VANE_WARREN_FIGHTS.find((fight) => state.combatants.some(() => undefined)) ?? null;
 }
 
killedBy: Vane Warren loader, chaining, seats, and end-session export all-algorithm chain concludes Iron Voice and assigns its conditional successor roster
statusReason: expected [ { …(4) }, { …(4) }, { …(4) }, …(3) ] to deep equally contain ObjectContaining{…}

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:741:5
 
 function fightForEncounter(state: EncounterState): VaneWarrenFight | null {
   return VANE_WARREN_FIGHTS.find((fight) => state.combatants.some((subject) =>
-    subject.profile.id === combatantId(`combatant:vane-warren:${fight.id}:${fight.leaderRosterId}`))) ?? null;
+    false)) ?? null;
 }
 
killedBy: Vane Warren loader, chaining, seats, and end-session export all-algorithm chain concludes Iron Voice and assigns its conditional successor roster
statusReason: expected [ { …(4) }, { …(4) }, { …(4) }, …(3) ] to deep equally contain ObjectContaining{…}

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:741:5
 
 function fightForEncounter(state: EncounterState): VaneWarrenFight | null {
   return VANE_WARREN_FIGHTS.find((fight) => state.combatants.some((subject) =>
-    subject.profile.id === combatantId(`combatant:vane-warren:${fight.id}:${fight.leaderRosterId}`))) ?? null;
+    true)) ?? null;
 }
 
killedBy: Vane Warren loader, chaining, seats, and end-session export all-algorithm chain concludes Iron Voice and assigns its conditional successor roster
statusReason: expected [ { …(4) }, { …(4) }, { …(4) }, …(3) ] to deep equally contain ObjectContaining{…}

[Killed] ArrowFunction
src/vtt/vane-warren.ts:754:47
   const fight = fightForEncounter(reduction.state);
   if (fight === null) return reduction;
   const alarmObjectId = worldObjectId(`world-object:vane-warren:${fight.id}:war_drum`);
-  const alarm = reduction.state.eventLog.find((event) =>
-    event.type === 'world_object_used' &&
-    event.objectId === alarmObjectId &&
-    event.actionId === VANE_WARREN_SOUND_DRUM_ACTION_ID);
+  const alarm = reduction.state.eventLog.find(() => undefined);
   let next = reduction.state;
   const events: EncounterEvent[] = [...reduction.events];
killedBy: D377.5 The Vane Warren flagship bundle the live command reducer deploys each alarm wave once when its arrival round is reached
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:755:5
   if (fight === null) return reduction;
   const alarmObjectId = worldObjectId(`world-object:vane-warren:${fight.id}:war_drum`);
   const alarm = reduction.state.eventLog.find((event) =>
-    event.type === 'world_object_used' &&
-    event.objectId === alarmObjectId &&
-    event.actionId === VANE_WARREN_SOUND_DRUM_ACTION_ID);
+    false);
   let next = reduction.state;
   const events: EncounterEvent[] = [...reduction.events];
killedBy: D377.5 The Vane Warren flagship bundle the live command reducer deploys each alarm wave once when its arrival round is reached
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:755:5
   if (fight === null) return reduction;
   const alarmObjectId = worldObjectId(`world-object:vane-warren:${fight.id}:war_drum`);
   const alarm = reduction.state.eventLog.find((event) =>
-    event.type === 'world_object_used' &&
-    event.objectId === alarmObjectId &&
-    event.actionId === VANE_WARREN_SOUND_DRUM_ACTION_ID);
+    true);
   let next = reduction.state;
   const events: EncounterEvent[] = [...reduction.events];
killedBy: D377.5 The Vane Warren flagship bundle the live command reducer deploys each alarm wave once when its arrival round is reached
statusReason: expected [] to have a length of 1 but got +0

[Killed] EqualityOperator
src/vtt/vane-warren.ts:756:5
   const alarmObjectId = worldObjectId(`world-object:vane-warren:${fight.id}:war_drum`);
   const alarm = reduction.state.eventLog.find((event) =>
     event.type === 'world_object_used' &&
-    event.objectId === alarmObjectId &&
+    event.objectId !== alarmObjectId &&
     event.actionId === VANE_WARREN_SOUND_DRUM_ACTION_ID);
   let next = reduction.state;
killedBy: D377.5 The Vane Warren flagship bundle the live command reducer deploys each alarm wave once when its arrival round is reached
statusReason: expected [] to have a length of 1 but got +0

[Survived] ConditionalExpression
src/vtt/vane-warren.ts:756:5
   const alarmObjectId = worldObjectId(`world-object:vane-warren:${fight.id}:war_drum`);
   const alarm = reduction.state.eventLog.find((event) =>
     event.type === 'world_object_used' &&
-    event.objectId === alarmObjectId &&
+    true &&
     event.actionId === VANE_WARREN_SOUND_DRUM_ACTION_ID);
   let next = reduction.state;

[Killed] EqualityOperator
src/vtt/vane-warren.ts:757:5
   const alarm = reduction.state.eventLog.find((event) =>
     event.type === 'world_object_used' &&
     event.objectId === alarmObjectId &&
-    event.actionId === VANE_WARREN_SOUND_DRUM_ACTION_ID);
+    event.actionId !== VANE_WARREN_SOUND_DRUM_ACTION_ID);
   let next = reduction.state;
   const events: EncounterEvent[] = [...reduction.events];
killedBy: D377.5 The Vane Warren flagship bundle the live command reducer deploys each alarm wave once when its arrival round is reached
statusReason: expected [] to have a length of 1 but got +0

[Survived] ConditionalExpression
src/vtt/vane-warren.ts:757:5
   const alarm = reduction.state.eventLog.find((event) =>
     event.type === 'world_object_used' &&
     event.objectId === alarmObjectId &&
-    event.actionId === VANE_WARREN_SOUND_DRUM_ACTION_ID);
+    true);
   let next = reduction.state;
   const events: EncounterEvent[] = [...reduction.events];

[Killed] BlockStatement
src/vtt/vane-warren.ts:760:44
     event.actionId === VANE_WARREN_SOUND_DRUM_ACTION_ID);
   let next = reduction.state;
   const events: EncounterEvent[] = [...reduction.events];
-  if (alarm?.type === 'world_object_used') {
-    for (const wave of fight.alarmWaves) {
-      const deployAtRound = alarm.round + wave.delayRounds;
-      const alreadyDeployed = wave.adds.every((entry) => next.combatants.some((subject) =>
-        subject.profile.id === combatantId(`combatant:vane-warren:${fight.id}:${entry.id}`)));
-      if (alreadyDeployed || deployAtRound > next.round) continue;
-      next = deployRosterEntriesInEncounter(next, fight, wave.adds, false);
-      const event: EncounterEvent = {
-        sequence: next.nextEventSequence,
-        type: 'reinforcement_wave_deployed',
-        objectId: alarmObjectId,
-        waveId: wave.id,
-        calledBy: alarm.actor,
-        combatants: wave.adds.map((entry) => combatantId(`combatant:vane-warren:${fight.id}:${entry.id}`)),
-        round: next.round,
-      };
-      next = {
-        ...next,
-        nextEventSequence: next.nextEventSequence + 1,
-        eventLog: [...next.eventLog, event],
-      };
-      events.push(event);
-    }
-  }
+  if (alarm?.type === 'world_object_used') {}
   const pendingJoiners = fight.conditionalJoiners.filter((entry) => !next.combatants.some((subject) =>
     subject.profile.id === combatantId(`combatant:vane-warren:${fight.id}:${entry.id}`)));
killedBy: D377.5 The Vane Warren flagship bundle the live command reducer deploys each alarm wave once when its arrival round is reached
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/vtt/vane-warren.ts:761:42
   let next = reduction.state;
   const events: EncounterEvent[] = [...reduction.events];
   if (alarm?.type === 'world_object_used') {
-    for (const wave of fight.alarmWaves) {
-      const deployAtRound = alarm.round + wave.delayRounds;
-      const alreadyDeployed = wave.adds.every((entry) => next.combatants.some((subject) =>
-        subject.profile.id === combatantId(`combatant:vane-warren:${fight.id}:${entry.id}`)));
-      if (alreadyDeployed || deployAtRound > next.round) continue;
-      next = deployRosterEntriesInEncounter(next, fight, wave.adds, false);
-      const event: EncounterEvent = {
-        sequence: next.nextEventSequence,
-        type: 'reinforcement_wave_deployed',
-        objectId: alarmObjectId,
-        waveId: wave.id,
-        calledBy: alarm.actor,
-        combatants: wave.adds.map((entry) => combatantId(`combatant:vane-warren:${fight.id}:${entry.id}`)),
-        round: next.round,
-      };
-      next = {
-        ...next,
-        nextEventSequence: next.nextEventSequence + 1,
-        eventLog: [...next.eventLog, event],
-      };
-      events.push(event);
-    }
+    for (const wave of fight.alarmWaves) {}
   }
   const pendingJoiners = fight.conditionalJoiners.filter((entry) => !next.combatants.some((subject) =>
killedBy: D377.5 The Vane Warren flagship bundle the live command reducer deploys each alarm wave once when its arrival round is reached
statusReason: expected [] to have a length of 1 but got +0

[Killed] ArithmeticOperator
src/vtt/vane-warren.ts:762:29
   const events: EncounterEvent[] = [...reduction.events];
   if (alarm?.type === 'world_object_used') {
     for (const wave of fight.alarmWaves) {
-      const deployAtRound = alarm.round + wave.delayRounds;
+      const deployAtRound = alarm.round - wave.delayRounds;
       const alreadyDeployed = wave.adds.every((entry) => next.combatants.some((subject) =>
         subject.profile.id === combatantId(`combatant:vane-warren:${fight.id}:${entry.id}`)));
killedBy: D377.5 The Vane Warren flagship bundle the live command reducer deploys each alarm wave once when its arrival round is reached
statusReason: expected [ { sequence: 3, …(6) }, …(1) ] to have a length of 1 but got 2

[Killed] MethodExpression
src/vtt/vane-warren.ts:763:58
   if (alarm?.type === 'world_object_used') {
     for (const wave of fight.alarmWaves) {
       const deployAtRound = alarm.round + wave.delayRounds;
-      const alreadyDeployed = wave.adds.every((entry) => next.combatants.some((subject) =>
-        subject.profile.id === combatantId(`combatant:vane-warren:${fight.id}:${entry.id}`)));
+      const alreadyDeployed = wave.adds.every((entry) => next.combatants.every(subject => subject.profile.id === combatantId(`combatant:vane-warren:${fight.id}:${entry.id}`)));
       if (alreadyDeployed || deployAtRound > next.round) continue;
       next = deployRosterEntriesInEncounter(next, fight, wave.adds, false);
killedBy: Vane Warren loader, chaining, seats, and end-session export all-algorithm chain concludes Iron Voice and assigns its conditional successor roster
statusReason: Algorithm host action refused: Combatant combatant:character-5 has no spell action available.

[Killed] ArrowFunction
src/vtt/vane-warren.ts:763:79
   if (alarm?.type === 'world_object_used') {
     for (const wave of fight.alarmWaves) {
       const deployAtRound = alarm.round + wave.delayRounds;
-      const alreadyDeployed = wave.adds.every((entry) => next.combatants.some((subject) =>
-        subject.profile.id === combatantId(`combatant:vane-warren:${fight.id}:${entry.id}`)));
+      const alreadyDeployed = wave.adds.every((entry) => next.combatants.some(() => undefined));
       if (alreadyDeployed || deployAtRound > next.round) continue;
       next = deployRosterEntriesInEncounter(next, fight, wave.adds, false);
killedBy: Vane Warren loader, chaining, seats, and end-session export all-algorithm chain concludes Iron Voice and assigns its conditional successor roster
statusReason: Algorithm host action refused: Combatant combatant:character-5 has no spell action available.

[Killed] EqualityOperator
src/vtt/vane-warren.ts:764:9
     for (const wave of fight.alarmWaves) {
       const deployAtRound = alarm.round + wave.delayRounds;
       const alreadyDeployed = wave.adds.every((entry) => next.combatants.some((subject) =>
-        subject.profile.id === combatantId(`combatant:vane-warren:${fight.id}:${entry.id}`)));
+        subject.profile.id !== combatantId(`combatant:vane-warren:${fight.id}:${entry.id}`)));
       if (alreadyDeployed || deployAtRound > next.round) continue;
       next = deployRosterEntriesInEncounter(next, fight, wave.adds, false);
killedBy: D377.5 The Vane Warren flagship bundle the live command reducer deploys each alarm wave once when its arrival round is reached
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:764:9
     for (const wave of fight.alarmWaves) {
       const deployAtRound = alarm.round + wave.delayRounds;
       const alreadyDeployed = wave.adds.every((entry) => next.combatants.some((subject) =>
-        subject.profile.id === combatantId(`combatant:vane-warren:${fight.id}:${entry.id}`)));
+        false));
       if (alreadyDeployed || deployAtRound > next.round) continue;
       next = deployRosterEntriesInEncounter(next, fight, wave.adds, false);
killedBy: Vane Warren loader, chaining, seats, and end-session export all-algorithm chain concludes Iron Voice and assigns its conditional successor roster
statusReason: Algorithm host action refused: Combatant combatant:character-5 has no spell action available.

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:765:11
       const deployAtRound = alarm.round + wave.delayRounds;
       const alreadyDeployed = wave.adds.every((entry) => next.combatants.some((subject) =>
         subject.profile.id === combatantId(`combatant:vane-warren:${fight.id}:${entry.id}`)));
-      if (alreadyDeployed || deployAtRound > next.round) continue;
+      if (false) continue;
       next = deployRosterEntriesInEncounter(next, fight, wave.adds, false);
       const event: EncounterEvent = {
killedBy: Vane Warren loader, chaining, seats, and end-session export all-algorithm chain concludes Iron Voice and assigns its conditional successor roster
statusReason: Algorithm host timed out after 14 publications at round 1 on Vane Guard after reinforcement_wave_deployed.

[Killed] EqualityOperator
src/vtt/vane-warren.ts:765:30
       const deployAtRound = alarm.round + wave.delayRounds;
       const alreadyDeployed = wave.adds.every((entry) => next.combatants.some((subject) =>
         subject.profile.id === combatantId(`combatant:vane-warren:${fight.id}:${entry.id}`)));
-      if (alreadyDeployed || deployAtRound > next.round) continue;
+      if (alreadyDeployed || deployAtRound <= next.round) continue;
       next = deployRosterEntriesInEncounter(next, fight, wave.adds, false);
       const event: EncounterEvent = {
killedBy: D377.5 The Vane Warren flagship bundle the live command reducer deploys each alarm wave once when its arrival round is reached
statusReason: expected [ { sequence: 3, …(6) }, …(1) ] to have a length of 1 but got 2

[Survived] BooleanLiteral
src/vtt/vane-warren.ts:766:69
       const alreadyDeployed = wave.adds.every((entry) => next.combatants.some((subject) =>
         subject.profile.id === combatantId(`combatant:vane-warren:${fight.id}:${entry.id}`)));
       if (alreadyDeployed || deployAtRound > next.round) continue;
-      next = deployRosterEntriesInEncounter(next, fight, wave.adds, false);
+      next = deployRosterEntriesInEncounter(next, fight, wave.adds, true);
       const event: EncounterEvent = {
         sequence: next.nextEventSequence,

[Survived] ArithmeticOperator
src/vtt/vane-warren.ts:778:28
       };
       next = {
         ...next,
-        nextEventSequence: next.nextEventSequence + 1,
+        nextEventSequence: next.nextEventSequence - 1,
         eventLog: [...next.eventLog, event],
       };

[Killed] ArrowFunction
src/vtt/vane-warren.ts:784:58
       events.push(event);
     }
   }
-  const pendingJoiners = fight.conditionalJoiners.filter((entry) => !next.combatants.some((subject) =>
-    subject.profile.id === combatantId(`combatant:vane-warren:${fight.id}:${entry.id}`)));
+  const pendingJoiners = fight.conditionalJoiners.filter(() => undefined);
   const leader = next.combatants.find((subject) =>
     subject.profile.id === combatantId(`combatant:vane-warren:${fight.id}:${fight.leaderRosterId}`));
killedBy: Vane Warren loader, chaining, seats, and end-session export all-algorithm chain concludes Iron Voice and assigns its conditional successor roster
statusReason: expected [ { …(4) }, { …(4) }, { …(4) }, …(3) ] to deep equally contain ObjectContaining{…}

[Killed] ArrowFunction
src/vtt/vane-warren.ts:784:91
       events.push(event);
     }
   }
-  const pendingJoiners = fight.conditionalJoiners.filter((entry) => !next.combatants.some((subject) =>
-    subject.profile.id === combatantId(`combatant:vane-warren:${fight.id}:${entry.id}`)));
+  const pendingJoiners = fight.conditionalJoiners.filter((entry) => !next.combatants.some(() => undefined));
   const leader = next.combatants.find((subject) =>
     subject.profile.id === combatantId(`combatant:vane-warren:${fight.id}:${fight.leaderRosterId}`));
killedBy: Vane Warren loader, chaining, seats, and end-session export all-algorithm chain concludes Iron Voice and assigns its conditional successor roster
statusReason: Algorithm host action refused: Illegal movement: non_adjacent_step at step 0.

[Killed] EqualityOperator
src/vtt/vane-warren.ts:785:5
     }
   }
   const pendingJoiners = fight.conditionalJoiners.filter((entry) => !next.combatants.some((subject) =>
-    subject.profile.id === combatantId(`combatant:vane-warren:${fight.id}:${entry.id}`)));
+    subject.profile.id !== combatantId(`combatant:vane-warren:${fight.id}:${entry.id}`)));
   const leader = next.combatants.find((subject) =>
     subject.profile.id === combatantId(`combatant:vane-warren:${fight.id}:${fight.leaderRosterId}`));
killedBy: Vane Warren loader, chaining, seats, and end-session export all-algorithm chain concludes Iron Voice and assigns its conditional successor roster
statusReason: expected [ { …(4) }, { …(4) }, { …(4) }, …(3) ] to deep equally contain ObjectContaining{…}

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:785:5
     }
   }
   const pendingJoiners = fight.conditionalJoiners.filter((entry) => !next.combatants.some((subject) =>
-    subject.profile.id === combatantId(`combatant:vane-warren:${fight.id}:${entry.id}`)));
+    false));
   const leader = next.combatants.find((subject) =>
     subject.profile.id === combatantId(`combatant:vane-warren:${fight.id}:${fight.leaderRosterId}`));
killedBy: D382 survival package pins the fixed 30-seed final-encounter survival fraction at or above two thirds
statusReason: Controller already assigned to combatant:vane-warren:last-muster:muster-joiner-a.

[Killed] ArrowFunction
src/vtt/vane-warren.ts:786:39
   }
   const pendingJoiners = fight.conditionalJoiners.filter((entry) => !next.combatants.some((subject) =>
     subject.profile.id === combatantId(`combatant:vane-warren:${fight.id}:${entry.id}`)));
-  const leader = next.combatants.find((subject) =>
-    subject.profile.id === combatantId(`combatant:vane-warren:${fight.id}:${fight.leaderRosterId}`));
+  const leader = next.combatants.find(() => undefined);
   if (pendingJoiners.length > 0 && leader !== undefined &&
     leader.hitPoints * 2 <= leader.profile.rules.hitPointMaximum) {
killedBy: Vane Warren loader, chaining, seats, and end-session export all-algorithm chain concludes Iron Voice and assigns its conditional successor roster
statusReason: expected [ { …(4) }, { …(4) }, { …(4) }, …(3) ] to deep equally contain ObjectContaining{…}

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:787:5
   const pendingJoiners = fight.conditionalJoiners.filter((entry) => !next.combatants.some((subject) =>
     subject.profile.id === combatantId(`combatant:vane-warren:${fight.id}:${entry.id}`)));
   const leader = next.combatants.find((subject) =>
-    subject.profile.id === combatantId(`combatant:vane-warren:${fight.id}:${fight.leaderRosterId}`));
+    true);
   if (pendingJoiners.length > 0 && leader !== undefined &&
     leader.hitPoints * 2 <= leader.profile.rules.hitPointMaximum) {
killedBy: Vane Warren loader, chaining, seats, and end-session export all-algorithm chain concludes Iron Voice and assigns its conditional successor roster
statusReason: expected [ { …(4) }, { …(4) }, { …(4) }, …(3) ] to deep equally contain ObjectContaining{…}

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:787:5
   const pendingJoiners = fight.conditionalJoiners.filter((entry) => !next.combatants.some((subject) =>
     subject.profile.id === combatantId(`combatant:vane-warren:${fight.id}:${entry.id}`)));
   const leader = next.combatants.find((subject) =>
-    subject.profile.id === combatantId(`combatant:vane-warren:${fight.id}:${fight.leaderRosterId}`));
+    false);
   if (pendingJoiners.length > 0 && leader !== undefined &&
     leader.hitPoints * 2 <= leader.profile.rules.hitPointMaximum) {
killedBy: Vane Warren loader, chaining, seats, and end-session export all-algorithm chain concludes Iron Voice and assigns its conditional successor roster
statusReason: expected [ { …(4) }, { …(4) }, { …(4) }, …(3) ] to deep equally contain ObjectContaining{…}

[Killed] EqualityOperator
src/vtt/vane-warren.ts:788:7
     subject.profile.id === combatantId(`combatant:vane-warren:${fight.id}:${entry.id}`)));
   const leader = next.combatants.find((subject) =>
     subject.profile.id === combatantId(`combatant:vane-warren:${fight.id}:${fight.leaderRosterId}`));
-  if (pendingJoiners.length > 0 && leader !== undefined &&
+  if (pendingJoiners.length >= 0 && leader !== undefined &&
     leader.hitPoints * 2 <= leader.profile.rules.hitPointMaximum) {
     next = deployRosterEntriesInEncounter(next, fight, pendingJoiners, false);
killedBy: Vane Warren loader, chaining, seats, and end-session export all-algorithm chain concludes Iron Voice and assigns its conditional successor roster
statusReason: Algorithm host action refused: An encounter requires at least one combatant.

[Killed] EqualityOperator
src/vtt/vane-warren.ts:788:7
     subject.profile.id === combatantId(`combatant:vane-warren:${fight.id}:${entry.id}`)));
   const leader = next.combatants.find((subject) =>
     subject.profile.id === combatantId(`combatant:vane-warren:${fight.id}:${fight.leaderRosterId}`));
-  if (pendingJoiners.length > 0 && leader !== undefined &&
+  if (pendingJoiners.length <= 0 && leader !== undefined &&
     leader.hitPoints * 2 <= leader.profile.rules.hitPointMaximum) {
     next = deployRosterEntriesInEncounter(next, fight, pendingJoiners, false);
killedBy: Vane Warren loader, chaining, seats, and end-session export all-algorithm chain concludes Iron Voice and assigns its conditional successor roster
statusReason: Algorithm host action refused: An encounter requires at least one combatant.

[Killed] EqualityOperator
src/vtt/vane-warren.ts:789:5
   const leader = next.combatants.find((subject) =>
     subject.profile.id === combatantId(`combatant:vane-warren:${fight.id}:${fight.leaderRosterId}`));
   if (pendingJoiners.length > 0 && leader !== undefined &&
-    leader.hitPoints * 2 <= leader.profile.rules.hitPointMaximum) {
+    leader.hitPoints * 2 > leader.profile.rules.hitPointMaximum) {
     next = deployRosterEntriesInEncounter(next, fight, pendingJoiners, false);
     const event: EncounterEvent = {
killedBy: D382 survival package pins the fixed 30-seed final-encounter survival fraction at or above two thirds
statusReason: expected { successes: 28, total: 30 } to deeply equal { successes: 29, total: 30 }

[Killed] BlockStatement
src/vtt/vane-warren.ts:789:67
   const leader = next.combatants.find((subject) =>
     subject.profile.id === combatantId(`combatant:vane-warren:${fight.id}:${fight.leaderRosterId}`));
   if (pendingJoiners.length > 0 && leader !== undefined &&
-    leader.hitPoints * 2 <= leader.profile.rules.hitPointMaximum) {
-    next = deployRosterEntriesInEncounter(next, fight, pendingJoiners, false);
-    const event: EncounterEvent = {
-      sequence: next.nextEventSequence,
-      type: 'conditional_joiners_deployed',
-      leader: leader.profile.id,
-      combatants: pendingJoiners.map((entry) => combatantId(`combatant:vane-warren:${fight.id}:${entry.id}`)),
-      condition: 'leader_bloodied',
-      round: next.round,
-    };
-    next = {
-      ...next,
-      nextEventSequence: next.nextEventSequence + 1,
-      eventLog: [...next.eventLog, event],
-    };
-    events.push(event);
-  }
+    leader.hitPoints * 2 <= leader.profile.rules.hitPointMaximum) {}
   return { state: next, events };
 };
killedBy: Vane Warren loader, chaining, seats, and end-session export all-algorithm chain concludes Iron Voice and assigns its conditional successor roster
statusReason: expected [ { …(4) }, { …(4) }, { …(4) }, …(3) ] to deep equally contain ObjectContaining{…}

[Survived] BooleanLiteral
src/vtt/vane-warren.ts:790:72
     subject.profile.id === combatantId(`combatant:vane-warren:${fight.id}:${fight.leaderRosterId}`));
   if (pendingJoiners.length > 0 && leader !== undefined &&
     leader.hitPoints * 2 <= leader.profile.rules.hitPointMaximum) {
-    next = deployRosterEntriesInEncounter(next, fight, pendingJoiners, false);
+    next = deployRosterEntriesInEncounter(next, fight, pendingJoiners, true);
     const event: EncounterEvent = {
       sequence: next.nextEventSequence,

[Killed] EqualityOperator
src/vtt/vane-warren.ts:813:39
   state: VaneWarrenEncounterState,
   round: number,
 ): VaneWarrenEncounterState {
-  if (!Number.isSafeInteger(round) || round < 1) throw new RangeError('Alarm advancement requires a positive round.');
+  if (!Number.isSafeInteger(round) || round >= 1) throw new RangeError('Alarm advancement requires a positive round.');
   if (state.alarm.kind !== 'sounded') return state;
   const due = state.alarm.waves.filter((wave) => wave.status === 'pending' && wave.deployAtRound <= round);
killedBy: D377.5 The Vane Warren flagship bundle alarm_double_wave: deploys each fight-local alarm wave once on its listed subsequent round
statusReason: Alarm advancement requires a positive round.

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:813:7
   state: VaneWarrenEncounterState,
   round: number,
 ): VaneWarrenEncounterState {
-  if (!Number.isSafeInteger(round) || round < 1) throw new RangeError('Alarm advancement requires a positive round.');
+  if (false) throw new RangeError('Alarm advancement requires a positive round.');
   if (state.alarm.kind !== 'sounded') return state;
   const due = state.alarm.waves.filter((wave) => wave.status === 'pending' && wave.deployAtRound <= round);
killedBy: D377.5 The Vane Warren flagship bundle rejects invalid alarm rounds and a sounded wave absent from the fight manifest
statusReason: expected [Function] to throw an error

[Killed] LogicalOperator
src/vtt/vane-warren.ts:815:50
 ): VaneWarrenEncounterState {
   if (!Number.isSafeInteger(round) || round < 1) throw new RangeError('Alarm advancement requires a positive round.');
   if (state.alarm.kind !== 'sounded') return state;
-  const due = state.alarm.waves.filter((wave) => wave.status === 'pending' && wave.deployAtRound <= round);
+  const due = state.alarm.waves.filter((wave) => wave.status === 'pending' || wave.deployAtRound <= round);
   let next = state;
   for (const pending of due) {
killedBy: D377.5 The Vane Warren flagship bundle alarm_double_wave: deploys each fight-local alarm wave once on its listed subsequent round
statusReason: expected [ 'ashmaw', 'cinder-guard-b', …(2) ] to have a length of 2 but got 4

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:815:50
 ): VaneWarrenEncounterState {
   if (!Number.isSafeInteger(round) || round < 1) throw new RangeError('Alarm advancement requires a positive round.');
   if (state.alarm.kind !== 'sounded') return state;
-  const due = state.alarm.waves.filter((wave) => wave.status === 'pending' && wave.deployAtRound <= round);
+  const due = state.alarm.waves.filter((wave) => false);
   let next = state;
   for (const pending of due) {
killedBy: D377.5 The Vane Warren flagship bundle alarm_double_wave: deploys each fight-local alarm wave once on its listed subsequent round
statusReason: expected [ 'ashmaw', 'cinder-guard-b' ] to have a length of 3 but got 2

[Killed] BlockStatement
src/vtt/vane-warren.ts:817:30
   if (state.alarm.kind !== 'sounded') return state;
   const due = state.alarm.waves.filter((wave) => wave.status === 'pending' && wave.deployAtRound <= round);
   let next = state;
-  for (const pending of due) {
-    const wave = state.fight.alarmWaves.find((candidate) => candidate.id === pending.id);
-    if (wave === undefined) throw new Error(`Alarm wave ${pending.id} is not listed for ${state.fight.name}.`);
-    next = deployRosterEntries(next, wave.adds);
-    next = {
-      ...next,
-      transitions: [...next.transitions, {
-        kind: 'alarm_wave_deployed', round, ids: wave.adds.map((entry) => entry.id),
-      }],
-    };
-  }
+  for (const pending of due) {}
   const waves = state.alarm.waves.map((wave) =>
     due.some((candidate) => candidate.id === wave.id) ? { ...wave, status: 'deployed' as const } : wave);
killedBy: D377.5 The Vane Warren flagship bundle alarm_double_wave: deploys each fight-local alarm wave once on its listed subsequent round
statusReason: expected [ 'ashmaw', 'cinder-guard-b' ] to have a length of 3 but got 2
