[Killed] ConditionalExpression
src/vtt/vane-warren.ts:818:61
   const due = state.alarm.waves.filter((wave) => wave.status === 'pending' && wave.deployAtRound <= round);
   let next = state;
   for (const pending of due) {
-    const wave = state.fight.alarmWaves.find((candidate) => candidate.id === pending.id);
+    const wave = state.fight.alarmWaves.find((candidate) => false);
     if (wave === undefined) throw new Error(`Alarm wave ${pending.id} is not listed for ${state.fight.name}.`);
     next = deployRosterEntries(next, wave.adds);
killedBy: D377.5 The Vane Warren flagship bundle alarm_double_wave: deploys each fight-local alarm wave once on its listed subsequent round
statusReason: Alarm wave cinder-first-beat is not listed for The Cinder Rite.

[Killed] ArrowFunction
src/vtt/vane-warren.ts:818:46
   const due = state.alarm.waves.filter((wave) => wave.status === 'pending' && wave.deployAtRound <= round);
   let next = state;
   for (const pending of due) {
-    const wave = state.fight.alarmWaves.find((candidate) => candidate.id === pending.id);
+    const wave = state.fight.alarmWaves.find(() => undefined);
     if (wave === undefined) throw new Error(`Alarm wave ${pending.id} is not listed for ${state.fight.name}.`);
     next = deployRosterEntries(next, wave.adds);
killedBy: D377.5 The Vane Warren flagship bundle alarm_double_wave: deploys each fight-local alarm wave once on its listed subsequent round
statusReason: Alarm wave cinder-first-beat is not listed for The Cinder Rite.

[Killed] StringLiteral
src/vtt/vane-warren.ts:819:45
   let next = state;
   for (const pending of due) {
     const wave = state.fight.alarmWaves.find((candidate) => candidate.id === pending.id);
-    if (wave === undefined) throw new Error(`Alarm wave ${pending.id} is not listed for ${state.fight.name}.`);
+    if (wave === undefined) throw new Error(``);
     next = deployRosterEntries(next, wave.adds);
     next = {
killedBy: D377.5 The Vane Warren flagship bundle rejects invalid alarm rounds and a sounded wave absent from the fight manifest
statusReason: expected [Function] to throw error including 'Alarm wave missing-wave is not listed…' but got ''

[Killed] ArrayDeclaration
src/vtt/vane-warren.ts:823:20
     next = deployRosterEntries(next, wave.adds);
     next = {
       ...next,
-      transitions: [...next.transitions, {
-        kind: 'alarm_wave_deployed', round, ids: wave.adds.map((entry) => entry.id),
-      }],
+      transitions: [],
     };
   }
killedBy: D377.5 The Vane Warren flagship bundle alarm_double_wave: deploys each fight-local alarm wave once on its listed subsequent round
statusReason: expected [] to have a length of 2 but got +0

[Killed] EqualityOperator
src/vtt/vane-warren.ts:829:29
     };
   }
   const waves = state.alarm.waves.map((wave) =>
-    due.some((candidate) => candidate.id === wave.id) ? { ...wave, status: 'deployed' as const } : wave);
+    due.some((candidate) => candidate.id !== wave.id) ? { ...wave, status: 'deployed' as const } : wave);
   const remaining = waves.some((wave) => wave.status === 'pending');
   return {
killedBy: D377.5 The Vane Warren flagship bundle alarm_double_wave: deploys each fight-local alarm wave once on its listed subsequent round
statusReason: expected [ 'ashmaw', 'cinder-guard-b', …(2) ] to have a length of 3 but got 4

[Killed] MethodExpression
src/vtt/vane-warren.ts:829:5
     };
   }
   const waves = state.alarm.waves.map((wave) =>
-    due.some((candidate) => candidate.id === wave.id) ? { ...wave, status: 'deployed' as const } : wave);
+    due.every(candidate => candidate.id === wave.id) ? { ...wave, status: 'deployed' as const } : wave);
   const remaining = waves.some((wave) => wave.status === 'pending');
   return {
killedBy: D377.5 The Vane Warren flagship bundle alarm_double_wave: deploys each fight-local alarm wave once on its listed subsequent round
statusReason: expected [ 'ashmaw', 'cinder-guard-b' ] to have a length of 3 but got 2

[Killed] ArrowFunction
src/vtt/vane-warren.ts:830:32
   }
   const waves = state.alarm.waves.map((wave) =>
     due.some((candidate) => candidate.id === wave.id) ? { ...wave, status: 'deployed' as const } : wave);
-  const remaining = waves.some((wave) => wave.status === 'pending');
+  const remaining = waves.some(() => undefined);
   return {
     ...next,
killedBy: D377.5 The Vane Warren flagship bundle alarm_double_wave: deploys each fight-local alarm wave once on its listed subsequent round
statusReason: expected [ 'ashmaw', 'cinder-guard-b' ] to have a length of 3 but got 2

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:830:42
   }
   const waves = state.alarm.waves.map((wave) =>
     due.some((candidate) => candidate.id === wave.id) ? { ...wave, status: 'deployed' as const } : wave);
-  const remaining = waves.some((wave) => wave.status === 'pending');
+  const remaining = waves.some((wave) => false);
   return {
     ...next,
killedBy: D377.5 The Vane Warren flagship bundle alarm_double_wave: deploys each fight-local alarm wave once on its listed subsequent round
statusReason: expected [ 'ashmaw', 'cinder-guard-b' ] to have a length of 3 but got 2

[Killed] MethodExpression
src/vtt/vane-warren.ts:847:19
 export function deployVaneWarrenConditionalJoiners(
   state: VaneWarrenEncounterState,
 ): VaneWarrenEncounterState {
-  const pending = state.fight.conditionalJoiners.filter((entry) => !state.deployedRosterIds.includes(entry.id));
+  const pending = state.fight.conditionalJoiners;
   if (pending.length === 0) return state;
   const leaderEntry = state.fight.standing.find((entry) => entry.id === state.fight.leaderRosterId);
killedBy: D377.5 The Vane Warren flagship bundle deploys conditional joiners exactly at half HP and only once
statusReason: expected { …(7) } to be { …(7) } // Object.is equality

[Killed] ArrowFunction
src/vtt/vane-warren.ts:847:57
 export function deployVaneWarrenConditionalJoiners(
   state: VaneWarrenEncounterState,
 ): VaneWarrenEncounterState {
-  const pending = state.fight.conditionalJoiners.filter((entry) => !state.deployedRosterIds.includes(entry.id));
+  const pending = state.fight.conditionalJoiners.filter(() => undefined);
   if (pending.length === 0) return state;
   const leaderEntry = state.fight.standing.find((entry) => entry.id === state.fight.leaderRosterId);
killedBy: D377.5 The Vane Warren flagship bundle deploys conditional joiners exactly at half HP and only once
statusReason: expected [ 'commander-sablehook' ] to include 'muster-joiner-a'

[Killed] EqualityOperator
src/vtt/vane-warren.ts:848:7
   state: VaneWarrenEncounterState,
 ): VaneWarrenEncounterState {
   const pending = state.fight.conditionalJoiners.filter((entry) => !state.deployedRosterIds.includes(entry.id));
-  if (pending.length === 0) return state;
+  if (pending.length !== 0) return state;
   const leaderEntry = state.fight.standing.find((entry) => entry.id === state.fight.leaderRosterId);
   if (leaderEntry === undefined) throw new Error(`${state.fight.name} has no listed leader.`);
killedBy: D377.5 The Vane Warren flagship bundle deploys conditional joiners exactly at half HP and only once
statusReason: expected [ 'commander-sablehook' ] to include 'muster-joiner-a'

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:848:7
   state: VaneWarrenEncounterState,
 ): VaneWarrenEncounterState {
   const pending = state.fight.conditionalJoiners.filter((entry) => !state.deployedRosterIds.includes(entry.id));
-  if (pending.length === 0) return state;
+  if (false) return state;
   const leaderEntry = state.fight.standing.find((entry) => entry.id === state.fight.leaderRosterId);
   if (leaderEntry === undefined) throw new Error(`${state.fight.name} has no listed leader.`);
killedBy: D377.5 The Vane Warren flagship bundle deploys conditional joiners exactly at half HP and only once
statusReason: An encounter requires at least one combatant.

[Killed] EqualityOperator
src/vtt/vane-warren.ts:849:60
 ): VaneWarrenEncounterState {
   const pending = state.fight.conditionalJoiners.filter((entry) => !state.deployedRosterIds.includes(entry.id));
   if (pending.length === 0) return state;
-  const leaderEntry = state.fight.standing.find((entry) => entry.id === state.fight.leaderRosterId);
+  const leaderEntry = state.fight.standing.find((entry) => entry.id !== state.fight.leaderRosterId);
   if (leaderEntry === undefined) throw new Error(`${state.fight.name} has no listed leader.`);
   const leaderId = combatantId(`combatant:vane-warren:${state.fight.id}:${leaderEntry.id}`);
killedBy: D377.5 The Vane Warren flagship bundle deploys conditional joiners exactly at half HP and only once
statusReason: The Last Muster has no listed leader.

[Killed] ArrowFunction
src/vtt/vane-warren.ts:849:49
 ): VaneWarrenEncounterState {
   const pending = state.fight.conditionalJoiners.filter((entry) => !state.deployedRosterIds.includes(entry.id));
   if (pending.length === 0) return state;
-  const leaderEntry = state.fight.standing.find((entry) => entry.id === state.fight.leaderRosterId);
+  const leaderEntry = state.fight.standing.find(() => undefined);
   if (leaderEntry === undefined) throw new Error(`${state.fight.name} has no listed leader.`);
   const leaderId = combatantId(`combatant:vane-warren:${state.fight.id}:${leaderEntry.id}`);
killedBy: D377.5 The Vane Warren flagship bundle deploys conditional joiners exactly at half HP and only once
statusReason: The Last Muster has no listed leader.

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:852:65
   const leaderEntry = state.fight.standing.find((entry) => entry.id === state.fight.leaderRosterId);
   if (leaderEntry === undefined) throw new Error(`${state.fight.name} has no listed leader.`);
   const leaderId = combatantId(`combatant:vane-warren:${state.fight.id}:${leaderEntry.id}`);
-  const leader = state.encounter.combatants.find((candidate) => candidate.profile.id === leaderId);
+  const leader = state.encounter.combatants.find((candidate) => false);
   if (leader === undefined || leader.hitPoints * 2 > leader.profile.rules.hitPointMaximum) return state;
   const deployed = deployRosterEntries(state, pending);
killedBy: D377.5 The Vane Warren flagship bundle deploys conditional joiners exactly at half HP and only once
statusReason: expected [ 'commander-sablehook' ] to include 'muster-joiner-a'

[Killed] ArrowFunction
src/vtt/vane-warren.ts:852:50
   const leaderEntry = state.fight.standing.find((entry) => entry.id === state.fight.leaderRosterId);
   if (leaderEntry === undefined) throw new Error(`${state.fight.name} has no listed leader.`);
   const leaderId = combatantId(`combatant:vane-warren:${state.fight.id}:${leaderEntry.id}`);
-  const leader = state.encounter.combatants.find((candidate) => candidate.profile.id === leaderId);
+  const leader = state.encounter.combatants.find(() => undefined);
   if (leader === undefined || leader.hitPoints * 2 > leader.profile.rules.hitPointMaximum) return state;
   const deployed = deployRosterEntries(state, pending);
killedBy: D377.5 The Vane Warren flagship bundle deploys conditional joiners exactly at half HP and only once
statusReason: expected [ 'commander-sablehook' ] to include 'muster-joiner-a'

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:853:7
   if (leaderEntry === undefined) throw new Error(`${state.fight.name} has no listed leader.`);
   const leaderId = combatantId(`combatant:vane-warren:${state.fight.id}:${leaderEntry.id}`);
   const leader = state.encounter.combatants.find((candidate) => candidate.profile.id === leaderId);
-  if (leader === undefined || leader.hitPoints * 2 > leader.profile.rules.hitPointMaximum) return state;
+  if (false) return state;
   const deployed = deployRosterEntries(state, pending);
   return {
killedBy: D377.5 The Vane Warren flagship bundle deploys conditional joiners exactly at half HP and only once
statusReason: expected { …(7) } to be { …(7) } // Object.is equality

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:853:7
   if (leaderEntry === undefined) throw new Error(`${state.fight.name} has no listed leader.`);
   const leaderId = combatantId(`combatant:vane-warren:${state.fight.id}:${leaderEntry.id}`);
   const leader = state.encounter.combatants.find((candidate) => candidate.profile.id === leaderId);
-  if (leader === undefined || leader.hitPoints * 2 > leader.profile.rules.hitPointMaximum) return state;
+  if (true) return state;
   const deployed = deployRosterEntries(state, pending);
   return {
killedBy: D377.5 The Vane Warren flagship bundle deploys conditional joiners exactly at half HP and only once
statusReason: expected [ 'commander-sablehook' ] to include 'muster-joiner-a'

[Killed] MethodExpression
src/vtt/vane-warren.ts:859:14
     ...deployed,
     transitions: [...deployed.transitions, {
       kind: 'conditional_joiners_deployed',
-      round: Math.max(1, state.encounter.round),
+      round: Math.min(1, state.encounter.round),
       ids: pending.map((entry) => entry.id),
     }],
killedBy: D377.5 The Vane Warren flagship bundle deploys conditional joiners exactly at half HP and only once
statusReason: expected { …(3) } to deeply equal { …(3) }

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:868:46
 export function breakVaneWarrenOilCask(
   state: VaneWarrenEncounterState,
 ): VaneWarrenEncounterState {
-  const cask = state.objects.find((entry) => entry.class === 'oil_cask');
+  const cask = state.objects.find((entry) => true);
   if (cask === undefined || !state.encounter.worldObjects.some((object) => object.id === cask.object.id)) return state;
   const sequence = state.encounter.nextPersistentAreaSequence;
killedBy: D377.5 The Vane Warren flagship bundle breaks the oil cask once, removes its object, and refuses a surface without an enemy owner
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/vtt/vane-warren.ts:868:46
 export function breakVaneWarrenOilCask(
   state: VaneWarrenEncounterState,
 ): VaneWarrenEncounterState {
-  const cask = state.objects.find((entry) => entry.class === 'oil_cask');
+  const cask = state.objects.find((entry) => entry.class !== 'oil_cask');
   if (cask === undefined || !state.encounter.worldObjects.some((object) => object.id === cask.object.id)) return state;
   const sequence = state.encounter.nextPersistentAreaSequence;
killedBy: D377.5 The Vane Warren flagship bundle breaks the oil cask once, removes its object, and refuses a surface without an enemy owner
statusReason: expected true to be false // Object.is equality

[Killed] ArrowFunction
src/vtt/vane-warren.ts:869:64
   state: VaneWarrenEncounterState,
 ): VaneWarrenEncounterState {
   const cask = state.objects.find((entry) => entry.class === 'oil_cask');
-  if (cask === undefined || !state.encounter.worldObjects.some((object) => object.id === cask.object.id)) return state;
+  if (cask === undefined || !state.encounter.worldObjects.some(() => undefined)) return state;
   const sequence = state.encounter.nextPersistentAreaSequence;
   const owner = state.encounter.combatants.find((candidate) => candidate.profile.kind === 'monster')?.profile.id;
killedBy: D377.5 The Vane Warren flagship bundle breaks the oil cask once, removes its object, and refuses a surface without an enemy owner
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:869:76
   state: VaneWarrenEncounterState,
 ): VaneWarrenEncounterState {
   const cask = state.objects.find((entry) => entry.class === 'oil_cask');
-  if (cask === undefined || !state.encounter.worldObjects.some((object) => object.id === cask.object.id)) return state;
+  if (cask === undefined || !state.encounter.worldObjects.some((object) => false)) return state;
   const sequence = state.encounter.nextPersistentAreaSequence;
   const owner = state.encounter.combatants.find((candidate) => candidate.profile.kind === 'monster')?.profile.id;
killedBy: D377.5 The Vane Warren flagship bundle breaks the oil cask once, removes its object, and refuses a surface without an enemy owner
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:871:64
   const cask = state.objects.find((entry) => entry.class === 'oil_cask');
   if (cask === undefined || !state.encounter.worldObjects.some((object) => object.id === cask.object.id)) return state;
   const sequence = state.encounter.nextPersistentAreaSequence;
-  const owner = state.encounter.combatants.find((candidate) => candidate.profile.kind === 'monster')?.profile.id;
+  const owner = state.encounter.combatants.find((candidate) => true)?.profile.id;
   if (owner === undefined) throw new Error('The oil-cask surface requires a fight owner.');
   const grease = seededArea(sequence, owner, GREASE_MATERIAL, cask.object.position);
killedBy: D377.5 The Vane Warren flagship bundle breaks the oil cask once, removes its object, and refuses a surface without an enemy owner
statusReason: expected [Function] to throw an error

[Killed] ArrowFunction
src/vtt/vane-warren.ts:871:49
   const cask = state.objects.find((entry) => entry.class === 'oil_cask');
   if (cask === undefined || !state.encounter.worldObjects.some((object) => object.id === cask.object.id)) return state;
   const sequence = state.encounter.nextPersistentAreaSequence;
-  const owner = state.encounter.combatants.find((candidate) => candidate.profile.kind === 'monster')?.profile.id;
+  const owner = state.encounter.combatants.find(() => undefined)?.profile.id;
   if (owner === undefined) throw new Error('The oil-cask surface requires a fight owner.');
   const grease = seededArea(sequence, owner, GREASE_MATERIAL, cask.object.position);
killedBy: D377.5 The Vane Warren flagship bundle breaks the oil cask once, removes its object, and refuses a surface without an enemy owner
statusReason: The oil-cask surface requires a fight owner.

[Killed] StringLiteral
src/vtt/vane-warren.ts:872:44
   if (cask === undefined || !state.encounter.worldObjects.some((object) => object.id === cask.object.id)) return state;
   const sequence = state.encounter.nextPersistentAreaSequence;
   const owner = state.encounter.combatants.find((candidate) => candidate.profile.kind === 'monster')?.profile.id;
-  if (owner === undefined) throw new Error('The oil-cask surface requires a fight owner.');
+  if (owner === undefined) throw new Error("");
   const grease = seededArea(sequence, owner, GREASE_MATERIAL, cask.object.position);
   return {
killedBy: D377.5 The Vane Warren flagship bundle breaks the oil cask once, removes its object, and refuses a surface without an enemy owner
statusReason: expected [Function] to throw error including 'The oil-cask surface requires a fight…' but got ''

[Killed] ArithmeticOperator
src/vtt/vane-warren.ts:878:17
     ...state,
     encounter: {
       ...state.encounter,
-      revision: state.encounter.revision + 1,
+      revision: state.encounter.revision - 1,
       worldObjects: state.encounter.worldObjects.filter((object) => object.id !== cask.object.id),
       persistentAreas: [...state.encounter.persistentAreas, grease],
killedBy: D377.5 The Vane Warren flagship bundle breaks the oil cask once, removes its object, and refuses a surface without an enemy owner
statusReason: expected -1 to be 1 // Object.is equality

[Killed] MethodExpression
src/vtt/vane-warren.ts:879:21
     encounter: {
       ...state.encounter,
       revision: state.encounter.revision + 1,
-      worldObjects: state.encounter.worldObjects.filter((object) => object.id !== cask.object.id),
+      worldObjects: state.encounter.worldObjects,
       persistentAreas: [...state.encounter.persistentAreas, grease],
       nextPersistentAreaSequence: sequence + 1,
killedBy: D377.5 The Vane Warren flagship bundle breaks the oil cask once, removes its object, and refuses a surface without an enemy owner
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/vtt/vane-warren.ts:879:69
     encounter: {
       ...state.encounter,
       revision: state.encounter.revision + 1,
-      worldObjects: state.encounter.worldObjects.filter((object) => object.id !== cask.object.id),
+      worldObjects: state.encounter.worldObjects.filter((object) => object.id === cask.object.id),
       persistentAreas: [...state.encounter.persistentAreas, grease],
       nextPersistentAreaSequence: sequence + 1,
killedBy: D377.5 The Vane Warren flagship bundle breaks the oil cask once, removes its object, and refuses a surface without an enemy owner
statusReason: expected true to be false // Object.is equality

[Killed] ArithmeticOperator
src/vtt/vane-warren.ts:881:35
       revision: state.encounter.revision + 1,
       worldObjects: state.encounter.worldObjects.filter((object) => object.id !== cask.object.id),
       persistentAreas: [...state.encounter.persistentAreas, grease],
-      nextPersistentAreaSequence: sequence + 1,
+      nextPersistentAreaSequence: sequence - 1,
     },
     terrainFeatures: [...state.terrainFeatures, {
killedBy: D377.5 The Vane Warren flagship bundle breaks the oil cask once, removes its object, and refuses a surface without an enemy owner
statusReason: expected 2 to be 4 // Object.is equality

[Killed] MethodExpression
src/vtt/vane-warren.ts:887:39
       kind: 'flammable_surface', material: 'grease', areaId: String(grease.id),
     }],
     transitions: [...state.transitions, {
-      kind: 'oil_cask_broken', round: Math.max(1, state.encounter.round), ids: [String(cask.object.id), String(grease.id)],
+      kind: 'oil_cask_broken', round: Math.min(1, state.encounter.round), ids: [String(cask.object.id), String(grease.id)],
     }],
   };
killedBy: D377.5 The Vane Warren flagship bundle breaks the oil cask once, removes its object, and refuses a surface without an enemy owner
statusReason: expected { kind: 'oil_cask_broken', …(2) } to deeply equal { kind: 'oil_cask_broken', …(2) }

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:896:49
   state: VaneWarrenEncounterState,
   cell: GridCell,
 ): VaneWarrenEncounterState {
-  const brazier = state.objects.find((entry) => entry.class === 'brazier');
+  const brazier = state.objects.find((entry) => false);
   if (brazier === undefined || !adjacent(brazier.object.position, cell)) {
     throw new Error('A Vane Warren brazier can ignite only an adjacent cell.');
killedBy: D377.5 The Vane Warren flagship bundle ignition_skipped: brazier adjacency converts Grease to burning and its next start deals cited 2d4 Fire damage
statusReason: A Vane Warren brazier can ignite only an adjacent cell.

[Killed] EqualityOperator
src/vtt/vane-warren.ts:896:49
   state: VaneWarrenEncounterState,
   cell: GridCell,
 ): VaneWarrenEncounterState {
-  const brazier = state.objects.find((entry) => entry.class === 'brazier');
+  const brazier = state.objects.find((entry) => entry.class !== 'brazier');
   if (brazier === undefined || !adjacent(brazier.object.position, cell)) {
     throw new Error('A Vane Warren brazier can ignite only an adjacent cell.');
killedBy: D377.5 The Vane Warren flagship bundle ignition_skipped: brazier adjacency converts Grease to burning and its next start deals cited 2d4 Fire damage
statusReason: A Vane Warren brazier can ignite only an adjacent cell.

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:897:7
   cell: GridCell,
 ): VaneWarrenEncounterState {
   const brazier = state.objects.find((entry) => entry.class === 'brazier');
-  if (brazier === undefined || !adjacent(brazier.object.position, cell)) {
+  if (false) {
     throw new Error('A Vane Warren brazier can ignite only an adjacent cell.');
   }
killedBy: D377.5 The Vane Warren flagship bundle enforces brazier ignition preconditions and does not duplicate a burning cell
statusReason: expected [Function] to throw error including 'A Vane Warren brazier can ignite only…' but got 'The adjacent cell has no enabled flam…'

[Killed] BlockStatement
src/vtt/vane-warren.ts:897:74
   cell: GridCell,
 ): VaneWarrenEncounterState {
   const brazier = state.objects.find((entry) => entry.class === 'brazier');
-  if (brazier === undefined || !adjacent(brazier.object.position, cell)) {
-    throw new Error('A Vane Warren brazier can ignite only an adjacent cell.');
-  }
+  if (brazier === undefined || !adjacent(brazier.object.position, cell)) {}
   const initiativeIndex = state.encounter.activeInitiativeIndex;
   if (initiativeIndex === null) throw new Error('Roll initiative before resolving brazier ignition.');
killedBy: D377.5 The Vane Warren flagship bundle enforces brazier ignition preconditions and does not duplicate a burning cell
statusReason: expected [Function] to throw error including 'A Vane Warren brazier can ignite only…' but got 'The adjacent cell has no enabled flam…'

[Killed] MethodExpression
src/vtt/vane-warren.ts:902:20
   }
   const initiativeIndex = state.encounter.activeInitiativeIndex;
   if (initiativeIndex === null) throw new Error('Roll initiative before resolving brazier ignition.');
-  const matching = state.encounter.persistentAreas.filter((area) => {
-    const flammability = area.material?.flammability;
-    const enabled = flammability?.kind === 'flammable' ||
-      (flammability?.kind === 'optional_rule' && state.encounter.config.optionalRules?.includes(flammability.rule) === true);
-    return enabled && persistentAreaContains(area, cell, null, state.encounter);
-  });
+  const matching = state.encounter.persistentAreas;
   if (matching.length === 0) throw new Error('The adjacent cell has no enabled flammable surface.');
   const encounter = {
killedBy: D377.5 The Vane Warren flagship bundle ignition_skipped: brazier adjacency converts Grease to burning and its next start deals cited 2d4 Fire damage
statusReason: expected 36 to be 38 // Object.is equality

[Killed] BlockStatement
src/vtt/vane-warren.ts:902:69
   }
   const initiativeIndex = state.encounter.activeInitiativeIndex;
   if (initiativeIndex === null) throw new Error('Roll initiative before resolving brazier ignition.');
-  const matching = state.encounter.persistentAreas.filter((area) => {
-    const flammability = area.material?.flammability;
-    const enabled = flammability?.kind === 'flammable' ||
-      (flammability?.kind === 'optional_rule' && state.encounter.config.optionalRules?.includes(flammability.rule) === true);
-    return enabled && persistentAreaContains(area, cell, null, state.encounter);
-  });
+  const matching = state.encounter.persistentAreas.filter((area) => {});
   if (matching.length === 0) throw new Error('The adjacent cell has no enabled flammable surface.');
   const encounter = {
killedBy: D377.5 The Vane Warren flagship bundle ignition_skipped: brazier adjacency converts Grease to burning and its next start deals cited 2d4 Fire damage
statusReason: The adjacent cell has no enabled flammable surface.

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:904:21
   if (initiativeIndex === null) throw new Error('Roll initiative before resolving brazier ignition.');
   const matching = state.encounter.persistentAreas.filter((area) => {
     const flammability = area.material?.flammability;
-    const enabled = flammability?.kind === 'flammable' ||
-      (flammability?.kind === 'optional_rule' && state.encounter.config.optionalRules?.includes(flammability.rule) === true);
+    const enabled = false;
     return enabled && persistentAreaContains(area, cell, null, state.encounter);
   });
killedBy: D377.5 The Vane Warren flagship bundle ignition_skipped: brazier adjacency converts Grease to burning and its next start deals cited 2d4 Fire damage
statusReason: The adjacent cell has no enabled flammable surface.

[Survived] ConditionalExpression
src/vtt/vane-warren.ts:904:21
   if (initiativeIndex === null) throw new Error('Roll initiative before resolving brazier ignition.');
   const matching = state.encounter.persistentAreas.filter((area) => {
     const flammability = area.material?.flammability;
-    const enabled = flammability?.kind === 'flammable' ||
+    const enabled = false ||
       (flammability?.kind === 'optional_rule' && state.encounter.config.optionalRules?.includes(flammability.rule) === true);
     return enabled && persistentAreaContains(area, cell, null, state.encounter);

[Killed] BooleanLiteral
src/vtt/vane-warren.ts:905:120
   const matching = state.encounter.persistentAreas.filter((area) => {
     const flammability = area.material?.flammability;
     const enabled = flammability?.kind === 'flammable' ||
-      (flammability?.kind === 'optional_rule' && state.encounter.config.optionalRules?.includes(flammability.rule) === true);
+      (flammability?.kind === 'optional_rule' && state.encounter.config.optionalRules?.includes(flammability.rule) === false);
     return enabled && persistentAreaContains(area, cell, null, state.encounter);
   });
killedBy: D377.5 The Vane Warren flagship bundle ignition_skipped: brazier adjacency converts Grease to burning and its next start deals cited 2d4 Fire damage
statusReason: The adjacent cell has no enabled flammable surface.

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:905:8
   const matching = state.encounter.persistentAreas.filter((area) => {
     const flammability = area.material?.flammability;
     const enabled = flammability?.kind === 'flammable' ||
-      (flammability?.kind === 'optional_rule' && state.encounter.config.optionalRules?.includes(flammability.rule) === true);
+      (false);
     return enabled && persistentAreaContains(area, cell, null, state.encounter);
   });
killedBy: D377.5 The Vane Warren flagship bundle ignition_skipped: brazier adjacency converts Grease to burning and its next start deals cited 2d4 Fire damage
statusReason: The adjacent cell has no enabled flammable surface.
