[Killed] ConditionalExpression
src/vtt/vane-warren.ts:906:12
     const flammability = area.material?.flammability;
     const enabled = flammability?.kind === 'flammable' ||
       (flammability?.kind === 'optional_rule' && state.encounter.config.optionalRules?.includes(flammability.rule) === true);
-    return enabled && persistentAreaContains(area, cell, null, state.encounter);
+    return false;
   });
   if (matching.length === 0) throw new Error('The adjacent cell has no enabled flammable surface.');
killedBy: D377.5 The Vane Warren flagship bundle ignition_skipped: brazier adjacency converts Grease to burning and its next start deals cited 2d4 Fire damage
statusReason: The adjacent cell has no enabled flammable surface.

[Killed] LogicalOperator
src/vtt/vane-warren.ts:906:12
     const flammability = area.material?.flammability;
     const enabled = flammability?.kind === 'flammable' ||
       (flammability?.kind === 'optional_rule' && state.encounter.config.optionalRules?.includes(flammability.rule) === true);
-    return enabled && persistentAreaContains(area, cell, null, state.encounter);
+    return enabled || persistentAreaContains(area, cell, null, state.encounter);
   });
   if (matching.length === 0) throw new Error('The adjacent cell has no enabled flammable surface.');
killedBy: D377.5 The Vane Warren flagship bundle ignition_skipped: brazier adjacency converts Grease to burning and its next start deals cited 2d4 Fire damage
statusReason: expected 36 to be 38 // Object.is equality

[Killed] EqualityOperator
src/vtt/vane-warren.ts:908:7
       (flammability?.kind === 'optional_rule' && state.encounter.config.optionalRules?.includes(flammability.rule) === true);
     return enabled && persistentAreaContains(area, cell, null, state.encounter);
   });
-  if (matching.length === 0) throw new Error('The adjacent cell has no enabled flammable surface.');
+  if (matching.length !== 0) throw new Error('The adjacent cell has no enabled flammable surface.');
   const encounter = {
     ...state.encounter,
killedBy: D377.5 The Vane Warren flagship bundle ignition_skipped: brazier adjacency converts Grease to burning and its next start deals cited 2d4 Fire damage
statusReason: The adjacent cell has no enabled flammable surface.

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:908:7
       (flammability?.kind === 'optional_rule' && state.encounter.config.optionalRules?.includes(flammability.rule) === true);
     return enabled && persistentAreaContains(area, cell, null, state.encounter);
   });
-  if (matching.length === 0) throw new Error('The adjacent cell has no enabled flammable surface.');
+  if (false) throw new Error('The adjacent cell has no enabled flammable surface.');
   const encounter = {
     ...state.encounter,
killedBy: D377.5 The Vane Warren flagship bundle enforces brazier ignition preconditions and does not duplicate a burning cell
statusReason: expected [Function] to throw an error

[Killed] ArrowFunction
src/vtt/vane-warren.ts:912:82
   const encounter = {
     ...state.encounter,
     revision: state.encounter.revision + 1,
-    persistentAreas: state.encounter.persistentAreas.map((area) => matching.some((candidate) => candidate.id === area.id)
+    persistentAreas: state.encounter.persistentAreas.map((area) => matching.some(() => undefined)
       ? {
           ...area,
killedBy: D377.5 The Vane Warren flagship bundle ignition_skipped: brazier adjacency converts Grease to burning and its next start deals cited 2d4 Fire damage
statusReason: expected [] to deeply equal [ ObjectContaining{…} ]

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:912:97
   const encounter = {
     ...state.encounter,
     revision: state.encounter.revision + 1,
-    persistentAreas: state.encounter.persistentAreas.map((area) => matching.some((candidate) => candidate.id === area.id)
+    persistentAreas: state.encounter.persistentAreas.map((area) => matching.some((candidate) => true)
       ? {
           ...area,
killedBy: D377.5 The Vane Warren flagship bundle ignition_skipped: brazier adjacency converts Grease to burning and its next start deals cited 2d4 Fire damage
statusReason: expected 36 to be 38 // Object.is equality

[Killed] ArrowFunction
src/vtt/vane-warren.ts:915:48
     persistentAreas: state.encounter.persistentAreas.map((area) => matching.some((candidate) => candidate.id === area.id)
       ? {
           ...area,
-          burningCells: area.burningCells.some((entry) => entry.cell.column === cell.column && entry.cell.row === cell.row)
+          burningCells: area.burningCells.some(() => undefined)
             ? area.burningCells
             : [...area.burningCells, {
killedBy: D377.5 The Vane Warren flagship bundle enforces brazier ignition preconditions and does not duplicate a burning cell
statusReason: expected [ …(2) ] to deeply equal [ [ { cell: { …(2) }, …(1) } ], …(1) ]

[Killed] EqualityOperator
src/vtt/vane-warren.ts:915:96
     persistentAreas: state.encounter.persistentAreas.map((area) => matching.some((candidate) => candidate.id === area.id)
       ? {
           ...area,
-          burningCells: area.burningCells.some((entry) => entry.cell.column === cell.column && entry.cell.row === cell.row)
+          burningCells: area.burningCells.some((entry) => entry.cell.column === cell.column && entry.cell.row !== cell.row)
             ? area.burningCells
             : [...area.burningCells, {
killedBy: D377.5 The Vane Warren flagship bundle enforces brazier ignition preconditions and does not duplicate a burning cell
statusReason: expected [ …(2) ] to deeply equal [ [ { cell: { …(2) }, …(1) } ], …(1) ]

[Killed] ArithmeticOperator
src/vtt/vane-warren.ts:919:39
             ? area.burningCells
             : [...area.burningCells, {
                 cell: { ...cell },
-                burnsAwayAt: { round: state.encounter.round + 1, initiativeIndex },
+                burnsAwayAt: { round: state.encounter.round - 1, initiativeIndex },
               }],
         }
killedBy: D377.5 The Vane Warren flagship bundle ignition_skipped: brazier adjacency converts Grease to burning and its next start deals cited 2d4 Fire damage
statusReason: expected 40 to be 38 // Object.is equality

[Survived] LogicalOperator
src/vtt/vane-warren.ts:947:61
   }));
   const bundle = createVaneWarrenFight(fightId, players, scenario);
   const state = preloadPartySessionState(bundle.encounter, partyState);
-  const partyActions = loadedPartyTurnLegalActions(members, policy ?? {
-    useHealingPotions: true,
-    openWithBless: true,
-    reserveClericSlotsForBless: true,
-    useWizardTactics: true,
-    useClericContingency: true,
-  });
+  const partyActions = loadedPartyTurnLegalActions(members, policy && {
+  useHealingPotions: true,
+  openWithBless: true,
+  reserveClericSlotsForBless: true,
+  useWizardTactics: true,
+  useClericContingency: true
+});
   return {
     rulesEdition: '2024',

[Survived] BooleanLiteral
src/vtt/vane-warren.ts:948:24
   const bundle = createVaneWarrenFight(fightId, players, scenario);
   const state = preloadPartySessionState(bundle.encounter, partyState);
   const partyActions = loadedPartyTurnLegalActions(members, policy ?? {
-    useHealingPotions: true,
+    useHealingPotions: false,
     openWithBless: true,
     reserveClericSlotsForBless: true,

[Survived] BooleanLiteral
src/vtt/vane-warren.ts:949:20
   const state = preloadPartySessionState(bundle.encounter, partyState);
   const partyActions = loadedPartyTurnLegalActions(members, policy ?? {
     useHealingPotions: true,
-    openWithBless: true,
+    openWithBless: false,
     reserveClericSlotsForBless: true,
     useWizardTactics: true,

[Killed] BooleanLiteral
src/vtt/vane-warren.ts:950:33
   const partyActions = loadedPartyTurnLegalActions(members, policy ?? {
     useHealingPotions: true,
     openWithBless: true,
-    reserveClericSlotsForBless: true,
+    reserveClericSlotsForBless: false,
     useWizardTactics: true,
     useClericContingency: true,
killedBy: Vane Warren loader, chaining, seats, and end-session export all-algorithm chain concludes Iron Voice and assigns its conditional successor roster
statusReason: expected 2 to be greater than 2

[Survived] BooleanLiteral
src/vtt/vane-warren.ts:951:23
     useHealingPotions: true,
     openWithBless: true,
     reserveClericSlotsForBless: true,
-    useWizardTactics: true,
+    useWizardTactics: false,
     useClericContingency: true,
   });

[Survived] BooleanLiteral
src/vtt/vane-warren.ts:952:27
     openWithBless: true,
     reserveClericSlotsForBless: true,
     useWizardTactics: true,
-    useClericContingency: true,
+    useClericContingency: false,
   });
   return {

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:963:50
     playerIds: players.map((profile) => profile.id),
     controllers: storedPartyControllerIdentities(state.combatants),
     turnLegalActions: (current, actor) => {
-      const member = members.find((candidate) => candidate.profile.id === actor);
+      const member = members.find((candidate) => false);
       const base = member === undefined
         ? regretTurnLegalActions(current, actor).actions
killedBy: D382 survival package pins the fixed 30-seed final-encounter survival fraction at or above two thirds
statusReason: expected { successes: 30, total: 30 } to deeply equal { successes: 29, total: 30 }

[Killed] ArrowFunction
src/vtt/vane-warren.ts:963:35
     playerIds: players.map((profile) => profile.id),
     controllers: storedPartyControllerIdentities(state.combatants),
     turnLegalActions: (current, actor) => {
-      const member = members.find((candidate) => candidate.profile.id === actor);
+      const member = members.find(() => undefined);
       const base = member === undefined
         ? regretTurnLegalActions(current, actor).actions
killedBy: D382 survival package pins the fixed 30-seed final-encounter survival fraction at or above two thirds
statusReason: expected { successes: 30, total: 30 } to deeply equal { successes: 29, total: 30 }

[Killed] ConditionalExpression
src/vtt/vane-warren.ts:964:20
     controllers: storedPartyControllerIdentities(state.combatants),
     turnLegalActions: (current, actor) => {
       const member = members.find((candidate) => candidate.profile.id === actor);
-      const base = member === undefined
+      const base = true
         ? regretTurnLegalActions(current, actor).actions
         : partyActions(current, actor).actions;
killedBy: D382 survival package pins the fixed 30-seed final-encounter survival fraction at or above two thirds
statusReason: expected { successes: 30, total: 30 } to deeply equal { successes: 29, total: 30 }

[Timeout] ConditionalExpression
src/vtt/vane-warren.ts:964:20
     controllers: storedPartyControllerIdentities(state.combatants),
     turnLegalActions: (current, actor) => {
       const member = members.find((candidate) => candidate.profile.id === actor);
-      const base = member === undefined
+      const base = false
         ? regretTurnLegalActions(current, actor).actions
         : partyActions(current, actor).actions;

[NoCoverage] BooleanLiteral
src/vtt/vane-warren.ts:986:28
       displayNames,
       partyState,
       {
-        useHealingPotions: true,
+        useHealingPotions: false,
         openWithBless: true,
         reserveClericSlotsForBless: true,

[NoCoverage] EqualityOperator
src/vtt/vane-warren.ts:991:39
         reserveClericSlotsForBless: true,
         useWizardTactics: true,
         useClericContingency: true,
-        reserveClericSlotForRevivify: scenario === 'tpk-recovery',
+        reserveClericSlotForRevivify: scenario !== 'tpk-recovery',
       },
       scenario,

[NoCoverage] ConditionalExpression
src/vtt/vane-warren.ts:991:39
         reserveClericSlotsForBless: true,
         useWizardTactics: true,
         useClericContingency: true,
-        reserveClericSlotForRevivify: scenario === 'tpk-recovery',
+        reserveClericSlotForRevivify: false,
       },
       scenario,

[NoCoverage] BooleanLiteral
src/vtt/vane-warren.ts:1002:20
         controllerId: `${identity.combatantId}:algorithm:rehearsal`,
         kind: 'algorithm' as const,
       })),
-      startPaused: true,
+      startPaused: false,
       sessionFlow: {
         name: config.sessionName,

[Killed] ArithmeticOperator
src/vtt/vane-warren.ts:1010:41
       },
     };
   }
-  const fightId = VANE_WARREN_FIGHT_IDS[partyState.room - 1];
+  const fightId = VANE_WARREN_FIGHT_IDS[partyState.room + 1];
   if (fightId === undefined) {
     throw new Error('The three-encounter Vane Warren session is complete.');
killedBy: Vane Warren loader, chaining, seats, and end-session export bounds_mismatch_reintroduced: reaches DM controls for all three authored fights with their matching art package
statusReason: expected 'encounter:vane-warren: The Last Muste…' to contain 'The Cinder Rite'

[Killed] StringLiteral
src/vtt/vane-warren.ts:1018:13
     ...composeVaneWarrenFight(fightId, members, displayNames, partyState),
     composeNextRoom: composeVaneWarrenSessionEncounter,
     sessionFlow: {
-      name: 'The Vane Warren',
+      name: "",
       encounterCount: 3,
       endControlLabel: 'End Session and export',
killedBy: Vane Warren loader, chaining, seats, and end-session export export_drops_encounter: End Session emits one parseable export containing all three played encounters
statusReason: expected { name: '', encounterCount: 3, …(1) } to deeply equal { name: 'The Vane Warren', …(2) }

[Killed] StringLiteral
src/vtt/vane-warren.ts:1020:24
     sessionFlow: {
       name: 'The Vane Warren',
       encounterCount: 3,
-      endControlLabel: 'End Session and export',
+      endControlLabel: "",
     },
   };
killedBy: Vane Warren loader, chaining, seats, and end-session export export_drops_encounter: End Session emits one parseable export containing all three played encounters
statusReason: expected { name: 'The Vane Warren', …(2) } to deeply equal { name: 'The Vane Warren', …(2) }
